{
  "placeDetails": {
    "name": "Walker Hotel Tribeca",
    "category": null,
    "smallDescription": null,
    "address": "77 Walker St, New York, NY 10013",
    "contactDetails": [
      "77 Walker St, New York, NY 10013",
      "walkerhotels.com",
      "(212) 735-8000",
      "PX9X+93 New York"
    ],
    "rating": "4.1",
    "totalReviews": "541"
  },
  "reviews": [
    {
      "user": "Laura Kee",
      "rating": "3/5",
      "text": "My husband and I have stayed in a lot of hotels in Manhattan and wouldn’t return here. The location is great and the Blue Bottle in the lobby was lovely to have. Check in was a mess, service throughout our stay was not great, and room keys …",
      "date": null,
      "userInfo": "3 reviews"
    },
    {
      "user": "Kelly Elaine Alexander",
      "rating": "2/5",
      "text": "Location was fine and the room was clean. Service at the front desk was extraordinarily, above-and-beyond helpful, with everything from AC to check-in. However, the rooms are so small that they're barely habitable—the bed was so small that …",
      "date": null,
      "userInfo": "50 reviews · 1 photo"
    },
    {
      "user": "Madelyn Taylor",
      "rating": "5/5",
      "text": "I could not have asked for a better experience at this hotel! From the moment we walked in, the staff was friendly and helpful. We were upgraded to a king suite and received free drink vouchers. While we were only staying one night, we got …",
      "date": null,
      "userInfo": "1 review"
    },
    {
      "user": "Marni Appleton",
      "rating": "4/5",
      "text": "Great location and staff are very helpful. The room was mostly clean but some corners had dust buildup and/or weren’t wiped properly. Some parts of the room a bit tired and in need of TLC. Rooms are very small - but that’s manhattan for …",
      "date": null,
      "userInfo": "9 reviews"
    },
    {
      "user": "Jillian O'Connor",
      "rating": "5/5",
      "text": "The staff here are incredibly friendly and go out of their way to make sure you feel welcome! It was our first time here, and our room was upgraded and the manager gave us two free drinks as well. The rooms were exactly as pictured and very clean. Perfect for two people. Location was great as well. Would definitely stay here again!",
      "date": null,
      "userInfo": "6 reviews"
    },
    {
      "user": "Richard Kahn",
      "rating": "3/5",
      "text": "Pros:\n- Great location!\n- Rooms are clean and nice feeling. …",
      "date": null,
      "userInfo": "5 reviews"
    },
    {
      "user": "Jaycee Ewing",
      "rating": "5/5",
      "text": "Came here for a one night stay and it was such a lovely experience. Bridgette and all the other staff members we engaged with were so nice. The location is in great spot and you have two bars, a restaurant, and two coffee/pastries options …",
      "date": null,
      "userInfo": "8 reviews · 10 photos"
    },
    {
      "user": "Rafael Morales",
      "rating": "5/5",
      "text": "Stay at the hotel last week and the service was excellent. Shauna at the front the desk was super helpful and very welcoming. The rooms were great too, wish they were a tad bit bigger but definitely fine for my length of stay. Would highly recommend this place.",
      "date": null,
      "userInfo": "2 reviews"
    },
    {
      "user": "Courtney Schmidtberger",
      "rating": "5/5",
      "text": "Stayed here for a long weekend with a friend. It was a lovely hotel with character and charm. Loved the on-site restaurant, coffee shop, lounge and rooftop. Staff were always friendly. Good location. Would definitely recommend.",
      "date": null,
      "userInfo": "30 reviews"
    },
    {
      "user": "Lutz Zimmermann",
      "rating": "5/5",
      "text": "Really friendly staff everyone, great coffee and breakfast. Unique experience in their underground bar. Nice room. Good gym. Would come again! 🥰 …",
      "date": null,
      "userInfo": "22 reviews · 1 photo"
    },
    {
      "user": "Brandon Dellucky",
      "rating": "5/5",
      "text": "I’ve stayed here many times over the years and I love it. Perfect location for my interests, comfy rooms, and great staff. In particular, Nelson is always ready to help with my bags, storing items before and after checkout, and offering …",
      "date": null,
      "userInfo": "7 reviews"
    },
    {
      "user": "David Irthum",
      "rating": "5/5",
      "text": "I was impressed with the check-in with their friendly but professional personality. They explained how use your room car to use to go up to your or roof top. They gave a map of  how locate the numerous art galleries nearby The check -in staff told of what services were available.",
      "date": null,
      "userInfo": "Local Guide · 278 reviews · 381 photos"
    },
    {
      "user": "Erika B.",
      "rating": "2/5",
      "text": "Location and service were fine. Room was awful. It was insanely small, but that was expected. No fridge, our safe was broken so we couldn’t even use that, and we couldn’t sleep at night because it sounded like the window was open (even …",
      "date": null,
      "userInfo": "5 reviews · 2 photos"
    },
    {
      "user": "Steven Anthony",
      "rating": "2/5",
      "text": "Great location. On check in, my door lock was broken and couldn’t close my door. I asked for someone to come fix it and nobody showed up within 1 hour so I tampered with the door and closed it myself. I was only visiting nyc for 2 days so I …",
      "date": null,
      "userInfo": "Local Guide · 81 reviews · 199 photos"
    },
    {
      "user": "R B",
      "rating": "3/5",
      "text": "I stayed here in May 2024 and I can say I will not stay here again or recommend it to friends. The rooms are tiny, even by NYC standards, the layout of the hotel is odd, no ramp for luggage, front desk down a set of stairs, small dark …",
      "date": null,
      "userInfo": "6 reviews"
    },
    {
      "user": "Blondie 205",
      "rating": "5/5",
      "text": "Went here for a solo trip into NYC for MDW. Honestly the best spot and reasonable for being in Tribeca. You are just minutes away from Chinatown and Little Italy not to mention the Brooklyn Bridge. Tons of great restaurants and the …",
      "date": null,
      "userInfo": "Local Guide · 132 reviews · 652 photos"
    },
    {
      "user": "Whatsa MyName",
      "rating": "4/5",
      "text": "I'm going to give you the good and the bad.\nThere are a lot of good things about the Walker Tribeca, which you will see in the pictures. The bad things, though, while few, are enough of a deal breaker …",
      "date": null,
      "userInfo": "88 reviews · 140 photos"
    },
    {
      "user": "Aimée Jordan",
      "rating": "3/5",
      "text": "No ramp for luggage and no one helps you get up to the front desk which I thought was odd. There are a number of steps to get inside and then you have to go downstairs to check in. The elevator and hallways are small and narrow but the …",
      "date": null,
      "userInfo": "Local Guide · 125 reviews · 1,588 photos"
    },
    {
      "user": "ozz",
      "rating": "2/5",
      "text": "Both elevators were down, the whole hotel had to use the staff elevator. Incredibly slow\nNo coffee maker inside rooms. The “do not disturb” light didn’t work, so was …",
      "date": null,
      "userInfo": "Local Guide · 46 reviews · 35 photos"
    },
    {
      "user": "Angela Ho",
      "rating": "2/5",
      "text": "I recently stayed at the Walker Hotel in Tribeca and was disappointed by my experience. Despite the hotel's charming decor and convenient location, several issues significantly marred our stay. …",
      "date": null,
      "userInfo": "1 review"
    },
    {
      "user": "Talia Paquet",
      "rating": "5/5",
      "text": "I visit the city on a monthly basis and this is the ONLY place I would ever stay in NYC. It is honestly a second home for me. From beginning to end, the Walker Tribeca offers you a flawless stay. Perfect location. Best area. The bars and …",
      "date": null,
      "userInfo": "26 reviews"
    },
    {
      "user": "Mulan Mu",
      "rating": "2/5",
      "text": "Room 219 is extremely noisy --- DO NOT STAY. If you stay, make sure you stay on a higher floor and/or not on the same corner as 219. …",
      "date": null,
      "userInfo": "2 reviews"
    },
    {
      "user": "Anne Hedekin",
      "rating": "5/5",
      "text": "My daughter and I had a great time at the Walker. Yes, rooms are small but that is what is expected in TriBeCa/soho and from a fun boutique hotel.  We booked through NYU and thought we were getting a deal but looks like we overpaid a bit-my only regret there but we had a great stay and love the space.",
      "date": null,
      "userInfo": "4 reviews"
    },
    {
      "user": "Lisa Lucas",
      "rating": "3/5",
      "text": "Very beautiful hotel, except the size of the room my wife and I rented for just a few hours was very small and very expensive for us, charged us $354.00.They didn't offer a bereavement fare nor a complimentary breakfast. None of our money back when we checked in around 4 AM Wed morning and checked out before the 10 AM check out time..",
      "date": null,
      "userInfo": "Local Guide · 16 reviews"
    },
    {
      "user": "Lloyd van den Ende",
      "rating": "4/5",
      "text": "We are very happy to have booked this hotel. It has a convenient location near the Canal St. Metro station and SoHo. Lots of different breakfast, lunch and dinner options within walking distance. …",
      "date": null,
      "userInfo": "Local Guide · 324 reviews · 993 photos"
    },
    {
      "user": "Saint Tisdale",
      "rating": "5/5",
      "text": "The Walker Hotel Tribeca is a hidden gem in the heart of New York City, offering an unparalleled boutique experience. From the moment you step into the stylish lobby, you're greeted by a warm and welcoming ambiance that perfectly blends …",
      "date": null,
      "userInfo": "3 reviews"
    },
    {
      "user": "Ryan Rios",
      "rating": "1/5",
      "text": "I was traveling with family and friends, and coordinated the group to stay at the hotel, with three reservations. The night prior to arriving in NYC, I called to see if we could have access to one room to drop our luggage and freshen up …",
      "date": null,
      "userInfo": "2 reviews · 4 photos"
    },
    {
      "user": "Kae Yen W",
      "rating": "3/5",
      "text": "The rooms are so absurdly tiny it’s kinda funny. Especially for the price. King bed is up against three walls so you can only access it from one side. Terrible sound proofing from the street and inside. You can easily hear other people’s …",
      "date": null,
      "userInfo": "20 reviews · 8 photos"
    },
    {
      "user": "Rijo Mathew",
      "rating": "5/5",
      "text": "What a great location for a hotel! Would highly recommend to friends and family visiting from out of town or even just for a staycation. Cozy, functional room with incredible views and access to top-notch food and activities. The staff were …",
      "date": null,
      "userInfo": "4 reviews"
    },
    {
      "user": "Marco Milano",
      "rating": "1/5",
      "text": "I checked in and have been asked for a caution of 500 USD (to be frozen on the credit card) to cover eventual damage, or for expenditure I will have like drinks. As I checked out, they told me I have around 70 USD costs for some stuff I …",
      "date": null,
      "userInfo": "8 reviews · 6 photos"
    },
    {
      "user": "Gabriel Lesnick",
      "rating": "1/5",
      "text": "rooms are small for NY and poorly maintained. hotel is not actually in tribeca. there are so many better hotels, I don't know why anyone would ever willingly stay here",
      "date": null,
      "userInfo": "Local Guide · 51 reviews"
    },
    {
      "user": "Jolie",
      "rating": "3/5",
      "text": "Pros: The rooms are well designed with a comfortable bed and nice sheets. Shower is great and the auto blinds are clutch. The location is also really great and I love how there’s a coffee shop downstairs. …",
      "date": null,
      "userInfo": "10 reviews · 3 photos"
    },
    {
      "user": "Myra Rivers",
      "rating": "3/5",
      "text": "The room was the size of a closet, no space to put anything or even walk. Extremely cramped. Only had access to the bed from one side. The view is of another building across the street. The location was more of Chinatown than TriBeCa. It’s …",
      "date": null,
      "userInfo": "Local Guide · 31 reviews · 22 photos"
    },
    {
      "user": "Mark Wilson",
      "rating": "5/5",
      "text": "I was invited here on a sex date. The rooms are small but smart; the closeness of the walls and furniture provide lots of sturdy push-off points for different positions and angles. Staff made me feel welcome and unashamed as I left early. …",
      "date": null,
      "userInfo": "Local Guide · 85 reviews · 37 photos"
    },
    {
      "user": "S G",
      "rating": "5/5",
      "text": "Staff is amazing it’s always a pleasure staying here they definitely go above and beyond to accommodate you best staff ever  I also love how clean the rooms are would recommend this hotel to everyone",
      "date": null,
      "userInfo": "7 reviews · 1 photo"
    },
    {
      "user": "Truc Duong",
      "rating": "1/5",
      "text": "we booked the trip far in advance and paid all needed fees when we arrived they placed a $400 hold on our credit card for “incidentals”. after we left we were charged $107 for wifi(on the website it said free), water, gym, and 20% off the …",
      "date": null,
      "userInfo": "2 reviews"
    },
    {
      "user": "Leigh Tolboe",
      "rating": "5/5",
      "text": "Last minute booking for one night - staff was all very helpful, especially Nelson. Kind and willing to help out. I requested a couple things for the room and the service was quick and got what we needed right away.  The room is small but I …",
      "date": null,
      "userInfo": "4 reviews"
    },
    {
      "user": "Pallavee Panchal",
      "rating": "5/5",
      "text": "Had an amazing time at the Walker Tribeca. The location was incredible and in the heart of everything we wanted to do. The staff were responsive, kind and helpful. Our room had the most beautiful view of the entire downtown. We loved the …",
      "date": null,
      "userInfo": "6 reviews"
    },
    {
      "user": "Allison Williams",
      "rating": "2/5",
      "text": "This hotel needs a serious tune up- both in service as well as condition of the rooms.\nThere is no real lobby - the entrance leads to a restaurant check in and a …",
      "date": null,
      "userInfo": "12 reviews · 2 photos"
    },
    {
      "user": "Maxine F",
      "rating": "3/5",
      "text": "i was staying there for  1 night the reception are so helpful the room are nice small but modern design i like it. the bed is agains the wall no more space not really affordable for the kind of room and there wifi soooo bad i ddnt connect …",
      "date": null,
      "userInfo": "20 reviews · 16 photos"
    },
    {
      "user": "Cameron Vidrine",
      "rating": "4/5",
      "text": "I’m giving 4 stars because the room was so tiny it didn’t make me mad but rather laugh. Staff is great and there is an amazing speakeasy. Bed was comfortable. Be aware that my partner and I couldn’t both leisurely hang AT ALL in the room, …",
      "date": null,
      "userInfo": "Local Guide · 39 reviews"
    },
    {
      "user": "Cesar Ramos",
      "rating": "5/5",
      "text": "The hotel is between Soho and Tribeca, near the Canal subway station. Edwin and Nelson at the front desk are outstanding in being efficient, friendly, helpful, and polite; they speak English and Spanish. The rooms are according to the …",
      "date": null,
      "userInfo": "24 reviews · 3 photos"
    },
    {
      "user": "Colin van den Bosch",
      "rating": "5/5",
      "text": "Nice hotel in a great location - downtown Manhattan. They serve the best coffee in the coffee shop in the lobby. I recommend.",
      "date": null,
      "userInfo": "6 reviews"
    },
    {
      "user": "Kristýna Hojgrová",
      "rating": "5/5",
      "text": "It was perfect! Big thanks to Nelson from the hotel staff, he was really helpful.",
      "date": null,
      "userInfo": "5 reviews · 1 photo"
    },
    {
      "user": "Bridget Porich",
      "rating": "3/5",
      "text": "Smallest hotel room I’ve ever experienced. Surprise “facilities fee” gets charged without any warning - $35 per day. Wish we booked somewhere else for the price it ended up coming to. Don’t be fooled by the nice photos. It’s claustrophobic and better off looking elsewhere",
      "date": null,
      "userInfo": "25 reviews"
    },
    {
      "user": "Rola Al Sharif",
      "rating": "5/5",
      "text": "the room was tiny, had no coffee station! but the location and the service were amazing... check the bars at the hotel and they are awesome...",
      "date": null,
      "userInfo": "Local Guide · 52 reviews · 79 photos"
    },
    {
      "user": "Chimere Fullilove",
      "rating": "2/5",
      "text": "I Really don’t know where to start should I start off with the guest service from host who didn’t acknowledge us not even once then when ask a question about parking or anything else around there no answer but that’s not my concern my main …",
      "date": null,
      "userInfo": "3 reviews · 15 photos"
    },
    {
      "user": "Sophie Leamon",
      "rating": "1/5",
      "text": "the photos online are cute and charming, but the rooms themselves are comically small, claustrophobic, and poorly designed. especially for the price, i was surprised to see an entire shelf missing under the bed, veneer peeling, holes in the …",
      "date": null,
      "userInfo": "8 reviews · 6 photos"
    },
    {
      "user": "April W.",
      "rating": "5/5",
      "text": "This review is for Nelson, the nicest porter who helped me get my super heavy bags down a few stairs and into my uber. Uber driver didn’t lift a finger so Nelson helped me hoist the bags in the trunk. Very knightly and kind of him!",
      "date": null,
      "userInfo": "11 reviews"
    },
    {
      "user": "Shawn Rogers",
      "rating": "3/5",
      "text": "For half the price of a normal NYC room you get what you pay for, 1/3 of a room. I ended up in one of their smaller rooms basically a walk in closet, it didn’t even have a chair. The open space in the room was 5 x 5 foot, standing room …",
      "date": null,
      "userInfo": "4 reviews"
    },
    {
      "user": "Szandra Léner",
      "rating": "5/5",
      "text": "The hotel is at a good location, we could walk to almost everywhere, and the subway station is also very close.\nThe room is small, but very cozy, comfortable and clean. We had a room on the …",
      "date": null,
      "userInfo": "4 reviews · 1 photo"
    },
    {
      "user": "Ed Chubin",
      "rating": "4/5",
      "text": "Smallest room i ever had, but acceptable. I am under 5'6\" and was just able to fit for the bed which was very restful and comfortable. Great location between Chinatown and Little Italy. Room was clean, shower good. Raised toilet. I was not aware of add on daily charge around 35.",
      "date": null,
      "userInfo": "Local Guide · 702 reviews · 703 photos"
    },
    {
      "user": "moto yosh",
      "rating": "3/5",
      "text": "Room was absurdly small, must be hard for housekeeping. Front desk offered no help in getting a taxi, we had Three suitcases and a large artwork portfolio. We dragged them out to curb while I went two blocks to retrieve a taxi. Front desk …",
      "date": null,
      "userInfo": "2 reviews"
    },
    {
      "user": "Dolly Parks",
      "rating": "5/5",
      "text": "Was part of the Bernadette Thompson nail team for another Fashion show during Fashion week on September 7, 2024. The work area was small to do nails, but everyone was professional and was about getting the job done.",
      "date": null,
      "userInfo": "Local Guide · 196 reviews · 157 photos"
    },
    {
      "user": "Enno Krey",
      "rating": "4/5",
      "text": "Overall very comfortable hotel in a great location with some downsides. Few things to keep in mind before you book: …",
      "date": null,
      "userInfo": "9 reviews"
    },
    {
      "user": "Aileen Allan",
      "rating": "4/5",
      "text": "Great location & lovely hotel however, we found the corner room noisy. Baring in the mind it’s NYC, there is traffic (we get it) however there appears to be little sound proofing in the windows (compared to another hotel we stayed at in …",
      "date": null,
      "userInfo": "Local Guide · 53 reviews · 86 photos"
    },
    {
      "user": "Maya Moore",
      "rating": "5/5",
      "text": "The rooms are on the smaller side but I enjoy a queen size bed and still felt like I had room to walk back and forth to the restroom. The view and location is what I enjoyed most. Plenty of places to walk to for coffee and it’s so …",
      "date": null,
      "userInfo": "3 reviews"
    },
    {
      "user": "Dylan H",
      "rating": "5/5",
      "text": "This was a great stay. We walked in and wend down the stairs where I felt as if I was entering a speak-easy. It was not but the beautiful wood work in the ceiling was cool. …",
      "date": null,
      "userInfo": "Local Guide · 96 reviews · 12 photos"
    },
    {
      "user": "Emma Rivera",
      "rating": "5/5",
      "text": "Location:\nPerfect location for getting around the city. I spent a lot of time in Tribeca which ended up being my favorite part. The hotel is also on a low traffic street …",
      "date": null,
      "userInfo": "Local Guide · 49 reviews · 70 photos"
    },
    {
      "user": "Emily Counsellor (PamperingPanda)",
      "rating": "5/5",
      "text": "This place is always very clean with friendly staff! We arrived early and not only did the receptionist accommodate us on a really busy graduation weekend, they gave us a handicap accessible room without us asking because they noticed my …",
      "date": null,
      "userInfo": "Local Guide · 62 reviews · 22 photos"
    },
    {
      "user": "Daisy Chung",
      "rating": "5/5",
      "text": "The room was compact for a king but well designed - staying on my own for three nights I found it secure, comfortable and clean. I booked directly via the hotel website which offered breakfast and 2pm checkout as part of the room rate. The …",
      "date": null,
      "userInfo": "40 reviews · 9 photos"
    },
    {
      "user": "Rachel Lanskey",
      "rating": "4/5",
      "text": "The rooftop bar is great. Greg views. Heated alcoves.",
      "date": null,
      "userInfo": "Local Guide · 345 reviews · 19 photos"
    },
    {
      "user": "Meghan",
      "rating": "5/5",
      "text": "Awesome hotel! The AC was working perfectly, it was a really hot weekend. The room is small but perfectly set up. The lights are great and everything was clean. Staff was really helpful and nice. The lobby is shared with a really nice …",
      "date": null,
      "userInfo": "Local Guide · 130 reviews · 179 photos"
    },
    {
      "user": "Madison",
      "rating": "1/5",
      "text": "i stayed here last week and was incredibly taken aback by how rude the manager Mia was. she greeted me with the nastiest look when i walked in tuesday morning and asked what her problem was and she had the nastiest reply back of just “nothing” and kept walking with her nasty grin right to her office.",
      "date": null,
      "userInfo": "7 reviews"
    },
    {
      "user": "Nadine Wurster",
      "rating": "5/5",
      "text": "We stayed here for 4 nights during a short trip to NYC. Absolutely amazing staff, every single person we came across was so nice, couldn’t have felt more welcome, looked after and comfortable! …",
      "date": null,
      "userInfo": "Local Guide · 48 reviews · 16 photos"
    },
    {
      "user": "K Vice",
      "rating": "2/5",
      "text": "My recent stay with the Walker Hotel Tribeca was less than desirable. Although the staff did their best to accommodate, this was an uncomfortable experience that only allowed so much for rest. I first had to switch rooms due to features …",
      "date": null,
      "userInfo": "5 reviews"
    },
    {
      "user": "Hannah Fallais",
      "rating": "2/5",
      "text": "I would not book this hotel again. Rooms like shoeboxes, limited service. Location is okay but canal street is not the nicest area in my opinion.",
      "date": null,
      "userInfo": "Local Guide · 126 reviews · 12 photos"
    },
    {
      "user": "Dani Levin",
      "rating": "5/5",
      "text": "This place was very fun and great spot in New York! Great prices for New York for a clean and modern place. It’s pretty much a high end hostel (especially if you get the smallest room). The room is super small but has everything you need. …",
      "date": null,
      "userInfo": "Local Guide · 248 reviews · 187 photos"
    },
    {
      "user": "Jessica Laursoo",
      "rating": "5/5",
      "text": "I stayed here on a short trip I took in February and I could not recommend this place more. The staff was amazing and provided such great service. They were also all super friendly and willing to help. I also loved the convenience of being …",
      "date": null,
      "userInfo": "5 reviews"
    },
    {
      "user": "Janina McCormack",
      "rating": "5/5",
      "text": "I love visiting lower Manhattan and staying in TriBeCa. This small hotel was a great place to stay and enjoy a night in the heart of it all. Located on a quiet side street, I enjoyed the views of Broadway and Walker Street. The lobby and …",
      "date": null,
      "userInfo": "Local Guide · 9 reviews · 12 photos"
    },
    {
      "user": "Karin John",
      "rating": "2/5",
      "text": "The location of the hotel is perfect. Nearby are buses and metro. Many galleries. …",
      "date": null,
      "userInfo": "Local Guide · 25 reviews · 147 photos"
    },
    {
      "user": "Greg Jones",
      "rating": "2/5",
      "text": "The regular rooms are comically small.\nThe employees were great.\nThe wifi is useless. …",
      "date": null,
      "userInfo": "Local Guide · 57 reviews · 74 photos"
    },
    {
      "user": "Nicola Bailey- James",
      "rating": "5/5",
      "text": "We have stayed at hundred if not thousands of hotels all over the world and the staff at this one are THE best.  They are exceptionally helpful, warm, friendly and caring. …",
      "date": null,
      "userInfo": "13 reviews"
    },
    {
      "user": "Joel Alesch",
      "rating": "4/5",
      "text": "Sorry New York, we are from LA and we have a lot of space, your micro rooms where the beds literally touch 3 walls freaks me out. You almost bump your face on the back wall as you come in the door. I thought I stepped into another elevator. …",
      "date": null,
      "userInfo": "Local Guide · 470 reviews · 1,053 photos"
    },
    {
      "user": "Wentao Ma",
      "rating": "1/5",
      "text": "I prepaid my room but got double charged. It’s been a whole week still haven’t received any response.",
      "date": null,
      "userInfo": "3 reviews"
    },
    {
      "user": "Lin Lee",
      "rating": "4/5",
      "text": "So friendly, helpful, professional, warm staff. Very accommodating. Up to date room, sink in room, king bed, spacious modern shower/toilet. Cafe service, beautiful rooftop another club. All secure with W card needed to access areas. Felt …",
      "date": null,
      "userInfo": "Local Guide · 60 reviews · 37 photos"
    },
    {
      "user": "Adrienne Kim",
      "rating": "5/5",
      "text": "What a special place- I brought some of my grad students this morning for a coffee and the woman at the front desk made sure we were cared for with coffee and water even though the cafe wasn’t open when we arrived. Her true hospitality took …",
      "date": null,
      "userInfo": "10 reviews"
    },
    {
      "user": "Sarah Toews",
      "rating": "5/5",
      "text": "I stayed here just for one night, traveling for work. This is one of the cutest hotels I have ever stayed at! The rooms are small but I didn’t mind it since I was traveling alone. The view from my room was incredible. The coffee shop …",
      "date": null,
      "userInfo": "Local Guide · 37 reviews · 9 photos"
    },
    {
      "user": "Sean Snelders",
      "rating": "4/5",
      "text": "Nice hotel. Room was small but adequate. Hotel employees were very nice.",
      "date": null,
      "userInfo": "Local Guide · 87 reviews · 1 photo"
    },
    {
      "user": "Rozeenascurlytravels",
      "rating": "5/5",
      "text": "This hotel is a gem in Tribeca. We booked a large room but I believe the regular rooms are pretty NY standard (#iykyk). Staff were friendly and helpful. Room was clean and stylish. There’s a cafe, coffee shop, restaurant and speak easy all …",
      "date": null,
      "userInfo": "Local Guide · 147 reviews · 22 photos"
    },
    {
      "user": "Lyric Kaplan",
      "rating": "2/5",
      "text": "Room 705 has no blackout curtains. The light will wake you up when the sunrises. Forget trying to sleep in. Not happy.",
      "date": null,
      "userInfo": "109 reviews · 8 photos"
    },
    {
      "user": "Maggie Rich",
      "rating": "5/5",
      "text": "We booked a stay for a long holiday weekend on Manhattan and had a really great experience! The rooms are no smaller than we were expecting, and they were cozy and sleek. The bar was really really fun, and the coffee shop on site is …",
      "date": null,
      "userInfo": "3 reviews"
    },
    {
      "user": "Dan Holland",
      "rating": "5/5",
      "text": "Great hotel in the heart of Tribeca, easy walk to Soho etc. Fantastic staff, special shout out to Mercedes who was a ray of light after a tough journey, made our check-in process smooth and we felt instantly welcome. …",
      "date": null,
      "userInfo": "17 reviews · 2 photos"
    },
    {
      "user": "Claudia Higgins",
      "rating": "1/5",
      "text": "Avoid at all costs! Birthday ruined. Visited end of May - June.\n\nFirstly, the rooms are tiny even for New York. Its a struggle to fit two people …",
      "date": null,
      "userInfo": "6 reviews"
    },
    {
      "user": "Noah Dillon",
      "rating": "1/5",
      "text": "I was shocked that the rich like this kind of abuse and degradation. We came here as an after party for an art fair. I told the very nice front desk person that the closest I'd ever been to the hotel is to use the bathroom at Blue Bottle in …",
      "date": null,
      "userInfo": "Local Guide · 62 reviews · 15 photos"
    },
    {
      "user": "Ryan Franz",
      "rating": "3/5",
      "text": "Location was great. Rooms are extremely small. You get a bed, a closet, a sink, and a bathroom. For those of you traveling with a companion, the bathroom door loosely slides closed and doesn’t latch. There is no fan. You can hear EVERYTHING …",
      "date": null,
      "userInfo": "2 reviews"
    },
    {
      "user": "Kelsey Harker",
      "rating": "5/5",
      "text": "Every aspect of our stay at this hotel was amazing. The staff was above and beyond accommodating. From making sure we had a room with a view, to great recommendations from the bellman, to the kindness of the housekeeping staff - it was all …",
      "date": null,
      "userInfo": "8 reviews · 1 photo"
    },
    {
      "user": "gregory mark",
      "rating": "4/5",
      "text": "I stayed here for a week and it was a great place for a business trip to NYC. Wi-Fi is strong, there’s a Blue Bottle coffee in the same building (with lots of couches for doing work on), a nice bar at the connected restaurant, and the …",
      "date": null,
      "userInfo": "6 reviews · 38 photos"
    },
    {
      "user": "Shilpi Sanchetee",
      "rating": "5/5",
      "text": "Walker Hotel Tribeca was the perfect home for my 5 day trip to NYC. The room is very chic, and super clean with all amenities & more. The staff is super friendly and always available to help. They have a coffee shop & lunch/dinner spot in …",
      "date": null,
      "userInfo": "5 reviews"
    },
    {
      "user": "Melody Ha",
      "rating": "5/5",
      "text": "The Walker Hotel is beautifully designed and furnished, affordble, and every single staff member I met were super friendly and helpful. I stayed for work - there's a great space to work and hang out in the lobby. The Blue Bottle cafe was a …",
      "date": null,
      "userInfo": "1 review"
    },
    {
      "user": "Robert Wood",
      "rating": "5/5",
      "text": "I loved the location amenities the room was small but large bed and big tv. They have a nice coffee shop on the first floor so that was convenient.  The shower spout was in the ceiling. Plenty of hot water. Best shower ever. Very clean. …",
      "date": null,
      "userInfo": "2 reviews"
    },
    {
      "user": "Lillylee Lee",
      "rating": "5/5",
      "text": "If you want somewhere to just relax kick up it's cool",
      "date": null,
      "userInfo": "Local Guide · 142 reviews · 20 photos"
    },
    {
      "user": "Donald",
      "rating": "10/10",
      "text": "Located near SoHo, Chinatown, and Little Italy. Also a short walk (less than 5 min) to Canal St. Subway Station!\r\nComfortable bed, luxurious bath products, and even a rainfall shower head! Room …",
      "date": null,
      "userInfo": null
    },
    {
      "user": "Brianna Payne",
      "rating": "1/5",
      "text": "Some of their staff - Alicia/Alyssa and Met - are not great quality. The rest have been great, but I won’t be visiting again after dealing with those two. I was a fan and gave this place five stars after my first stay, not this time. This …",
      "date": null,
      "userInfo": "118 reviews · 10 photos"
    },
    {
      "user": "Ginny Kafka",
      "rating": "5/5",
      "text": "I had an opportunity to have an evening to myself, away from my husband and daughter, to recharge.  I picked this hotel to get away and it was perfect for the moment.  Visitors should be warned that the rooms are very small with showers …",
      "date": null,
      "userInfo": "1 review"
    },
    {
      "user": "Anonymous A",
      "rating": "3/5",
      "text": "Front desk any time I stay or call seems overwhelmed. They get flustered when balancing both calls and check in. Johnathen couldn’t get my email correct after 3 attempts, then asking me to take down their email instead, basically passing me …",
      "date": null,
      "userInfo": "10 reviews"
    },
    {
      "user": "Valence Tan",
      "rating": "2/5",
      "text": "The room is clean, comfortable and gorgeous. However, the back office and customer service was rude and horrible. Called to ask why was the room half made or unmade ok different days and half drank water bottles (not ours) was left in our …",
      "date": null,
      "userInfo": "2 reviews · 3 photos"
    },
    {
      "user": "nathalie keym",
      "rating": "5/5",
      "text": "I’m currently staying in Walker Hotel Tribeca, the hotel has such a cool vibe and great atmosphere in the cafe downstairs!! But I came in here just to say how wonderful and helpful the staff is! JOSEF the manager has been super helpful and …",
      "date": null,
      "userInfo": "6 reviews"
    },
    {
      "user": "Daniel Roca",
      "rating": "3/5",
      "text": "Decent, clean comfy bed, small rooms.\nStaff ranges from ok to clueless. One staff woman at the checkout kept calling me “sweetie”… a little too familiar. Another had no idea who was in charge of …",
      "date": null,
      "userInfo": "Local Guide · 41 reviews · 22 photos"
    },
    {
      "user": "Javier Camorlinga",
      "rating": "5/5",
      "text": "It was my first time visiting New York and I stumbled upon this beautiful boutique hotel online. I stayed here for 4 nights and it was the best decision I made. Disregard the comments about the size of the room. The room is a cozy size, …",
      "date": null,
      "userInfo": "4 reviews · 6 photos"
    },
    {
      "user": "Betty Huang",
      "rating": "4/5",
      "text": "We stayed there for two days of New York City weekend fun. We booked trips to jazz clubs/restaurants/plays. It was a great location.\nWe got a standard room which was very small but normal for New York City. …",
      "date": null,
      "userInfo": "Local Guide · 71 reviews · 1 photo"
    },
    {
      "user": "Anna Whiteman",
      "rating": "5/5",
      "text": "First time staying and was very impressed. Staff was extremely friendly! I booked with Bell a few hours before arriving and she was absolutely lovely. The space is very well decorated and awesome vibes. Very clean facility rooms are smaller but what more do you need! You won’t spend much time in the room anyways!",
      "date": null,
      "userInfo": "7 reviews · 1 photo"
    },
    {
      "user": "Maddy Slatt",
      "rating": "2/5",
      "text": "We arrived at the Walker Hotel for the weekend and the check-in was extremely uncomfortable. Once given the key to our room, we opened the door to find an unclean room with towels stacked on the bathroom floor, a dirty shower, no soap, a …",
      "date": null,
      "userInfo": "14 reviews · 14 photos"
    },
    {
      "user": "Grant Kendzior",
      "rating": "5/5",
      "text": "This hotel blew me away! I travel constantly for work and am usually Marriott loyal but this experience made me rethink that. This hotel is perfectly thoughtful to the modern traveler.  It open community area is the ideal environment for …",
      "date": null,
      "userInfo": "5 reviews · 1 photo"
    },
    {
      "user": "Mi Shum",
      "rating": "5/5",
      "text": "Great customer service and really friendly staff. Room is compact but clean and bathroom is neat and nice. Bed is comfortable. …",
      "date": null,
      "userInfo": "Local Guide · 17 reviews · 18 photos"
    },
    {
      "user": "Jen Smith",
      "rating": "5/5",
      "text": "This has become my go to NYC hotel. I absolutely love it. The rooms are sleek, modern, and NY cozy. The staff is incredible. Every time I stay, they are so welcoming, friendly, and helpful with anything! The lobby and other public spaces …",
      "date": null,
      "userInfo": "Local Guide · 65 reviews · 197 photos"
    },
    {
      "user": "Alanna Foley",
      "rating": "5/5",
      "text": "I have stayed at this hotel once before and it was a very pleasant experience. Today I wanted to give a special shout out to Edgar, who was fantastically helpful the other day as I was planning my next stay at the property. He answered the …",
      "date": null,
      "userInfo": "5 reviews"
    },
    {
      "user": "Danielle Murray",
      "rating": "5/5",
      "text": "I booked this trip for work due to proximity, and I loved it. I looked at a lot of reviews and honestly, was not super sure due to various good and below average reviews, but I only had the best experience with the staff, room, cleanliness, …",
      "date": null,
      "userInfo": "Local Guide · 23 reviews · 38 photos"
    },
    {
      "user": "J G",
      "rating": "5/5",
      "text": "The lowest-priced rooms are tiny but well-appointed. The staff is awesome. There is a dude at the front named Jay that helped me out a bunch while I was there this week with directions, getting a table to work at, finding my bags, …",
      "date": null,
      "userInfo": "16 reviews · 1 photo"
    },
    {
      "user": "Andy Malone",
      "rating": "5/5",
      "text": "Amazing hotel - friendly and professional staff; clean and modern rooms; great vibe throughout the facility. A tremendous value for NYC, and the location can't be beat. Just awesome!",
      "date": null,
      "userInfo": "9 reviews"
    },
    {
      "user": "Brandon Barlow",
      "rating": "5/5",
      "text": "Nice little boutique hotel. The rooms are a little small but nicely updated and clean. The coffee shop on the main floor is clutch for early mornings. They also have a rooftop bar which has an incredible view that I cannot recommend enough. Nice location centrally located. I stay here every time I'm in New York",
      "date": null,
      "userInfo": "Local Guide · 112 reviews · 19 photos"
    },
    {
      "user": "Nina Benavides",
      "rating": "5/5",
      "text": "Absolutely loved this hotel! Great location, conveniently located around train stations. Hotel staff was great, Eric was great and very accommodating. Hotel and rooms overall are pretty clean and beds are comfortable, the rooms are small …",
      "date": null,
      "userInfo": "9 reviews · 10 photos"
    },
    {
      "user": "Spencer Reynolds",
      "rating": "5/5",
      "text": "Walker hotel is a millennial's dream spot in NYC. The location is great, the hotel is cute and modern and just sexy enough. Staff is accommodating and polite. …",
      "date": null,
      "userInfo": "Local Guide · 31 reviews"
    },
    {
      "user": "Carl J",
      "rating": "3/5",
      "text": "Well decorated and ideally located to explore NYC. But for the rest not a good experience. We knew the room was small but not that small. You can't even go around the bed. But the worst part was the noise, we could hear everything going on …",
      "date": null,
      "userInfo": "Local Guide · 118 reviews"
    },
    {
      "user": "Alexandra Reyes",
      "rating": "5/5",
      "text": "Room is small, but we were out all day and only used it to sleep so it was perfect and everything we needed. The room is nice and fancy. My dog loved the king bed. The staff was not a bother and very accommodating. The hotel is very clean …",
      "date": null,
      "userInfo": "4 reviews · 2 photos"
    },
    {
      "user": "ALINA GRIGORIAK",
      "rating": "5/5",
      "text": "Me and my boyfriend stayed there during Christmas holidays. You can see warm\nsunset on the whole New York from the window! The hotel is really clean and smells good. Really photogenic too so I took some pics for my insta. The location is really nice. We were just walking to some places from the hotel. Recommend it to stay in New York!",
      "date": null,
      "userInfo": "Local Guide · 120 reviews · 306 photos"
    },
    {
      "user": "Meghan Dorn",
      "rating": "4/5",
      "text": "Rooms are on the smaller side but service is always friendly and is very convenient to get around nyc from here",
      "date": null,
      "userInfo": "Local Guide · 67 reviews · 136 photos"
    },
    {
      "user": "Andrew Dodson",
      "rating": "4/5",
      "text": "Nice, hip place! Clean with a very interesting gym. I've never used a fast manual treadmill before so it was nice that I was given the chance to try something new.",
      "date": null,
      "userInfo": "Local Guide · 24 reviews · 3 photos"
    },
    {
      "user": "Sofía Moñino",
      "rating": "2/5",
      "text": "No good experience. Many broken things at room: safe, store behind the bed, light key…. …",
      "date": null,
      "userInfo": "Local Guide · 61 reviews · 106 photos"
    },
    {
      "user": "frederic charnoz",
      "rating": "5/5",
      "text": "I'd love the location, not a busy street but still very convenient as close to Soho, chinatown, metro station\nDoesn't offer breakfast all the time but the lobby is comfy plus a nice underground jazz bar  and a very nice rooftop !enjoy !",
      "date": null,
      "userInfo": "Local Guide · 68 reviews · 146 photos"
    },
    {
      "user": "Jordan",
      "rating": "2/5",
      "text": "Pretty subpar experience at this hotel - seemed to be not well kept and lacked basic essentials (i.e robes). Further the heat was not working, and wasn't fixed for the duration of our stay despite asking. A baseboard heater was sent but would have preferred the AC system to actually work - the technician didn't even try.",
      "date": null,
      "userInfo": "14 reviews"
    },
    {
      "user": "Kayla Huffman",
      "rating": "5/5",
      "text": "Met all my expectations. As a solo traveller the King room was more than enough space. Super comfortable bed, great shower, and nice central location. Would definitely stay again and recommend to friends.",
      "date": null,
      "userInfo": "5 reviews"
    },
    {
      "user": "Ken Egozi",
      "rating": "5/5",
      "text": "Room is tiny but the bed was super comfortable with a really high quality mattress. The reason for 4 starts is that the window is hardly doing anything in the way of noise filtering making the night very noisy. Every street conversation and …",
      "date": null,
      "userInfo": "Local Guide · 36 reviews · 54 photos"
    },
    {
      "user": "Katya Braxton",
      "rating": "5/5",
      "text": "Amazing customer service - from the moment of a friendly staff opening the door for you, to the most graceful, elegant and welcoming front desk manager Edgar (who deserves a separate 5 start review!!) to the cleaning team and the most …",
      "date": null,
      "userInfo": "14 reviews · 3 photos"
    },
    {
      "user": "The Rebel Camp",
      "rating": "5/5",
      "text": "This was such an amazing stay and highly recommended! We will be back for sure",
      "date": null,
      "userInfo": "3 reviews"
    },
    {
      "user": "Ashley Wilson",
      "rating": "3/5",
      "text": "The hotel was amazing! The room was super cute, pod style. Lobby, restaurant and cafe were awesome. The staff could’ve been nicer though… I was there for an engagement and they didn’t seem to care or was welcoming. The Bartender was super super nice tho! Overall, great place, I will recommend!",
      "date": null,
      "userInfo": "Local Guide · 13 reviews"
    },
    {
      "user": "Briana",
      "rating": "5/5",
      "text": "Seamless check in and out. Service was outstanding from beginning to end. Loved the industrial/art deco design. Room finishings were of high quality. Lobby/ coffee lounge area was so peaceful to hang about. Definitely will stay again!",
      "date": null,
      "userInfo": "7 reviews · 18 photos"
    },
    {
      "user": "Zoe C",
      "rating": "3/5",
      "text": "Nice decor in rooms. Perfect for 1/2 night stay but limited storage/wardrobe space for longer& could be slightly cleaner. No restaurant /bar facilities in the evening but presumably covid 19 is mostly to blame. Presumably the atmosphere in the hotel would otherwise be more vibrant.",
      "date": null,
      "userInfo": "Local Guide · 24 reviews · 4 photos"
    },
    {
      "user": "Rens Pieters",
      "rating": "2/5",
      "text": "Just overall weird vibes for the amount of money you pay. People walking in and out all the time with no security. Lobby is located downstairs. Was trying to work in the lobby (which was very dirty) and they tried to send me to my room. Rooms are very cramped for the high price point.",
      "date": null,
      "userInfo": "Local Guide · 27 reviews · 20 photos"
    },
    {
      "user": "Team Ponce",
      "rating": "3/5",
      "text": "It was an okay experience. The receptionist who greeted and assisted us during the stay was so friendly.\nIt's my first time booking a hotel during the pandemic so maybe I'm just not …",
      "date": null,
      "userInfo": "7 reviews · 1 photo"
    },
    {
      "user": "Sean Symes",
      "rating": "3/5",
      "text": "So be careful when booking, we ended up booking at the wrong Walker hotel. This spot was not terrible as an overall experience but the room was really small. Our room had a queen bed facing a single large window and next to it was 3 feet to …",
      "date": null,
      "userInfo": "Local Guide · 55 reviews · 4 photos"
    },
    {
      "user": "Emely Taveras",
      "rating": "5/5",
      "text": "This hotel is fantastic. The design is thoughtful and very nice. The rooms are small. You can even see a floorplan of the rooms on the website. This didn't bother me at all but I want to mention it because it's part of the charm. The rooms …",
      "date": null,
      "userInfo": "13 reviews"
    },
    {
      "user": "S J",
      "rating": "4/5",
      "text": "Cute little place in a great location!\nRoom was very small even for one person.\nNo coffee in room but you can buy one at the cafe located on site. …",
      "date": null,
      "userInfo": "59 reviews · 3 photos"
    },
    {
      "user": "Christina Villarreal",
      "rating": "5/5",
      "text": "In the middle of lower Manhattan close to everything 12-15 minutes! Close to Chinatown and little Italy...many restaurants to enjoy! In the morning lovely coffee shop and pastries to enjoy and in the evening a beautiful roof top bar to relax and enjoy too!",
      "date": null,
      "userInfo": "Local Guide · 57 reviews · 73 photos"
    },
    {
      "user": "Julie H",
      "rating": "5/5",
      "text": "Super pleased with my stay. I was here for 3 nights in May 2022. The room was immaculate and the bed super comfy. Huge windows with tons of light. Marble bath with rainhead shower. Lavender peppermint bath goodies. Great coffee shop in …",
      "date": null,
      "userInfo": "Local Guide · 34 reviews · 51 photos"
    },
    {
      "user": "Christopher Simard",
      "rating": "1/5",
      "text": "Don’s usually post reviews, but feel compelled in this situation. Short trip to NY to visit family @Little Italy. Read review and ratings and chose the Walker. Clean place, but significant issues leading to a very poor experience. Room was …",
      "date": null,
      "userInfo": "2 reviews"
    },
    {
      "user": "Mara G",
      "rating": "5/5",
      "text": "Rooms were great. All of the guys were super tentative! It has a great location, with two coffee shops in the first floor.",
      "date": null,
      "userInfo": "10 reviews"
    },
    {
      "user": "Brian Tran",
      "rating": "5/5",
      "text": "The decor, details, the staff and the vibe everything about this hotel lobby and café. It's  the subtle elegance that keeps me coming back and just lounge with a drink and smile. The staff is always welcoming and friendly, no matter who you are. It´s clean and just feels right.",
      "date": null,
      "userInfo": "Local Guide · 643 reviews · 5,599 photos"
    },
    {
      "user": "Chris Trechter",
      "rating": "4/5",
      "text": "Very comfortable bed and I couldn't hear any of my neighbors. These are really the two most important parts of any hotel. Definitely wish there was less hair all over the bed when we checked in but overall we had a good experience.",
      "date": null,
      "userInfo": "Local Guide · 361 reviews · 19 photos"
    },
    {
      "user": "405 Broadway Penthouse Facts",
      "rating": "5/5",
      "text": "If you end up being locked out of 405 broadway overnight or not electricity or hot water. This hotel is the best. Cheap and cool place to chill. While you wait to figure out what to do with your life. Also a great meeting spot!",
      "date": null,
      "userInfo": "5 reviews · 1 photo"
    },
    {
      "user": "Megan Casian",
      "rating": "4/5",
      "text": "Overall had a great stay! Location was perfect with great access to the subway and ease to get around SoHo, Chinatown and lower Manhattan + Brooklyn. The hotel itself was very nice & trendy as were the rooms. …",
      "date": null,
      "userInfo": "2 reviews"
    },
    {
      "user": "Cesar Caicedo",
      "rating": "5/5",
      "text": "Flower shop roof top bar is amazing",
      "date": null,
      "userInfo": "17 reviews · 2 photos"
    },
    {
      "user": "Tammy Vinson",
      "rating": "5/5",
      "text": "My go-to hotel in NYC. Super nice staff. Comfy bed. Well-designed and aesthetically pleasing. Good water pressure and toiletries. Lobby coffee, nice chairs, and occasional music are nice touches as well!",
      "date": null,
      "userInfo": "Local Guide · 173 reviews · 17 photos"
    },
    {
      "user": "O H",
      "rating": "4/5",
      "text": "Love hate relationship. Loved how the room was so up to date. Hated how tiny the room was - but for one day only it was good. The pillows weren’t great. The bed was good. I paid a high price for a tiny room, but hope to try a larger room at a more reasonable price. Pillows need an upgrade though.",
      "date": null,
      "userInfo": "Local Guide · 140 reviews · 255 photos"
    },
    {
      "user": "Kristen Phillips",
      "rating": "3/5",
      "text": "I stayed at the Walker Tribeca late last year. I liked the hotel lobby and coffee shop. It was nicely decorated with plants. The staff were friendly and helpful. The room was small, but that isn't uncommon in NY. The room was clean and the …",
      "date": null,
      "userInfo": "6 reviews · 1 photo"
    },
    {
      "user": "Christie Schultz",
      "rating": "5/5",
      "text": "Walker Hotel Tribecca is beautifully designed (as an Interior Designer myself) and I really appreciate those details. …",
      "date": null,
      "userInfo": "41 reviews · 57 photos"
    },
    {
      "user": "Alba Aponte Muñoz",
      "rating": "5/5",
      "text": "Great coffee shop in the lobby.\nThe pistachio croissant is really world class.\nThey put a lot of effort into making every food they serve the most excellent in a very casual environment but still elegant and cool",
      "date": null,
      "userInfo": "Local Guide · 163 reviews · 411 photos"
    },
    {
      "user": "Caroline Jan",
      "rating": "5/5",
      "text": "EXCELLENT SERVICE\nMy boyfriend and I stayed there for 17 days!! We had a very easy, welcoming and fast Check-In, done by Zach. The hotel is well located, its so close to Canal …",
      "date": null,
      "userInfo": "Local Guide · 60 reviews · 18 photos"
    },
    {
      "user": "Abby Bass",
      "rating": "5/5",
      "text": "Had a great stay here! Rooms are small but cool vibe and cozy. The rooftop, speakeasy and coffee shop are a great addition. Thank you to the team for helping with my accommodations and Nelson was super helpful!",
      "date": null,
      "userInfo": "2 reviews"
    },
    {
      "user": "Mitchel Turner",
      "rating": "3/5",
      "text": "Weird location, felt closer to Chinatown then Tribeca. Rooms were extremely small. Online pictures made them look bigger, got the King Comfort room and thought that would be much larger than a 150sqft room",
      "date": null,
      "userInfo": "Local Guide · 101 reviews · 72 photos"
    },
    {
      "user": "Jason Caponi",
      "rating": "5/5",
      "text": "Very nice but very tiny room; I am not sure if all of the rooms are this small so beware before brining kids.  This would be great for a couples getaway; very intimate and inviting hotel.",
      "date": null,
      "userInfo": "Local Guide · 73 reviews · 124 photos"
    },
    {
      "user": "Joanna Sable",
      "rating": "5/5",
      "text": "This hotel has one fabulous location. It is brand new and quite terrific. I love the lobby with its super cool vibe. The rooms as everyone has said are super small but hey it is NYC after all. I found mine really clean and love being on the …",
      "date": null,
      "userInfo": "Local Guide · 312 reviews · 2,634 photos"
    },
    {
      "user": "Jacqueline Stephan",
      "rating": "1/5",
      "text": "Worse experience ever.  I am a New Yorker and have to say my stay here was awful. A fight broke out on the corner of the Walker Hotel amongst a crowd of 30 to 40 people around 3 am. My husband and I asked the concierge to contact the Police …",
      "date": null,
      "userInfo": "5 reviews · 4 photos"
    },
    {
      "user": "Austin Viny",
      "rating": "5/5",
      "text": "I've never stayed at the Walker but have gotten drinks here and frequently do work on my computer in their lobby on the weekends.  I love this place.  The docor is extremely pretty and the couches / lounge area is very comfotable.  The best …",
      "date": null,
      "userInfo": "5 reviews"
    },
    {
      "user": "Felipe Rodrigues",
      "rating": "3/5",
      "text": "It’s fine. It’s more in Chinatown than in Tribeca itself. The intersection on the way from SoHo/Midtown can be a little creepy. Rooms are very tiny, so I do not recommend this place if you’re staying for more than 3 nights. …",
      "date": null,
      "userInfo": "Local Guide · 113 reviews · 31 photos"
    },
    {
      "user": "Shaul Sharabani",
      "rating": "5/5",
      "text": "I had an amazing stay in this hotel. From the check-in to check-out and during my stay the service was tremendous. The hotel is just opened, so there are a few renovations going on but that didn't effect the pleasure I had, since staff did …",
      "date": null,
      "userInfo": "7 reviews · 13 photos"
    },
    {
      "user": "Christos Manolis",
      "rating": "2/5",
      "text": "Location is great. So is ambiance.\nService is poor, bordering on arrogant.\nReplenishments (water bottles, towels, toiletries) are stingy. …",
      "date": null,
      "userInfo": "Local Guide · 27 reviews"
    },
    {
      "user": "Simon Dent",
      "rating": "5/5",
      "text": "Check in was quick - staff attentive and friendly.  Room was compact but clean and well laid out.  Much better than my other experiences with Manhattan hotels",
      "date": null,
      "userInfo": "Local Guide · 71 reviews · 64 photos"
    },
    {
      "user": "K Kiecker",
      "rating": "5/5",
      "text": "I arrived late in the evening on a Monday night.  The lobby was quiet, except for two gentlemen doing some light painting as they're still touching the place up after opening not too long ago.  Check-in is on the very bottom floor.  This …",
      "date": null,
      "userInfo": "4 reviews"
    },
    {
      "user": "Kathrin",
      "rating": "5/5",
      "text": "This place is sensational! We stayed in a beautiful room on the 9th floor waking up to a splendid and slightly different view each morning. The shower was absolutely magical (we spent quite some time analysing why; we agreed it was a …",
      "date": null,
      "userInfo": "Local Guide · 134 reviews · 144 photos"
    },
    {
      "user": "Sarah",
      "rating": "5/5",
      "text": "Our stay was incredible! So clean, beautiful, and kind staff.  The view is incredible and amenities are top notch.  The bed is the comfiest I’ve had from a hotel. Wouldn’t change a thing!  If you’re considering it, stay here! You won’t regret it. This is the only place I’ll be staying from now on!",
      "date": null,
      "userInfo": "Local Guide · 31 reviews · 11 photos"
    },
    {
      "user": "Júlia",
      "rating": "1/5",
      "text": "The hotel lobby is beautiful but there were a few problems in our stay. First of all, the hotel front desk is located in the -1 floor which means Guests are not able to see the the staff when arriving at the hotel, so do not expect any …",
      "date": null,
      "userInfo": "1 review"
    },
    {
      "user": "Gaby",
      "rating": "5/5",
      "text": "Very pretty rooftop at this moment, with all the flowers! It gives a good view of the skyline, and it has rather fairly priced glasses of wine / beer to refresh!",
      "date": null,
      "userInfo": "Local Guide · 106 reviews · 14 photos"
    },
    {
      "user": "Phineas The Frenchie",
      "rating": "1/5",
      "text": "The lobby security person is very inappropriate. While leaving one of the restrooms and heading up stairs I heard them say “He must of blown that up” referring to the amount of time I spent in the restroom. What a disgusting and …",
      "date": null,
      "userInfo": "Local Guide · 64 reviews · 14 photos"
    },
    {
      "user": "Ally Lin",
      "rating": "5/5",
      "text": "Perfect experience staying in New York! Will definitely come back again! Gym is most of the time empty although it's slightly tiny. The lobby is beautiful!",
      "date": null,
      "userInfo": "Local Guide · 36 reviews · 42 photos"
    },
    {
      "user": "W G",
      "rating": "5/5",
      "text": "Staff was excellent! Rooms clean, small but served the purpose. Enjoyed the modern technology like lights/shade controls and casting home service on TV. Great water pressure in shower and plenty of hot water. Bed very comfortable and …",
      "date": null,
      "userInfo": "9 reviews · 8 photos"
    },
    {
      "user": "Peter Gaston",
      "rating": "4/5",
      "text": "Really friendly service and a chic property. We liked our room, and were barely in the room at all, but be aware that some of the rooms are very small. They make amazing use of the space, but it's tight!",
      "date": null,
      "userInfo": "Local Guide · 50 reviews · 3 photos"
    },
    {
      "user": "Brian McCormick",
      "rating": "5/5",
      "text": "5 stars- I highly recommend the Walker Hotel in Tribeca. This is a beautiful hotel and the rooms are really nice as well as comfortable. It's a very high-end boutique hotel which feels like a home away from home. Awesome location right on …",
      "date": null,
      "userInfo": "2 reviews"
    },
    {
      "user": "Forrest Jones",
      "rating": "1/5",
      "text": "Moved rooms twice with no A/C in either. Checked in here with high hopes but didn’t stay longer than about 3 hours. The A/C in the first room wasn’t working when I checked in - no big deal I just called down to ask for someone to take a …",
      "date": null,
      "userInfo": "10 reviews · 1 photo"
    },
    {
      "user": "Lucy Xu",
      "rating": "5/5",
      "text": "Superb service, especially from the two doormen/bell boys. Room was small but space was clean and incredibly efficiently used - there was space to store everything out of the way for two. Bathroom was very comfortable. What more can you ask for?",
      "date": null,
      "userInfo": "3 reviews"
    },
    {
      "user": "Jenny Gibbs",
      "rating": "1/5",
      "text": "Its Christmas Eve. All flights were cancelled about an hour ago. Now not only am I not able to be with my mom, I am out $400. The Walker pocketed the whole fee and refuses to rebook. …",
      "date": null,
      "userInfo": "Local Guide · 41 reviews · 6 photos"
    },
    {
      "user": "Alex Dickman",
      "rating": "4/5",
      "text": "Good:\n\nThe hotel was brand new (opened Sep 2019) - electronic curtains, USB by the bed. …",
      "date": null,
      "userInfo": "Local Guide · 104 reviews · 206 photos"
    },
    {
      "user": "R Xu",
      "rating": "4/5",
      "text": "Rooms are basically coffins but quiet so if u want to just sleep in a coffin to have a great night's sleep, it's awesome",
      "date": null,
      "userInfo": "11 reviews · 2 photos"
    },
    {
      "user": "Charles Kerr",
      "rating": "5/5",
      "text": "The King room is super comfortable and well designed. This is the PERFECT hotel if you are looking to AVOID CATCHING COVID. The rooms have HUGE windows that open and it is NOT CENTRAL AIR. Each room's heat/AC is on a closed circuit meaning …",
      "date": null,
      "userInfo": "14 reviews"
    },
    {
      "user": "Dede T",
      "rating": "5/5",
      "text": "I had the most amazing stay here during COVID. I was in town for work for just one night. Francis at the front desk couldn't have been any nicer or helpful when I asked him for food delivery options. The lobby is beautiful, and my room was amazing too. I hope I'll have to go back again soon :)",
      "date": null,
      "userInfo": "Local Guide · 142 reviews · 389 photos"
    },
    {
      "user": "Becky Yee",
      "rating": "5/5",
      "text": "Great convenient location near all transportation. has a lovely lobby where you can work and also a great rooftop bar as well as a speakeasy in the side street in Courtland Alley. highly recommend",
      "date": null,
      "userInfo": "Local Guide · 11 reviews · 6 photos"
    },
    {
      "user": "Célia",
      "rating": "5/5",
      "text": "As a huge fan of boutique hotels I approve this one. Very charming, attention to detail, comfortable with an ideal location in between Tribeca and Chinatown. We had a lovely stay and we will be back for sure!",
      "date": null,
      "userInfo": "Local Guide · 290 reviews · 2,124 photos"
    },
    {
      "user": "M T",
      "rating": "5/5",
      "text": "Joshua Bellmen went above and beyond to assist today. Greatly appreciate his professionalism and help.",
      "date": null,
      "userInfo": "12 reviews · 2 photos"
    },
    {
      "user": "Katja Smith",
      "rating": "3/5",
      "text": "Hotel was fine with a nice coffee shop downstairs. However reception and back office staff are rude and incapable. They completely messed up the charges of our group, overcharged my card (by about 5k!) and caused me hours of work to sort this out. Won't chose them again.",
      "date": null,
      "userInfo": "5 reviews"
    },
    {
      "user": "Vern Kreuter",
      "rating": "5/5",
      "text": "Quaint hotel in the heart of tribeca. Rooms are  small, but functional and cozy. The bar and coffee shop downstairs are very convenient for late nights or early mornings. Location is excellent, close proximity to China town, little italy, …",
      "date": null,
      "userInfo": "Local Guide · 181 reviews · 491 photos"
    },
    {
      "user": "Jalesh Melwani",
      "rating": "2/5",
      "text": "Concierge would not accept my Mastercard credit card from Canada which requires tap/insert, however they also refused to key-in my credit card number, making it extremely difficult to pay for my hotel room. At this point, I was treated like …",
      "date": null,
      "userInfo": "1 review"
    },
    {
      "user": "Andrej Rusakov",
      "rating": "1/5",
      "text": "The room is basically the bed. Wall-to-wall-to-window the bed is directly attached on three sides to the three walls of the room.  The bed takes up 95% of the room.  You walk into the bed - it is one step from the door.  You living space is …",
      "date": null,
      "userInfo": "2 reviews · 2 photos"
    },
    {
      "user": "Frank Matheis",
      "rating": "2/5",
      "text": "The room was barely big enough for two people to stand up. Small even by new York standards. No AC all night long, so it was sweltering and sticky. The staff was friendly the bed sheets clean, and we had hot water. The pillow was thin and lumpy. We will never go back.",
      "date": null,
      "userInfo": "Local Guide · 106 reviews · 6 photos"
    },
    {
      "user": "Michael Lis",
      "rating": "5/5",
      "text": "Walker Hotel Tribeca is an excellent hotel with amazing service. Steven at the reception desk was kind enough to print package label and help me navigate my stay. I even extend my stay an extra night. Beautiful kind room with sleek and …",
      "date": null,
      "userInfo": "15 reviews · 14 photos"
    },
    {
      "user": "Silvia Wu",
      "rating": "2/5",
      "text": "We arrived at midnight and receptionist gave us the smallest room, which is clearly on the map on the door. Also I am pretty sure this room is for one person since the bed is in full size and only one robe in the closet, which makes me …",
      "date": null,
      "userInfo": "5 reviews · 1 photo"
    },
    {
      "user": "jay corriveau",
      "rating": "3/5",
      "text": "We upgraded our room and the bed still touched three of the four walls. Incredibly tiny NY rooms. I question if this is in Tribeca, as it is in the heart of Chinatown. …",
      "date": null,
      "userInfo": "Local Guide · 165 reviews · 34 photos"
    },
    {
      "user": "Nadine",
      "rating": "2/5",
      "text": "The hotel and the location are fine! Nothing amazing but for the price is perfect. The real reason this experience was bad is because of the service. It is terrible. Very disappointed with the front desk and in general just everyone seemed …",
      "date": null,
      "userInfo": "Local Guide · 13 reviews · 9 photos"
    },
    {
      "user": "Andrew Hua",
      "rating": "3/5",
      "text": "It was cozy and cute stay. The wifi and technology was a hit and a miss in the room. The staff were kind. There was room damage as well. It didn't significantly hinder the trip but I would sink in to the hole in the ground every so often when I went to the restroom.",
      "date": null,
      "userInfo": "2 reviews"
    },
    {
      "user": "Gabriela Bortz",
      "rating": "5/5",
      "text": "Very good hotel, well located between Tribeca and the Soho. Rooms are small, but is something recurrent in Manhattan. We managed to walk almost all our way into NYC. The treatment by the staff is great, kind and helpful. Special mention to Jay at the door, it was great to meet him!!",
      "date": null,
      "userInfo": "Local Guide · 58 reviews · 65 photos"
    },
    {
      "user": "Gee Hue",
      "rating": "5/5",
      "text": "Fantastic place with completely excellent service. the young lady at the front desk/counter was amazing, she was highly delightful to converse with especially attractive to look at and very insiteful to question about availability of rooms. …",
      "date": null,
      "userInfo": "350 reviews"
    },
    {
      "user": "connorado9",
      "rating": "5/5",
      "text": "The Walker Hotel Tribeca was lovely. The mid century modern vibe is exactly as advertised, and the lobby is impeccable. The cafe and lobby bar are so convenient, as well as the nearby subway hub on canal street. I was surprised to hear the …",
      "date": null,
      "userInfo": "Local Guide · 346 reviews · 540 photos"
    },
    {
      "user": "Tamara Jones",
      "rating": "5/5",
      "text": "Fantastic hotel - will stay here every time I'm passing through NYC. Staff, decor, views, everything was great. …",
      "date": null,
      "userInfo": "Local Guide · 141 reviews · 70 photos"
    },
    {
      "user": "Ramzi",
      "rating": "1/5",
      "text": "I would avoid if you want a no-worries stay (especially for business).\n\nPros: Staff are generally kind. …",
      "date": null,
      "userInfo": "12 reviews"
    },
    {
      "user": "Joseph Alfie",
      "rating": "5/5",
      "text": "Great Staff. Clean Rooms. Great Location. Fantastic rooftop bar and beyond amazing coffee in the lounge area. will definitely be coming back, they care about their clientele!",
      "date": null,
      "userInfo": "Local Guide · 47 reviews · 1 photo"
    },
    {
      "user": "Brennan Fox",
      "rating": "2/5",
      "text": "The concierge / bartender on floor 1 was extremely rude and overbearing for guests of the hotel when trying to have 1 drink at one of the bar options - made 4 of us feel super uncomfortable and we chose to leave",
      "date": null,
      "userInfo": "43 reviews · 7 photos"
    },
    {
      "user": "Rey Tanada",
      "rating": "5/5",
      "text": "Wow, what can I say about the Walker Tribeca? I had a bit of a transcendent experience but I'll try my best to describe my stay. …",
      "date": null,
      "userInfo": "2 reviews · 1 photo"
    },
    {
      "user": "Hana",
      "rating": "5/5",
      "text": "The service here is amazing: thoughtful and warm. Thanks Fatima❤️ and the entire staff.\nI think it’s better to go to a higher floor because of the noise. Otherwise? It was fantastic",
      "date": null,
      "userInfo": "Local Guide · 141 reviews · 2,928 photos"
    },
    {
      "user": "Ben Danna",
      "rating": "4/5",
      "text": "Nice hotel in a nice location at a reasonable rate but service could be slightly improve. Also kinda weird, and a pain if you have a lot of luggage, is that there are stairs up or down right as you enter - before you have access to an elevator or check in",
      "date": null,
      "userInfo": "21 reviews"
    },
    {
      "user": "Christine Khamisi",
      "rating": "5/5",
      "text": "Friendly staff, cool lounge, and cute rooms!  The location was great for us, just a short walk to the subway or to our new favorite pizza place (Manero's in Little Italy!).",
      "date": null,
      "userInfo": "17 reviews · 10 photos"
    },
    {
      "user": "Troy Farlow",
      "rating": "5/5",
      "text": "The Walker Hotel was amazing!  While the rooms were charming, nice, well appointed, with marble bathrooms, and great views, etc, etc., it was the HOTEL STAFF that made it truly amazing.  The people that work at the Walker are SINCERE.  As in, they actually give a damn!  And well, that's priceless.  I highly recommend The Walker Hotel.",
      "date": null,
      "userInfo": "7 reviews"
    },
    {
      "user": "alex m",
      "rating": "1/5",
      "text": "The customer care person was not helpful and rude.\nThe hotel room offered was not aligned with the description.\nThey even gave me trouble when requested to be invoiced.\nTerrible - stay way.",
      "date": null,
      "userInfo": "3 reviews"
    },
    {
      "user": "Rick Hochman",
      "rating": "5/5",
      "text": "Rooms have been updated with the latest electronics while retaining the old world charm. View from the rooftop bar is spectacular. If you can find the speakeasy after roof closes, it will be well worth it.",
      "date": null,
      "userInfo": "Local Guide · 70 reviews · 144 photos"
    },
    {
      "user": "Caitlin Cardwell",
      "rating": "5/5",
      "text": "Excellent amenities, clean, and in a great location. Would highly recommend.",
      "date": null,
      "userInfo": "Local Guide · 269 reviews · 71 photos"
    },
    {
      "user": "Victoria Queen",
      "rating": "5/5",
      "text": "Lovely hotel. Great location and mind-blowing view! Be aware, that the bar is not open every day and there is no breakfast on Monday.",
      "date": null,
      "userInfo": "101 reviews · 23 photos"
    },
    {
      "user": "Leanne",
      "rating": "5/5",
      "text": "Great location close to lots of subway lines. Rooms are small but has everything you need. Great coffee next door.",
      "date": null,
      "userInfo": "6 reviews · 1 photo"
    },
    {
      "user": "Eshika Patel",
      "rating": "4/5",
      "text": "i only went to the coffee shop, good place to work but the wifi is really bad. i would only go if u bring ur own hotspot. but a lot of people work in the lobby/coffee shop area!",
      "date": null,
      "userInfo": "Local Guide · 160 reviews · 139 photos"
    },
    {
      "user": "Maria M",
      "rating": "5/5",
      "text": "Love it!  Love the gym design.\nStaff super friendly. Eli helped me tons with all my luggage during my checkout. It wasn’t even his responsibility and he was way too nice to help me! He was my hero.",
      "date": null,
      "userInfo": "15 reviews · 2 photos"
    },
    {
      "user": "Dimitri Ivanoff",
      "rating": "5/5",
      "text": "Brand new hotel located in Tribeca area, just off the Canal Street. Walking distance to Little Italy and SoHo. Very friendly service, reasonable prices. Please note that rooms are on a smaller size - perfect for a weekend getaway but …",
      "date": null,
      "userInfo": "Local Guide · 357 reviews · 5,874 photos"
    },
    {
      "user": "Amanda Messenger",
      "rating": "5/5",
      "text": "Although the room was quite small, it was perfect for my needs, with a lovely view. The staff was so helpful and accommodating. I would definitely stay again !",
      "date": null,
      "userInfo": "8 reviews"
    },
    {
      "user": "Natalie Waechter",
      "rating": "1/5",
      "text": "The smallest hotel I have ever stayed in.  Awful.  Not advertised as a “micro” hotel.   Front desk insisted that’s what it was. Received pushback from asking for extra hangers.",
      "date": null,
      "userInfo": "12 reviews · 1 photo"
    },
    {
      "user": "mariana qb",
      "rating": "3/5",
      "text": "The room is clean, very tight but good design. The Wifi is NOT GOOD in the room! It's very unstable. Everything is smart, but not everything works – some lights in my room were not working.",
      "date": null,
      "userInfo": "Local Guide · 85 reviews · 192 photos"
    },
    {
      "user": "Noa",
      "rating": "5/5",
      "text": "One if the best hotel experience I ever had!\nAmazing team, great location with everything around-good food, bars, art galleries and shops. …",
      "date": null,
      "userInfo": "6 reviews · 10 photos"
    },
    {
      "user": "Mr. Dolor",
      "rating": "5/5",
      "text": "Our stay was excellent! Reservations were quick and simple to book online. From the location, to the amenities, and service teem in place, Walker Hotel Tribeca is a fun and easy way to enjoy the big city in style and comfort!",
      "date": null,
      "userInfo": "5 reviews · 1 photo"
    },
    {
      "user": "Catie Case",
      "rating": "5/5",
      "text": "My new favorite hotel jn downtown NYC. Great for work trips bc the rooms are comfortable and feel homey. Staff is friendly and the new restaurant is fab.",
      "date": null,
      "userInfo": "Local Guide · 141 reviews · 388 photos"
    },
    {
      "user": "Michal Levy",
      "rating": "4/5",
      "text": "Quite small room, but for a one person it us OK. Great location next to all must seen places in the Soho!",
      "date": null,
      "userInfo": "8 reviews · 86 photos"
    },
    {
      "user": "Felix Frank",
      "rating": "2/5",
      "text": "Don‘t go in winter. The window in my room did not close properly and since the bed is directly next to the window it was really cold at night. Also, despite asking several times, I could not get a second blanket.",
      "date": null,
      "userInfo": "5 reviews"
    },
    {
      "user": "Kutluhan Bayram",
      "rating": "5/5",
      "text": "Pillows are garbage, but I don’t want to be mean and give a 4 because it’s a great hotel. Fix your pillows tho.",
      "date": null,
      "userInfo": "Local Guide · 26 reviews · 5 photos"
    },
    {
      "user": "Stefan Müller",
      "rating": "5/5",
      "text": "Located in lower Manhattan, near to a subway station. You can reach all the highlights of NYC real quick. Modern hotel, nice rooms, top Service. Everything was absolutely perfect",
      "date": null,
      "userInfo": "10 reviews"
    },
    {
      "user": "Corinne Margo",
      "rating": "5/5",
      "text": "It is perfect and everyone is super friendly! I also love the different \"play spaces\" such as lounge, roof, coffee shop, and speak easy!",
      "date": null,
      "userInfo": "Local Guide · 67 reviews · 39 photos"
    },
    {
      "user": "Will Levy",
      "rating": "5/5",
      "text": "Joshua the bellman was very helpful and courteous. Thank you",
      "date": null,
      "userInfo": "1 review"
    },
    {
      "user": "Holly Bastin",
      "rating": "5/5",
      "text": "The Walker Hotel was wonderful, the room was tidy and simple- all I needed with a little extra for convenience. The staff was the best part. They were super accommodating to some random requests and did everything they could to make sure I had a great experience. Thanks y'all!",
      "date": null,
      "userInfo": "Local Guide · 49 reviews · 45 photos"
    },
    {
      "user": "Miguel Zapata",
      "rating": "1/5",
      "text": "This doesn't have a bar, Doesn't have a rooftop, doesn't have a restaurant, rooms are beyond Small. They were office Spaces converted into Rooms. The elevator is constantly getting stuck, also the fire alarm panel is forever going off. And Top of that they have bed bugs",
      "date": null,
      "userInfo": "Local Guide · 5 reviews"
    },
    {
      "user": "Rob",
      "rating": "5/5",
      "text": "This is a beautifully maintained, clean, hip, fun hotel in a great location. The staff is incredibly friendly (just meet Belle). You will love it.",
      "date": null,
      "userInfo": "44 reviews"
    },
    {
      "user": "Fleur Suijten",
      "rating": "5/5",
      "text": "My stay in the Walker Hotel Tribeca was really excellent! I can recomment it for sure! Easy to walk to midtown or visit lower Manhattan. Rooms are very clean. Perfect service and modern interior. Next time I go to NY I will visit again.",
      "date": null,
      "userInfo": "8 reviews · 4 photos"
    },
    {
      "user": "Lan C",
      "rating": "4/5",
      "text": "The lobby here is the new living room for quick coffee breaks and work meetings. There is a Blue Bottle Coffee off the lobby. Afternoons, the lobby bar has beer, wine, coffee, and fresh baked cookies.",
      "date": null,
      "userInfo": "Local Guide · 236 reviews · 355 photos"
    },
    {
      "user": "Eric Amador",
      "rating": "5/5",
      "text": "Great location, efficient room layout, awesome rooftop bar, and a Blue Bottle Coffee in the lobby. Really could not have asked for more from my stay.",
      "date": null,
      "userInfo": "2 reviews · 2 photos"
    },
    {
      "user": "Nicole S",
      "rating": "4/5",
      "text": "Came to the flower shop rooftop pop up! Nice views and beautiful decor. Definitely recommend!",
      "date": null,
      "userInfo": "Local Guide · 170 reviews · 450 photos"
    },
    {
      "user": "Hina amin",
      "rating": "5/5",
      "text": "Nice clean hotel with accessible location. Friendly staff and Francis at the front desk very nice and helpful every time we asked for anything. We’ll stay again whenever visit NYC.",
      "date": null,
      "userInfo": "11 reviews · 2 photos"
    },
    {
      "user": "Emmanuel et Floriane",
      "rating": "1/5",
      "text": "Do not recommend this place - Rude staff, dirty room\n+: * Well located that's all\n-: * Rude staff specially Micheal (night shift - who did not answer phone - I …",
      "date": null,
      "userInfo": "23 reviews · 10 photos"
    },
    {
      "user": "Cath Moore",
      "rating": "4/5",
      "text": "Great location, very small rooms but comfortable. I had a great city view.",
      "date": null,
      "userInfo": "8 reviews · 10 photos"
    },
    {
      "user": "Justin De Moulin",
      "rating": "5/5",
      "text": "Excellent place, classy and small room. Loved the style. Great rooftop views.",
      "date": null,
      "userInfo": "105 reviews · 60 photos"
    },
    {
      "user": "B Johnson",
      "rating": "1/5",
      "text": "Room was adequate, front desk was friendly but unable to charge the correct card (corporate vs personal) despite repeated requests.  The workout room is utterly inadequate.",
      "date": null,
      "userInfo": "2 reviews"
    },
    {
      "user": "Nilou Shahryari",
      "rating": "5/5",
      "text": "Nelson was SO friendly. I don’t normally write reviews but felt like he deserved some recognition.",
      "date": null,
      "userInfo": "11 reviews"
    },
    {
      "user": "Hi Wang",
      "rating": "5/5",
      "text": "Excellent lodgings, clean and modern. Friendly staff as well. Rooms were small but you don’t come to nyc to stay in a hotel room",
      "date": null,
      "userInfo": "Local Guide · 37 reviews · 24 photos"
    },
    {
      "user": "Kathleen McDowell",
      "rating": "1/5",
      "text": "all 5 of their lobby bathrooms said \"out of order\" and when I asked for assistance and guidance ...their concierge were unhelpful and unapologetic",
      "date": null,
      "userInfo": "6 reviews · 16 photos"
    },
    {
      "user": "Cesar Naranjo",
      "rating": "3/5",
      "text": "Just okay. Rooms too small even for NYC standards. The floors were uneven and the ventilation system wasn't great.",
      "date": null,
      "userInfo": "Local Guide · 26 reviews · 13 photos"
    },
    {
      "user": "Ash P",
      "rating": "5/5",
      "text": "Bluebottle on the ground floor is super.\nFriendly staff. Room is compact but everything we need is there.",
      "date": null,
      "userInfo": "Local Guide · 156 reviews · 59 photos"
    },
    {
      "user": "Tracey Gill",
      "rating": "4/5",
      "text": "Rooms are extremely small, but comfortable mattress.  Nice lobby with a coffee for relaxed seating.",
      "date": null,
      "userInfo": "Local Guide · 44 reviews · 649 photos"
    },
    {
      "user": "Tair Korf",
      "rating": "5/5",
      "text": "The stuff is amazing, so king and willing to help any time.\nThe rooms are clean and nice and the entire hotel is really pretty and new",
      "date": null,
      "userInfo": "5 reviews · 2 photos"
    },
    {
      "user": "MrRainingHeavy",
      "rating": "4/5",
      "text": "Rooms are small, especially for the price.\nStaff friendly and helpful.\nBusy coffee shop on the 1st floor.",
      "date": null,
      "userInfo": "Local Guide · 21 reviews · 1 photo"
    },
    {
      "user": "Logan Gentry",
      "rating": "3/5",
      "text": "A good deal in a good location, but the rooms are tiny. Better to visit the lounge, rooftop bar and speakeasy than to actually stay.",
      "date": null,
      "userInfo": "2 reviews"
    },
    {
      "user": "Ceng Sagnic",
      "rating": "3/5",
      "text": "There is no parking here. So it better be corrected. Parking is three blocks away. Otherwise convenient, small but functional hotel.",
      "date": null,
      "userInfo": "Local Guide · 18 reviews · 1 photo"
    },
    {
      "user": "shay **",
      "rating": "1/5",
      "text": "I was temporarily charged 200$ for incidentals upon arrival. It has been 12 days now, and the money still has not been refunded back to my account.",
      "date": null,
      "userInfo": "4 reviews · 1 photo"
    },
    {
      "user": "Jojo",
      "rating": "4/5",
      "text": "Loved the style and decor.  Room wasn’t anything special though. Small space, but that’s nyc. Try the speakeasy downstairs. Great location.",
      "date": null,
      "userInfo": "42 reviews"
    },
    {
      "user": "Shant Davidian",
      "rating": "5/5",
      "text": "Location was great, staff was friendly and knowledgeable, rooms were modern and comfortable. Open bar, rooftop bar, cafe, Needed iron, but was none.",
      "date": null,
      "userInfo": "Local Guide · 360 reviews · 697 photos"
    },
    {
      "user": "Jacqueline Piccini",
      "rating": "5/5",
      "text": "It’s a beautiful hotel, young and modern, I went to the roof and it’s an amazing view, the service staff were super friendly, nice cocktails.",
      "date": null,
      "userInfo": "Local Guide · 37 reviews · 10 photos"
    },
    {
      "user": "MT",
      "rating": "5/5",
      "text": "Incredibly tasteful and great service and atmosphere. Amazing value for money compared to other NYC hotels. Will return!",
      "date": null,
      "userInfo": "Local Guide · 71 reviews · 24 photos"
    },
    {
      "user": "Trip.com Member",
      "rating": "3.2/5",
      "text": "Rooms were exceptionally tiny, even by New York standards. Very friendly staff",
      "date": null,
      "userInfo": null
    },
    {
      "user": "Matt Donohoe",
      "rating": "5/5",
      "text": "Rooms are small but that’s expected in nyc. Clean, great design, really cool bathroom/shower. Would recommend.",
      "date": null,
      "userInfo": "3 reviews"
    },
    {
      "user": "Elyse Kadokura",
      "rating": "1/5",
      "text": "I checked in at the Walker Hotel Tribeca on Friday 10/01 and was planning on staying for a week. On Mon 10/04, I started getting bites on my ankles. Tuesday 10/05 I started to feel raised bumps on my arm and on Wed the bites were painful …",
      "date": null,
      "userInfo": "Local Guide · 19 reviews · 5 photos"
    },
    {
      "user": "J V",
      "rating": "5/5",
      "text": "While I cannot speak to the rooms, I did spend some time in the lounge/waiting area and enjoyed a delicious old fashioned. Service was excellent, I’m looking forward to going back",
      "date": null,
      "userInfo": "Local Guide · 214 reviews · 9,497 photos"
    },
    {
      "user": "Alex Macintosh",
      "rating": "5/5",
      "text": "Nice clean hotel, I would be glad to stay here again. The staff is friendly.",
      "date": null,
      "userInfo": "Local Guide · 97 reviews · 407 photos"
    },
    {
      "user": "Liat Peles",
      "rating": "4/5",
      "text": "Small room but super comfortable and stylish. Well located next to soho and few subway lines",
      "date": null,
      "userInfo": "Local Guide · 310 reviews · 818 photos"
    },
    {
      "user": "Keith Stubbs",
      "rating": "4/5",
      "text": "Tiny room, clean, modern.",
      "date": null,
      "userInfo": "Local Guide · 92 reviews · 92 photos"
    },
    {
      "user": "Lasse M",
      "rating": "5/5",
      "text": "Decent hotel, clean and modern. In the heart of TriBeCa. However, as typical in NYC though, the rooms are rather small.",
      "date": null,
      "userInfo": "Local Guide · 79 reviews · 7 photos"
    },
    {
      "user": "Charlie A. Davidson",
      "rating": "5/5",
      "text": "Smallish rooms (which is everywhere in NYC) with cool decoration and theme. Great music. Great coffee in AM.",
      "date": null,
      "userInfo": "Local Guide · 9 reviews · 5 photos"
    },
    {
      "user": "FreshFire Grill",
      "rating": "1/5",
      "text": "Terrible custom service.  Very impersonal.  Staff lack empathy and hospitality.  Only warmth I received was the the housekeeping lady.  Sad.  So want to be hip, forgot how to be human.",
      "date": null,
      "userInfo": "2 reviews"
    },
    {
      "user": "Audrius Zujus",
      "rating": "1/5",
      "text": "Tiny rooms, not tidy, no soap, receptions doesn’t answer. You are better off in CitizenM for half the price. Not staying again.",
      "date": null,
      "userInfo": "Local Guide · 44 reviews · 13 photos"
    },
    {
      "user": "Dim Sum and Doughnuts",
      "rating": "5/5",
      "text": "Love this hotel and everyone who works there! Great views, very clean and totally welcoming. I can’t wait to come back one day! ⭐️⭐️⭐️⭐️⭐️",
      "date": null,
      "userInfo": "29 reviews · 5 photos"
    },
    {
      "user": "Matthew Lockwood",
      "rating": "5/5",
      "text": "My favorite place to stay in NYC. Great location, A+ staff, and a lobby that feels like your own stylish living room in the heart of Tribeca.",
      "date": null,
      "userInfo": "5 reviews"
    },
    {
      "user": "Ariel Dabora",
      "rating": "1/5",
      "text": "Avoid this hotel at all costs!\nNo hot water (known problem on floors 6,7,8) alot of misinformation surrounding the issue when we inquired about it",
      "date": null,
      "userInfo": "30 reviews · 12 photos"
    },
    {
      "user": "Nicholas Miles",
      "rating": "5/5",
      "text": "the walker had me feeling myself. lol. i loved the location and the coffee shop. the views from my room were beautiful!",
      "date": null,
      "userInfo": "Local Guide · 1,472 reviews · 68,062 photos"
    },
    {
      "user": "Stephen Beck",
      "rating": "5/5",
      "text": "Great spot. Good location. Rooms are comfortable. Lobby space is nice. Will stay again.",
      "date": null,
      "userInfo": "5 reviews · 1 photo"
    },
    {
      "user": "Paige Orzechowski",
      "rating": "5/5",
      "text": "Great value, surprisingly spacious, very cute atmosphere and great location. I was surprised no room service.",
      "date": null,
      "userInfo": "Local Guide · 36 reviews · 42 photos"
    },
    {
      "user": "Joseph Milligan",
      "rating": "5/5",
      "text": "Great service from Samantha, Johnny and entire staff. They were quick to find solutions to any issues with professionalism and courtesy.  A rare find in todays service industry.",
      "date": null,
      "userInfo": "7 reviews"
    },
    {
      "user": "Johnny Ricochet",
      "rating": "5/5",
      "text": "Great area , the hotel was beautiful and unique , staff were very polite , helpful and friendly i recommended to anyone visiting NY or Manhattan for that matter 10/10",
      "date": null,
      "userInfo": "18 reviews"
    },
    {
      "user": "Ryan Shilpin",
      "rating": "5/5",
      "text": "Centrally located and a great staff. The restaurant on premises is superb.",
      "date": null,
      "userInfo": "Local Guide · 214 reviews · 2,236 photos"
    },
    {
      "user": "She so Chic",
      "rating": "5/5",
      "text": "The rooms a super tiny but clean and modern",
      "date": null,
      "userInfo": "5 reviews"
    },
    {
      "user": "Fname Lname",
      "rating": "2/5",
      "text": "Super small room, lowest value for money.\nNot clean. Not worth price more than 90$.",
      "date": null,
      "userInfo": "4 reviews"
    },
    {
      "user": "Bernard Hon",
      "rating": "5/5",
      "text": "Excellent hotel stay and friendly staff. Love the lounge area, tastefully furnished and decorated.",
      "date": null,
      "userInfo": "8 reviews · 1 photo"
    },
    {
      "user": "Emma Matters",
      "rating": "5/5",
      "text": "Extremely attentive staff. Rooms aren’t enormous but are neat and well kept. Lovely common areas",
      "date": null,
      "userInfo": "9 reviews · 5 photos"
    },
    {
      "user": "Alexander Kern",
      "rating": "4/5",
      "text": "Great value for money and friendly staff- Wi-Fi is too slow however, in the coffee shop and in rooms.",
      "date": null,
      "userInfo": "7 reviews"
    },
    {
      "user": "Effy Liu",
      "rating": "4/5",
      "text": "Value is great. Good location, easy access to things I need. Very cute lobby/coffee shop.",
      "date": null,
      "userInfo": "Local Guide · 140 reviews · 350 photos"
    },
    {
      "user": "Linda Rose",
      "rating": "5/5",
      "text": "Amazing views, friendly staff and Blue Bottle Coffee being right in the lobby was the best, so conveniently located as well!",
      "date": null,
      "userInfo": "Local Guide · 15 reviews · 17 photos"
    },
    {
      "user": "Wade Trefethen",
      "rating": "5/5",
      "text": "I've not booked a hotel room but the inside of this hotel is very cozy.  I love the lobby.",
      "date": null,
      "userInfo": "Local Guide · 420 reviews · 3,145 photos"
    },
    {
      "user": "andre wiesmayr",
      "rating": "5/5",
      "text": "Great location, lobby lounge, small but well-designed rooms. Solid choice.",
      "date": null,
      "userInfo": "3 reviews · 5 photos"
    },
    {
      "user": "Katherine Rodriguez",
      "rating": "5/5",
      "text": "It was my first time here and Erik the employee was very polite, well spoken and helpful. He gave good recommendations, it was a great service, I definitely recommend staying here.😊😊😊 …",
      "date": null,
      "userInfo": "2 reviews"
    },
    {
      "user": "Dan Lam",
      "rating": "5/5",
      "text": "Cute rooms, friendly service, great location. Jake at the front door was exceptionally helpful and nice, thank you!",
      "date": null,
      "userInfo": "Local Guide · 17 reviews · 7 photos"
    },
    {
      "user": "Alex Stecyk",
      "rating": "5/5",
      "text": "Small rooms (it's New York), great location, friendly and helpful staff.  I'll stay there again.",
      "date": null,
      "userInfo": "Local Guide · 21 reviews · 135 photos"
    },
    {
      "user": "Andrew Oman",
      "rating": "5/5",
      "text": "Great quick service, helpful staff and a clean room.  The room is very small, but that's to be expected in soho.",
      "date": null,
      "userInfo": "Local Guide · 11 reviews · 2 photos"
    },
    {
      "user": "AKIRRA OUTERBRIDGE",
      "rating": "3/5",
      "text": "THIS HOTEL WAS A VERY NICE PLACE BUT I ONLY WENT THERE FOR A MODELING  AUDITION,  FROM WHAT I CAN SEE  IT IS A NICE PLACE TO STAY, THE STAFF ON SITE AT THE  TIME WAS VERY NICE AND RESPECTFUL",
      "date": null,
      "userInfo": "Local Guide · 298 reviews · 3,998 photos"
    },
    {
      "user": "Aimie Neighbour",
      "rating": "5/5",
      "text": "Love the location, super friendly staff and nice rooms. Small but stylish.",
      "date": null,
      "userInfo": "Local Guide · 79 reviews · 263 photos"
    },
    {
      "user": "Lucy Huang",
      "rating": "5/5",
      "text": "blue bottle coffee on the ground floor",
      "date": null,
      "userInfo": "Local Guide · 379 reviews · 618 photos"
    },
    {
      "user": "Max B",
      "rating": "3/5",
      "text": "Tiny rooms if you get the full size bed. Really meant for 1 person, not 2",
      "date": null,
      "userInfo": "Local Guide · 25 reviews · 1 photo"
    },
    {
      "user": "T M",
      "rating": "5/5",
      "text": "Great location and rooms. I appreciate their flexibility, too!",
      "date": null,
      "userInfo": "42 reviews · 9 photos"
    },
    {
      "user": "G B",
      "rating": "3/5",
      "text": "Really small rooms!",
      "date": null,
      "userInfo": "Local Guide · 83 reviews · 25 photos"
    },
    {
      "user": "JLC",
      "rating": "1/5",
      "text": "Rooms so small it feels like being in prison. Soulless hotel - do not stay here.",
      "date": null,
      "userInfo": "Local Guide · 300 reviews · 19 photos"
    },
    {
      "user": "Kate Sweeney",
      "rating": "5/5",
      "text": "Great location, really helpful staff, lovely room...whats not to love?! Would definitely stay again",
      "date": null,
      "userInfo": "2 reviews"
    },
    {
      "user": "Nick",
      "rating": "5/5",
      "text": "Great rooms, quaint feeling, fair price",
      "date": null,
      "userInfo": "Local Guide · 223 reviews · 26 photos"
    },
    {
      "user": "W Kim",
      "rating": "5/5",
      "text": "Small room... but other than that, very clean and comfy.",
      "date": null,
      "userInfo": "13 reviews"
    },
    {
      "user": "Madi Caruso",
      "rating": "5/5",
      "text": "Great hotel, helpful & friendly staff, convenient location.",
      "date": null,
      "userInfo": "Local Guide · 115 reviews · 46 photos"
    },
    {
      "user": "Mohamed “Ben said”",
      "rating": "1/5",
      "text": "The reception, the woman she’s very rude, I would never go again, please don’t go to this hotel",
      "date": null,
      "userInfo": "24 reviews"
    },
    {
      "user": "Marcel",
      "rating": "5/5",
      "text": "I stay here all the time. Wake up early grab blue bottle back up to the room . Love it .",
      "date": null,
      "userInfo": "42 reviews · 2 photos"
    },
    {
      "user": "toby weitz",
      "rating": "2/5",
      "text": "Disappointed that a 4-star hotel doesn’t offer room service or a restaurant and bar inside the hotel.",
      "date": null,
      "userInfo": "1 review"
    },
    {
      "user": "Tom Marshall",
      "rating": "5/5",
      "text": "Awesome food, On the search for the best pizza in NYC and this is currently at the top of the list.",
      "date": null,
      "userInfo": "Local Guide · 61 reviews · 52 photos"
    },
    {
      "user": "Ross Caton",
      "rating": "4/5",
      "text": "Tiny rooms but well-designed and high quality",
      "date": null,
      "userInfo": "Local Guide · 25 reviews · 5 photos"
    },
    {
      "user": "Annette Boyd",
      "rating": "5/5",
      "text": "Love this hotel. Great neighborhood and close to so many things.",
      "date": null,
      "userInfo": "Local Guide · 26 reviews · 12 photos"
    },
    {
      "user": "Ludovica Bertola",
      "rating": "5/5",
      "text": "Great location, nice room layout and details despite the size",
      "date": null,
      "userInfo": "8 reviews"
    },
    {
      "user": "Kat G",
      "rating": "4/5",
      "text": "Rooms are tiny but overall good experience here",
      "date": null,
      "userInfo": "Local Guide · 80 reviews · 11 photos"
    },
    {
      "user": "Laurent Bouaziz",
      "rating": "5/5",
      "text": "Very well located in Tribeca.\nCute tiny rooms with big windows",
      "date": null,
      "userInfo": "Local Guide · 458 reviews · 530 photos"
    },
    {
      "user": "Michael Assraf",
      "rating": "5/5",
      "text": "Solid stay as usual , don't forget to pay a visit to Corey and Chris at the lobby bar and check out the rooftop",
      "date": null,
      "userInfo": "Local Guide · 90 reviews · 211 photos"
    },
    {
      "user": "Isabelle Le Normand",
      "rating": "1/5",
      "text": "The hotel has noisy rooms and the worst staff. Bad experience.",
      "date": null,
      "userInfo": "2 reviews"
    },
    {
      "user": "Daniel Zuzalek",
      "rating": "5/5",
      "text": "Small room, but everything necessary. Great view!",
      "date": null,
      "userInfo": "Local Guide · 46 reviews · 18 photos"
    },
    {
      "user": "Anothai Niruttimetee",
      "rating": "2/5",
      "text": "The service is just not matched with 4 stars hotel. Quite slow..",
      "date": null,
      "userInfo": "1 review"
    },
    {
      "user": "Neha me",
      "rating": "5/5",
      "text": "Good clean nice place",
      "date": null,
      "userInfo": "Local Guide · 77 reviews · 48 photos"
    },
    {
      "user": "Ali Riaz",
      "rating": "4/5",
      "text": "Good little place with tiny cozy rooms. Very friendly staff.",
      "date": null,
      "userInfo": "Local Guide · 54 reviews · 2 photos"
    },
    {
      "user": "Shelly Dall",
      "rating": "4/5",
      "text": "The internet was very slow. Not cool",
      "date": null,
      "userInfo": "54 reviews · 9 photos"
    },
    {
      "user": "Claudia Gibbs Howard",
      "rating": "5/5",
      "text": "Love this place! Great room in a good location",
      "date": null,
      "userInfo": "Local Guide · 66 reviews · 22 photos"
    },
    {
      "user": "Fahiye F",
      "rating": "5/5",
      "text": "Great atmosphere with a specialty coffee cafe in the lobby 👌🏾 …",
      "date": null,
      "userInfo": "14 reviews · 3 photos"
    },
    {
      "user": "Emmanuel Águilar",
      "rating": "5/5",
      "text": "Excellent Wonderful",
      "date": null,
      "userInfo": "Local Guide · 23 reviews · 1 photo"
    },
    {
      "user": "Jane Doe",
      "rating": "5/5",
      "text": "Top notch service 👌\nClean 😊\nAtmosphere👍\nRooftop bar AMAZING 😊 …",
      "date": null,
      "userInfo": "1 review"
    },
    {
      "user": "Boney Hayes",
      "rating": "5/5",
      "text": "Food Was delicious and the waiter was very pleasant.",
      "date": null,
      "userInfo": "Local Guide · 307 reviews · 2 photos"
    },
    {
      "user": "Maria G",
      "rating": "2/5",
      "text": "Bed bugs and dirty. Shame because there's much potential.",
      "date": null,
      "userInfo": "Local Guide · 11 reviews · 754 photos"
    },
    {
      "user": "Winstonphernandez",
      "rating": "5/5",
      "text": "The best service and they is a very friendly  people ..",
      "date": null,
      "userInfo": "Local Guide · 83 reviews · 23 photos"
    },
    {
      "user": "Jessica Gómez",
      "rating": "5/5",
      "text": "Excellent experience. They help me with everything I asked for",
      "date": null,
      "userInfo": "11 reviews · 7 photos"
    },
    {
      "user": "Clinton Kershaw",
      "rating": "5/5",
      "text": "Great location. Great staff. Great view. All great.",
      "date": null,
      "userInfo": "Local Guide · 341 reviews · 27 photos"
    },
    {
      "user": "David Stevens",
      "rating": "1/5",
      "text": "Wouldn't reccomend for business trips.",
      "date": null,
      "userInfo": "6 reviews"
    },
    {
      "user": "Timothy Yip",
      "rating": "4/5",
      "text": "shared space with Blue Bottle ... bonus***",
      "date": null,
      "userInfo": "Local Guide · 192 reviews · 111 photos"
    },
    {
      "user": "Mikaal Sulaiman",
      "rating": "5/5",
      "text": "Great staff, great rooms, great location!",
      "date": null,
      "userInfo": "5 reviews"
    },
    {
      "user": "Robert Krbavac",
      "rating": "4/5",
      "text": "Clean, great location, lovely staff",
      "date": null,
      "userInfo": "1 review"
    },
    {
      "user": "Kendra Zumhingst",
      "rating": "5/5",
      "text": "Gorgeous, elegant, we loved the vibe!",
      "date": null,
      "userInfo": "Local Guide · 640 reviews · 1,475 photos"
    },
    {
      "user": "Mian Gee",
      "rating": "5/5",
      "text": "This place is a very good place .I love this place.",
      "date": null,
      "userInfo": "Local Guide · 44 reviews"
    },
    {
      "user": "Cleber Machado",
      "rating": "5/5",
      "text": "A really nice hotel for a affordable price",
      "date": null,
      "userInfo": "Local Guide · 20 reviews · 29 photos"
    },
    {
      "user": "Mohamed Salai",
      "rating": "5/5",
      "text": "Great service camel hotel",
      "date": null,
      "userInfo": "4 reviews"
    },
    {
      "user": "Trip.com Member",
      "rating": "5/5",
      "text": "Really great place to stay",
      "date": null,
      "userInfo": null
    },
    {
      "user": "Valeria",
      "rating": "5/5",
      "text": "Great stay",
      "date": null,
      "userInfo": "40 reviews · 5 photos"
    },
    {
      "user": "Mahmudul Hasan",
      "rating": "5/5",
      "text": "⛳️",
      "date": null,
      "userInfo": "Local Guide · 86 reviews · 135 photos"
    },
    {
      "user": "Julien Maldonato",
      "rating": "5/5",
      "text": "Amazing hotel!",
      "date": null,
      "userInfo": "4 reviews · 2 photos"
    },
    {
      "user": "Philip Cham",
      "rating": "5/5",
      "text": "Beautifully designed with amazing service!",
      "date": null,
      "userInfo": "12 reviews"
    },
    {
      "user": "Alfredo Castro",
      "rating": "5/5",
      "text": "Nice place and friendly staff.",
      "date": null,
      "userInfo": "36 reviews"
    },
    {
      "user": "Pavel Popov",
      "rating": "5/5",
      "text": "Nice interior and helpful stuff",
      "date": null,
      "userInfo": "Local Guide · 60 reviews · 6 photos"
    },
    {
      "user": "Demo Franco",
      "rating": "5/5",
      "text": "Great hotel",
      "date": null,
      "userInfo": "16 reviews · 7 photos"
    },
    {
      "user": "Tomás González",
      "rating": "5/5",
      "text": "Perfect place to stay in NYC",
      "date": null,
      "userInfo": "Local Guide · 18 reviews · 90 photos"
    },
    {
      "user": "Amelia Smith",
      "rating": "5/5",
      "text": "Lovely stay in New York",
      "date": null,
      "userInfo": "5 reviews"
    },
    {
      "user": "Jemimah Watkins",
      "rating": "5/5",
      "text": "Awesome stuff and great services",
      "date": null,
      "userInfo": "Local Guide · 68 reviews · 38 photos"
    },
    {
      "user": "Elena Sánchez",
      "rating": "5/5",
      "text": "great location and good service",
      "date": null,
      "userInfo": "Local Guide · 33 reviews · 6 photos"
    },
    {
      "user": "Njm Alddeen",
      "rating": "5/5",
      "text": "Fantastic",
      "date": null,
      "userInfo": "Local Guide · 64 reviews · 114 photos"
    },
    {
      "user": "jolgartner",
      "rating": "5/5",
      "text": "perfect for lower manhattan",
      "date": null,
      "userInfo": "53 reviews · 22 photos"
    },
    {
      "user": "KaiEvol",
      "rating": "5/5",
      "text": "Cool",
      "date": null,
      "userInfo": "Local Guide · 83 reviews · 32 photos"
    },
    {
      "user": "Pieter Jooste",
      "rating": "3/5",
      "text": "It was fine -",
      "date": null,
      "userInfo": "7 reviews · 2 photos"
    },
    {
      "user": "Eli Cook",
      "rating": "5/5",
      "text": "Such a legit vibe!",
      "date": null,
      "userInfo": "Local Guide · 83 reviews · 33 photos"
    },
    {
      "user": "Alexandra Cukrowicz",
      "rating": "3/5",
      "text": "Rooms too small",
      "date": null,
      "userInfo": "4 reviews"
    },
    {
      "user": "Adam Kaplan",
      "rating": "5/5",
      "text": "Very fancy!!",
      "date": null,
      "userInfo": "Local Guide · 42 reviews · 3 photos"
    },
    {
      "user": "Natalia Zamparini",
      "rating": "5/5",
      "text": "Gorgeous lobby.",
      "date": null,
      "userInfo": "Local Guide · 291 reviews · 365 photos"
    },
    {
      "user": "Sivan Miller",
      "rating": "5/5",
      "text": "Lovley coffee",
      "date": null,
      "userInfo": "Local Guide · 21 reviews"
    },
    {
      "user": "Sonya Alvarez",
      "rating": "2/5",
      "text": "ADDITION:\nChecked out of the hotel - no charges mentioned at the desk - come to find out there were facility charges that the checkout didn't let me know about. Called …",
      "date": null,
      "userInfo": "Local Guide · 7 reviews · 2 photos"
    },
    {
      "user": "Alex Anderson",
      "rating": "2/5",
      "text": "Good location, nice staff and ambiance.\n\nBut facilities and furniture needs to be improved. …",
      "date": null,
      "userInfo": "46 reviews · 22 photos"
    },
    {
      "user": "Tribecca Choi",
      "rating": "4/5",
      "text": "There were a few surprises with this hotel, both good and bad. First, there’s a hidden facility fee that wasn’t clear when I booked—it’s calculated daily and is quite a high percentage, so the final price is not what you initially see. …",
      "date": null,
      "userInfo": "Local Guide · 26 reviews · 86 photos"
    },
    {
      "user": "Joy Sacks",
      "rating": "5/5",
      "text": "THANK YOU SO MUCH!",
      "date": null,
      "userInfo": "5 reviews"
    },
    {
      "user": "Daniel Schlichting",
      "rating": "2/5",
      "text": "The hotel meets expectations. The rooms are clean, there are fresh towels every day and the drinking water is regularly replenished. …",
      "date": null,
      "userInfo": "Local Guide · 24 reviews · 10 photos"
    },
    {
      "user": "Guitarjupp Ferraro",
      "rating": "4/5",
      "text": "Very small but clean rooms. Fresh towels are available every day and cleaning takes place every day.\nBreakfast is delicious. …",
      "date": null,
      "userInfo": "4 reviews · 1 photo"
    },
    {
      "user": "Katja",
      "rating": "2/5",
      "text": "The hotel is well located, many highlights are within walking distance, good connections to public transport and has a beautiful roof terrace.\nBut that was about it. The staff is \"forced friendly\", room service is actually …",
      "date": null,
      "userInfo": "38 reviews"
    },
    {
      "user": "Natascha Pascale",
      "rating": "3/5",
      "text": "The room was spotless, comfortable bed. Minimal space... And I was alone. The service deserves a mention, very kind, the manager stopped the taxi for me on the corner of the street. Good location in Tribeca. Obviously the price is outside our standards, but here it is regular",
      "date": null,
      "userInfo": "Local Guide · 172 reviews · 323 photos"
    },
    {
      "user": "Léa Leblanc",
      "rating": "4/5",
      "text": "I stayed for 1 week, if you are alone it's good because the size of the rooms is small (while mine was one of the large ones)\nVery clean and very friendly hotel, the area is pleasant. …",
      "date": null,
      "userInfo": "1 review"
    },
    {
      "user": "Natalia N",
      "rating": "4/5",
      "text": "Served by Argentines, on the opening day of “Charly García” street (11/6/23), they served us exquisite meat empanadas. The atmosphere is very warm. We keep a beautiful memory of that day at the hotel.",
      "date": null,
      "userInfo": "Local Guide · 55 reviews · 255 photos"
    },
    {
      "user": "Maria",
      "rating": "1/5",
      "text": "The one star is explained by the fact that €159 of the $200 was withheld after our departure for no reason. We caused NO damage and were not even told the reason for the hold. …",
      "date": null,
      "userInfo": "49 reviews · 10 photos"
    },
    {
      "user": "Marion DIDIERJEAN",
      "rating": "5/5",
      "text": "I had a great stay at the Walker Hotel! There is simply nothing to complain about: the cleanliness is impeccable, the service is more than welcoming and smiling, the lobby downstairs is pleasant to relax in with a glass of wine or a quality …",
      "date": null,
      "userInfo": "4 reviews"
    },
    {
      "user": "Dr. Andreas Kuschel",
      "rating": "5/5",
      "text": "Nice small rooms with a view (8th floor). Good decor and atmosphere, good restaurant in the hotel. Location is also great to get an impression of the real NY. I would definitely book again next time.",
      "date": null,
      "userInfo": "23 reviews"
    },
    {
      "user": "silvia sacchi",
      "rating": "5/5",
      "text": "Nice hotel, new, small rooms (like many in New York) but extremely well equipped; excellent cleanliness; a three and a half star hotel that also provides bathrobe and slippers; splendid view (we were on the 10th floor); staff always smiling …",
      "date": null,
      "userInfo": "6 reviews"
    },
    {
      "user": "Chatbundi",
      "rating": "5/5",
      "text": "Hotel well located, clean (room cleaned every day), with a superb view! I admit that the rooms are small, but if you are alone it is quite enough!",
      "date": null,
      "userInfo": "25 reviews · 39 photos"
    },
    {
      "user": "Robin Thies",
      "rating": "5/5",
      "text": "Great hotel, very central to the Canal subway station.\nClean and very courteous staff. You get free water at the reception.\nThere is also a café in the building, which is always very busy.",
      "date": null,
      "userInfo": "Local Guide · 201 reviews · 528 photos"
    },
    {
      "user": "Ch K",
      "rating": "5/5",
      "text": "I don't know the rooms but I had a great time here 👍🏻\nClean and with music …",
      "date": null,
      "userInfo": "Local Guide · 58 reviews · 155 photos"
    },
    {
      "user": "samuele cantoro",
      "rating": "5/5",
      "text": "Walker Hotel Tribeca\n77 Walker Street, 10013 New York, United States …",
      "date": null,
      "userInfo": "Local Guide · 31 reviews · 112 photos"
    },
    {
      "user": "Isaac Urrutia40",
      "rating": "1/5",
      "text": "Very small rooms, very small rooms 3/10",
      "date": null,
      "userInfo": "Local Guide · 37 reviews · 8 photos"
    },
    {
      "user": "J.O",
      "rating": "1/5",
      "text": "I don't usually write reviews, but this hotel leaves a lot to be desired, from the moment you reserve a room with payment at the establishment and free cancellation; They decided to charge me days before the trip and when I made the claim …",
      "date": null,
      "userInfo": "2 reviews · 9 photos"
    },
    {
      "user": "Katrin Woersdoerfer",
      "rating": "5/5",
      "text": "Very nice hotel, rooms small but sufficient. Location is perfect, tribeca is great",
      "date": null,
      "userInfo": "Local Guide · 16 reviews"
    },
    {
      "user": "Mengna Niu",
      "rating": "4/5",
      "text": "Because of COVID-19, we stayed at this hotel that was open for doctors and nurses. Simple and clean. The internet speed is super fast. Thumbs up.",
      "date": null,
      "userInfo": "Local Guide · 68 reviews · 56 photos"
    },
    {
      "user": "Alan Sasayama",
      "rating": "2/5",
      "text": "The concept of the hotel itself and the atmosphere of the lobby and cafe are very good, but the staff's response is disappointing.",
      "date": null,
      "userInfo": "Local Guide · 68 reviews · 555 photos"
    },
    {
      "user": "Gabriele Ottaviani",
      "rating": "5/5",
      "text": "Very clean hotel\nSmall but well furnished and functional rooms\nVery kind staff …",
      "date": null,
      "userInfo": "Local Guide · 43 reviews · 177 photos"
    },
    {
      "user": "Heike Linn",
      "rating": "4/5",
      "text": "The view, I was lucky enough to get a room on the 10th floor, was a dream, especially in the evening and at sunrise.",
      "date": null,
      "userInfo": "10 reviews · 2 photos"
    },
    {
      "user": "Simone Corradini",
      "rating": "5/5",
      "text": "Fantastic stay in NY in a strategic location. top rooms and service",
      "date": null,
      "userInfo": "Local Guide · 10 reviews · 34 photos"
    },
    {
      "user": "roey carmi",
      "rating": "5/5",
      "text": "Excellent location in the Soho area\nExcellent value for money. …",
      "date": null,
      "userInfo": "Local Guide · 128 reviews · 317 photos"
    },
    {
      "user": "Martin Roser",
      "rating": "5/5",
      "text": "Everything was great...\nStaff, atmosphere, lobby and rooms.\nDefinitely coming back",
      "date": null,
      "userInfo": "1 review"
    },
    {
      "user": "Ton van der Aar",
      "rating": "5/5",
      "text": "Nice new hotel but still a lot to improve",
      "date": null,
      "userInfo": "Local Guide · 615 reviews · 2,236 photos"
    },
    {
      "user": "Efrat Atun",
      "rating": "4/5",
      "text": "Excellent location, excellent service, but very, very, very small rooms",
      "date": null,
      "userInfo": "Local Guide · 681 reviews · 11,045 photos"
    },
    {
      "user": "Eduardo Sanchez Bayona",
      "rating": "5/5",
      "text": "Ideal, the Charly García corner.",
      "date": null,
      "userInfo": "Local Guide · 153 reviews · 336 photos"
    },
    {
      "user": "Kevin Jara",
      "rating": "1/5",
      "text": "They covered Charly Garcia's mural",
      "date": null,
      "userInfo": "1 review"
    },
    {
      "user": "jorge zeballos",
      "rating": "5/5",
      "text": "Troca and its good taste. Nothing to add.",
      "date": null,
      "userInfo": "Local Guide · 155 reviews · 80 photos"
    },
    {
      "user": "Isac Nacipucha",
      "rating": "5/5",
      "text": "Very good and clean to live",
      "date": null,
      "userInfo": "Local Guide · 90 reviews · 148 photos"
    },
    {
      "user": "Arturo Varela",
      "rating": "5/5",
      "text": "Excellent hotel. Good location",
      "date": null,
      "userInfo": "Local Guide · 272 reviews · 897 photos"
    },
    {
      "user": "Jenifer Cejovic",
      "rating": "5/5",
      "text": "Great hotel, clean and well located",
      "date": null,
      "userInfo": "Local Guide · 22 reviews · 29 photos"
    },
    {
      "user": "Hilerstik",
      "rating": "4/5",
      "text": "Warm welcome and clean room",
      "date": null,
      "userInfo": "Local Guide · 212 reviews · 286 photos"
    },
    {
      "user": "Grazia K",
      "rating": "2/5",
      "text": "The hotel is pretty, but the rooms are really narrow...",
      "date": null,
      "userInfo": "Local Guide · 35 reviews · 59 photos"
    },
    {
      "user": "Anne Mechelen",
      "rating": "5/5",
      "text": "Very good hotel",
      "date": null,
      "userInfo": "Local Guide · 167 reviews · 9 photos"
    },
    {
      "user": "Stefano Arnold",
      "rating": "4/5",
      "text": " \n\nThank you for taking the time to write this review.  Feedback, good and bad, is … More",
      "date": null,
      "userInfo": "Local Guide"
    },
    {
      "user": "Jackson Chen",
      "rating": "5/5",
      "text": " Thank you for this great review! We are thrilled to read that you enjoyed your stay and hope to see you again soon!",
      "date": null,
      "userInfo": "Local Guide · 14 reviews · 19 photos"
    },
    {
      "user": "Veronica",
      "rating": "4/5",
      "text": "Greetings Veronica,\n\nThank you for taking the time to complete this review.  We are thrilled to see … More",
      "date": null,
      "userInfo": "22 reviews · 13 photos"
    },
    {
      "user": "daniel wardwell",
      "rating": "5/5",
      "text": "\nThank you for taking the time to complete this review.  We are thrilled to see that you enjoyed your stay and hope to welcome you back soon! … More",
      "date": null,
      "userInfo": "Local Guide · 34 reviews · 37 photos"
    },
    {
      "user": "Meltem Barlin",
      "rating": "5/5",
      "text": "Great hotel, great staff",
      "date": null,
      "userInfo": "2 reviews"
    },
    {
      "user": "manuel gomez ansio",
      "rating": "4/5",
      "text": "We are thrilled to hear that our team went above and beyond, exceeding your expectations to ensure that you felt welcomed on arrival. We are inspired by the work that they do and are so thankful that you have recognized them for their … More",
      "date": null,
      "userInfo": null
    },
    {
      "user": "Boggio Nicolo",
      "rating": "4/5",
      "text": "Thank you for this great review! We are thrilled to read that you enjoyed your stay and hope to see you again soon!",
      "date": null,
      "userInfo": "5 reviews"
    },
    {
      "user": "Stephen Klenert",
      "rating": "5/5",
      "text": "Hi Stephen-\n\nThank you for taking the time to complete this survey.  We are thrilled to see … More",
      "date": null,
      "userInfo": "Local Guide · 22 reviews · 58 photos"
    },
    {
      "user": "Carlos Mesones",
      "rating": "5/5",
      "text": "Hi Carlos - Thank you for this great review! We are thrilled to read that you enjoyed your stay and hope to see you again soon!",
      "date": null,
      "userInfo": "3 reviews"
    },
    {
      "user": "corgi lover",
      "rating": "4/5",
      "text": "Hi Corgi Lover - Thank you for this great review! We are thrilled to read that you enjoyed your stay and hope to see you again soon!",
      "date": null,
      "userInfo": null
    },
    {
      "user": "J O.",
      "rating": "5/5",
      "text": "Hi J O-\n\nThank you for taking the time to complete this survey.  We are thrilled to see … More",
      "date": null,
      "userInfo": "Local Guide · 37 reviews · 1,383 photos"
    },
    {
      "user": "Aleksei Chistiakov",
      "rating": "5/5",
      "text": "Hi Aleksei- Thank you for this great review! We are thrilled to read that you enjoyed your stay and hope to see you again soon!",
      "date": null,
      "userInfo": "Local Guide · 168 reviews · 586 photos"
    },
    {
      "user": "Alyssa Marotta",
      "rating": "5/5",
      "text": "Hi Alyssa - Thank you for this great review! We are thrilled to read that you enjoyed your stay and hope to see you again soon!",
      "date": null,
      "userInfo": "Local Guide · 30 reviews · 20 photos"
    },
    {
      "user": "Helen Diskin",
      "rating": "5/5",
      "text": "Hi Helen - Thank you for this great review! We are thrilled to read that you enjoyed your stay and hope to see you again soon!",
      "date": null,
      "userInfo": null
    },
    {
      "user": "Shana Williams",
      "rating": "5/5",
      "text": "Hi Shana - Thank you for this great review! We are thrilled to read that you enjoyed your stay and hope to see you again soon!",
      "date": null,
      "userInfo": "Local Guide · 53 reviews · 69 photos"
    },
    {
      "user": "Salvador Arvelo",
      "rating": "5/5",
      "text": "Hi Salvador - Thank you for the 5 stars! Hope to see you again soon!",
      "date": null,
      "userInfo": "Local Guide · 129 reviews · 170 photos"
    },
    {
      "user": "Kyle Wong",
      "rating": "5/5",
      "text": "Hi Kyle- \n\nThank you for this great review! We are thrilled to read that you enjoyed your stay and hope to see you again soon!",
      "date": null,
      "userInfo": "1 review"
    },
    {
      "user": "Jeremy M",
      "rating": "5/5",
      "text": "Hi Jeremy - Thanks for this review!",
      "date": null,
      "userInfo": "Local Guide · 1,067 reviews · 1,224 photos"
    },
    {
      "user": "Khalid Hosein",
      "rating": "5/5",
      "text": "Hi Khalid Hosein,\n\nThank you for taking the time to complete this survey.  We are thrilled to see … More",
      "date": null,
      "userInfo": "Local Guide · 4 reviews · 776 photos"
    },
    {
      "user": "Victoria Chemko",
      "rating": "5/5",
      "text": "Hi Victoria - \n\nThank you for taking the time to complete this survey.  We are thrilled to see … More",
      "date": null,
      "userInfo": "Local Guide · 29 reviews · 12 photos"
    },
    {
      "user": "Pedro Cunial",
      "rating": "4/5",
      "text": "Hi Pedro Cunial,\n\nThank you for this great review! We are thrilled to read that you enjoyed your … More",
      "date": null,
      "userInfo": "Local Guide · 19 reviews"
    },
    {
      "user": "Parag Srivastava",
      "rating": "5/5",
      "text": "Hi Parag - \n\nThank you for taking the time to complete this survey.  We are thrilled to see … More",
      "date": null,
      "userInfo": "Local Guide · 17 reviews · 35 photos"
    },
    {
      "user": "0 1",
      "rating": "5/5",
      "text": "Thank you for this great review! We are thrilled to read that you enjoyed your stay and hope to see you again soon!",
      "date": null,
      "userInfo": "Local Guide · 40 reviews · 24 photos"
    },
    {
      "user": "Ani",
      "rating": "4/5",
      "text": "Hi Ana - Thank you for your review! Hope to see you again soon!",
      "date": null,
      "userInfo": "Local Guide · 42 reviews · 426 photos"
    },
    {
      "user": "Sue Ann Ioanis",
      "rating": "5/5",
      "text": "Hi Sue -\n\nThank you for taking the time to complete this survey.  We are thrilled to see … More",
      "date": null,
      "userInfo": "2 reviews"
    },
    {
      "user": "Daniel Mentado",
      "rating": "5/5",
      "text": "Hi Daniel - \n\nThank you for this great review! We are thrilled to read that you enjoyed your stay and hope to see you again soon!",
      "date": null,
      "userInfo": "Local Guide · 177 reviews · 457 photos"
    },
    {
      "user": "Aziza 84",
      "rating": "5/5",
      "text": "Greetings Azim,\n\nThank you for taking the time to complete this review.  We are thrilled to see … More",
      "date": null,
      "userInfo": "Local Guide · 18 reviews · 1 photo"
    },
    {
      "user": "Charles Shaw",
      "rating": "1/5",
      "text": "Dear Charles\n\nI apologize for any inconvenience or frustration you may have experienced during … More",
      "date": null,
      "userInfo": "Local Guide · 143 reviews"
    },
    {
      "user": "L Buckley",
      "rating": "5/5",
      "text": "Thank you for this great review! We are thrilled to read that you enjoyed your stay and hope to see you again soon!",
      "date": null,
      "userInfo": "Local Guide · 33 reviews · 14 photos"
    },
    {
      "user": "Christina zeng",
      "rating": "5/5",
      "text": "Hi Christina- Thank you for this great review! We are thrilled to read that you enjoyed your stay and hope to see you again soon!",
      "date": null,
      "userInfo": "1 review"
    },
    {
      "user": "Rachel Maher",
      "rating": "5/5",
      "text": "Greetings Rachel,\n\nThank you for taking the time to complete this review.  We are thrilled to see … More",
      "date": null,
      "userInfo": "Local Guide · 12 reviews · 164 photos"
    },
    {
      "user": "Richard Anderson",
      "rating": "5/5",
      "text": "Hi Richard - Thank you for your review!",
      "date": null,
      "userInfo": "Local Guide · 4 reviews"
    },
    {
      "user": "Zola Richards",
      "rating": "5/5",
      "text": "Hi Zola - Thank you for this great review! We are thrilled to read that you enjoyed your stay and hope to see you again soon!",
      "date": null,
      "userInfo": "5 reviews"
    },
    {
      "user": "Christina Balgeman",
      "rating": "5/5",
      "text": "Hi Christina - \n\nThank you for taking the time to complete this survey.  We are thrilled to see … More",
      "date": null,
      "userInfo": "Local Guide · 1 review"
    },
    {
      "user": "Nicholas Barnes",
      "rating": "5/5",
      "text": "Hi Nicholas Barnes,\n\nThank you for taking the time to complete this survey.  We are thrilled to see … More",
      "date": null,
      "userInfo": "Local Guide · 7 reviews · 82 photos"
    },
    {
      "user": "Michael Meagher",
      "rating": "5/5",
      "text": "Dear Michael,\nThank you for your 5- star review. We look forward to welcoming you back soon!\nBest, … More",
      "date": null,
      "userInfo": "1 review"
    },
    {
      "user": "Heiko Winter",
      "rating": "5/5",
      "text": "Hi Heiko Winter,\n\nThank you for taking the time to complete this survey.  We look forward to you … More",
      "date": null,
      "userInfo": "3 reviews · 6 photos"
    },
    {
      "user": "Roger Docerty",
      "rating": "5/5",
      "text": "Hi Roger Docerty,\n\nThank you for this great review! We are thrilled to read that you enjoyed your … More",
      "date": null,
      "userInfo": "1 review"
    },
    {
      "user": "Claus Riedl",
      "rating": "4/5",
      "text": "Greetings, Claus\n\nThank you for taking the time to complete this review.  We are thrilled to see … More",
      "date": null,
      "userInfo": "Local Guide · 5 reviews · 216 photos"
    },
    {
      "user": "רנית ארצי",
      "rating": "5/5",
      "text": "Thank you for the 5 stars!",
      "date": null,
      "userInfo": "1 review"
    },
    {
      "user": "Chris Avery",
      "rating": "4/5",
      "text": "Hi Chris!   Thanks for the 4 star review!  We are still in our soft opening, so be sure to return when our restaurant and new cocktail lounge debuts in early 2020!",
      "date": null,
      "userInfo": "Local Guide · 11 photos"
    },
    {
      "user": "Helen J",
      "rating": "5/5",
      "text": "Hi Helen, \n\nThank you for this great review! We are thrilled to read that you enjoyed your … More",
      "date": null,
      "userInfo": "20 reviews · 10 photos"
    },
    {
      "user": "john traverso",
      "rating": "1/5",
      "text": "Hi John,\n\nThank you for your feedback. I am unable to address your review as the … More",
      "date": null,
      "userInfo": "1 review"
    },
    {
      "user": "Winter Paulino",
      "rating": "4/5",
      "text": "Hi Winter- Thank you for this great review! We are thrilled to read that you enjoyed your stay and hope to see you again soon!",
      "date": null,
      "userInfo": null
    },
    {
      "user": "Ana C",
      "rating": "5/5",
      "text": "Hi Ana C - Thank you for the 5 stars! We hope to see you again soon!",
      "date": null,
      "userInfo": "79 reviews"
    },
    {
      "user": "Catracha Ruth Jordan",
      "rating": "5/5",
      "text": "Hi Catracha - Thank you for these 5 stars!",
      "date": null,
      "userInfo": "Local Guide · 31 reviews"
    },
    {
      "user": "Anthony Conley",
      "rating": "5/5",
      "text": "Thank you Anthony!! You Rock!",
      "date": null,
      "userInfo": "8 reviews · 4 photos"
    },
    {
      "user": "Isobelle",
      "rating": "5/5",
      "text": "Hi Isobelle - Thank you for this great review! We are thrilled to read that you enjoyed your stay and hope to see you again soon!",
      "date": null,
      "userInfo": "Local Guide · 70 reviews · 9 photos"
    },
    {
      "user": "Mauricio Zabalza",
      "rating": "5/5",
      "text": "Greetings, Mauricio\n\nThank you for taking the time to complete this review.  We are thrilled to see … More",
      "date": null,
      "userInfo": "Local Guide · 265 reviews · 1,826 photos"
    },
    {
      "user": "Jainam Sheth",
      "rating": "5/5",
      "text": "Hi Jalnam - Thank you for this great review! We are thrilled to read that you enjoyed your stay and hope to see you again soon!",
      "date": null,
      "userInfo": "Local Guide · 7 reviews"
    },
    {
      "user": "Laurie LaVigne",
      "rating": "5/5",
      "text": "Hi Laurie- \n\nThank you for this great review! We are thrilled to read that you enjoyed your stay and hope to see you again soon!",
      "date": null,
      "userInfo": "Local Guide · 39 reviews · 35 photos"
    },
    {
      "user": "Claudio Esposito",
      "rating": "4/5",
      "text": "Greetings, Claudio\n\nThank you for taking the time to complete this survey.  We are thrilled to see … More",
      "date": null,
      "userInfo": "Local Guide · 8 reviews"
    },
    {
      "user": "Justin Varughese",
      "rating": "5/5",
      "text": "Hi Justin - \n\nThank you for this great review! We are thrilled to read that you enjoyed your stay and hope to see you again soon!",
      "date": null,
      "userInfo": "5 reviews · 2 photos"
    },
    {
      "user": "LatinaPhD.Abroad",
      "rating": "5/5",
      "text": "Hi LatinaPhD.Abroad, \n\nThank you for taking the time to complete this survey.  We are thrilled to see … More",
      "date": null,
      "userInfo": "Local Guide · 70 reviews · 250 photos"
    },
    {
      "user": "Thomas McLennan",
      "rating": "5/5",
      "text": "Hi Thomas - Thank you for this great review! We are thrilled to read that you enjoyed your stay and hope to see you again soon!",
      "date": null,
      "userInfo": "Local Guide · 27 reviews · 1 photo"
    },
    {
      "user": "Walter Tixi",
      "rating": "5/5",
      "text": "\nThank you for taking the time to write this review.  Feedback, good and bad, is a gift and we use this to continue to improve the guest experience. … More",
      "date": null,
      "userInfo": null
    },
    {
      "user": "Adrian Sibaja",
      "rating": "5/5",
      "text": "Hi Adrian- Thank you for this great review! We are thrilled to read that you enjoyed your stay and hope to see you again soon!",
      "date": null,
      "userInfo": "Local Guide · 18 reviews · 145 photos"
    },
    {
      "user": "Thongchai Chansamak",
      "rating": "1/5",
      "text": "Good Afternoon Mr. Thongchai,\n\nI'm really sorry to hear that you didn't have a great experience at the hotel, … More",
      "date": null,
      "userInfo": "4 reviews · 5 photos"
    },
    {
      "user": "Camille Audy",
      "rating": "5/5",
      "text": "Hi Camille - Thank you for this great review! We are thrilled to read that you enjoyed your stay and hope to see you again soon!",
      "date": null,
      "userInfo": "Local Guide · 72 reviews"
    },
    {
      "user": "Courtney Bartunek (Stacy)",
      "rating": "4/5",
      "text": "Hi Courtney - Thank you for this review! We hope to see you again soon!",
      "date": null,
      "userInfo": "Local Guide · 12 reviews · 21 photos"
    },
    {
      "user": "Ilia Kebets",
      "rating": "5/5",
      "text": "Hello Ilia Kebets,\n\nThank you for this great review! We are thrilled to read that you enjoyed your … More",
      "date": null,
      "userInfo": "Local Guide · 242 reviews · 35 photos"
    },
    {
      "user": "Brittany",
      "rating": "5/5",
      "text": "Dear Brittany Niko\n\nThank you so much for taking the time to share your wonderful review! We are … More",
      "date": null,
      "userInfo": "1 photo"
    },
    {
      "user": "マロンマロン",
      "rating": "4/5",
      "text": "We are thrilled to hear that our team went above and beyond, exceeding your expectations to ensure that you felt welcomed on arrival. We are inspired by the work that they do and are so thankful that you have recognized them for their … More",
      "date": null,
      "userInfo": "Local Guide · 170 reviews · 371 photos"
    },
    {
      "user": "Jaclyn Ting",
      "rating": "4/5",
      "text": "Hi Jaclyn - Thank you for this review! Hope to see you again soon.",
      "date": null,
      "userInfo": "Local Guide · 192 reviews · 5 photos"
    },
    {
      "user": "Stella Mi",
      "rating": "2/5",
      "text": "Hi Stella Mi,\n\nThank you for taking the time to provide us a review. We do hope you give us … More",
      "date": null,
      "userInfo": "5 reviews · 6 photos"
    },
    {
      "user": "Vivienne Nguyen",
      "rating": "5/5",
      "text": "Hello Vivienne, \n\nWe are excited for the 5 star feedback! … More",
      "date": null,
      "userInfo": "22 reviews · 34 photos"
    },
    {
      "user": "NamelesS . .",
      "rating": "5/5",
      "text": "Hello,\n\nThank you for staying with us at The Walker, Tribeca! … More",
      "date": null,
      "userInfo": "1 review · 3 photos"
    },
    {
      "user": "Modern Choices",
      "rating": "5/5",
      "text": "We are thrilled to hear that out Hotel Went  above and beyond, exceeding your expectations to ensure that you felt welcomed on arrival. We are inspired by the work that they do and are so thankful that you have recognized our team for their … More",
      "date": null,
      "userInfo": "Local Guide · 12 reviews · 30 photos"
    },
    {
      "user": "Hardev S Syan",
      "rating": "4/5",
      "text": "Greetings Hardev S Syan,\n\nThank you for taking the time to complete this survey.  We are thrilled to see … More",
      "date": null,
      "userInfo": "Local Guide · 16 reviews"
    },
    {
      "user": "Arthur EZZEDINE",
      "rating": "4/5",
      "text": "Thank you Arthur! Have a wonderful day!",
      "date": null,
      "userInfo": "Local Guide · 30 reviews"
    },
    {
      "user": "David Cenaffra",
      "rating": "5/5",
      "text": "Thanks for the 5 stars, David!",
      "date": null,
      "userInfo": "3 reviews · 1 photo"
    },
    {
      "user": "B L",
      "rating": "4/5",
      "text": "Hi BL - Thank you for the stars and we hope to see you again soon!",
      "date": null,
      "userInfo": "Local Guide · 31 reviews · 93 photos"
    },
    {
      "user": "J J",
      "rating": "5/5",
      "text": "Hi JJ - Thank you for this great review! We are thrilled to read that you enjoyed your stay and hope to see you again soon!",
      "date": null,
      "userInfo": "15 reviews · 57 photos"
    },
    {
      "user": "Jose Ayerdis",
      "rating": "5/5",
      "text": "Hi Jose - Thank you for this great review! We are thrilled to read that you enjoyed your stay and hope to see you again soon!",
      "date": null,
      "userInfo": "Local Guide · 77 reviews · 218 photos"
    },
    {
      "user": "George Dickinson",
      "rating": "5/5",
      "text": "Hi George - Thank you for this great review! We are thrilled to read that you enjoyed your stay and hope to see you again soon!",
      "date": null,
      "userInfo": "Local Guide · 78 reviews · 180 photos"
    },
    {
      "user": "Hanlin Li",
      "rating": "2/5",
      "text": "\n\nThank you for taking the time to write this review.  Feedback, good and bad, is … More",
      "date": null,
      "userInfo": "5 reviews"
    },
    {
      "user": "Ann C",
      "rating": "1/5",
      "text": "\nThank you for taking the time to complete this survey.  Feedback, good and bad, is a gift and we use this to continue to improve the guest experience. … More",
      "date": null,
      "userInfo": "1 review"
    },
    {
      "user": "Juan Bolivar",
      "rating": "5/5",
      "text": "Hi Juan Bolivar\n\nMuch appreciation for this great review! We are thrilled to read that you enjoyed your stay and hope to see you again soon!",
      "date": null,
      "userInfo": "2 reviews"
    },
    {
      "user": "Vivek Viswanathan",
      "rating": "2/5",
      "text": " Thank you for this great review! We are thrilled to read that you enjoyed your stay and hope to see you again soon!",
      "date": null,
      "userInfo": "5 reviews"
    },
    {
      "user": "ruby",
      "rating": "4/5",
      "text": "Hi Ruby - Thank you for this great review! Hope to see you again soon.",
      "date": null,
      "userInfo": "3 reviews · 1 photo"
    },
    {
      "user": "Asa Scott",
      "rating": "5/5",
      "text": "Hi Asa Scott,\n\nThank you for this great review! We are thrilled to read that you enjoyed your … More",
      "date": null,
      "userInfo": "Local Guide · 25 reviews · 16 photos"
    },
    {
      "user": "Tgm",
      "rating": "4/5",
      "text": "Thank you for this great review! We are thrilled to read that you enjoyed your stay and hope to see you again soon!",
      "date": null,
      "userInfo": "Local Guide · 51 reviews"
    },
    {
      "user": "Marco Warm",
      "rating": "5/5",
      "text": "Hi Marco - Thank you for the 5 stars.  Hope to see you again soon!",
      "date": null,
      "userInfo": "Local Guide · 17 reviews · 417 photos"
    },
    {
      "user": "唐尧锋",
      "rating": "3/5",
      "text": "Hi  唐尧锋,\n\n Thank you for this great review! We are thrilled to read that you enjoyed your … More",
      "date": null,
      "userInfo": "Local Guide · 22 reviews"
    },
    {
      "user": "D. D. (DonDon)",
      "rating": "5/5",
      "text": "Hi Donnie D!   Thanks for the visit!   We will be launching our new restaurant and new cocktail lounge in early 2020!  Be sure to give us a second look!",
      "date": null,
      "userInfo": "Local Guide · 51 reviews · 32 photos"
    },
    {
      "user": "Anabel Perron",
      "rating": "5/5",
      "text": "Hi Anabel Perron,\n\nThank you for taking the time to complete this survey.  We are thrilled to see … More",
      "date": null,
      "userInfo": "Local Guide · 25 reviews · 55 photos"
    },
    {
      "user": "Elijah Valdez",
      "rating": "5/5",
      "text": "Hi Elijah - Thank you for these 5 stars!",
      "date": null,
      "userInfo": "Local Guide · 94 reviews · 2 photos"
    },
    {
      "user": "Jin L",
      "rating": "4/5",
      "text": "Hi Jin Lin - Thank you for the 4 stars!  We hope to see you again soon.",
      "date": null,
      "userInfo": "Local Guide · 12 reviews · 165 photos"
    },
    {
      "user": "Tyler Jankauskas",
      "rating": "1/5",
      "text": "Hi Tyler -\n\nThank you for taking the time to complete this survey.  Feedback, good and bad, … More",
      "date": null,
      "userInfo": "13 reviews · 1 photo"
    },
    {
      "user": "José Sigifredo González Verá",
      "rating": "5/5",
      "text": "Hi Sigifredo - Thank you for the 5 stars! Hope to see you again soon!",
      "date": null,
      "userInfo": "Local Guide · 196 reviews · 376 photos"
    },
    {
      "user": "Luciano Mannelli",
      "rating": "5/5",
      "text": "Hi Luciano Mannelli,\n\nThank you for this great review! We are delighted that you had a fantastic stay … More",
      "date": null,
      "userInfo": "Local Guide · 26 reviews"
    },
    {
      "user": "Michelle Turpin",
      "rating": "3/5",
      "text": "Good Afternoon Ms. Turpin,\n\nWe're so very sorry to hear that you had less than an amazing stay. We would … More",
      "date": null,
      "userInfo": "17 reviews · 4 photos"
    },
    {
      "user": "Luis Marte",
      "rating": "5/5",
      "text": "Hi Luis - Thank you for your review.  We hope that you visit us again soon!",
      "date": null,
      "userInfo": "Local Guide · 8 reviews · 1 photo"
    },
    {
      "user": "Simon Boyd",
      "rating": "5/5",
      "text": "Thanks Ninja Ninja for the review!",
      "date": null,
      "userInfo": "Local Guide · 7 reviews"
    },
    {
      "user": "smastaki",
      "rating": "5/5",
      "text": "Hi Smastaki,\n\nThank you for taking the time to complete this survey.  We look forward to your … More",
      "date": null,
      "userInfo": "Local Guide · 6 reviews"
    },
    {
      "user": "clarence cooper",
      "rating": "5/5",
      "text": "Hi Clarence!\n\nThank you for your 5-star review. We hope to have the pleasure of seeing you soon!",
      "date": null,
      "userInfo": "Local Guide · 20 reviews · 5 photos"
    },
    {
      "user": "Noel Velez",
      "rating": "5/5",
      "text": " Thank you for this great review! We are thrilled to read that you enjoyed your stay and hope to see you again soon!",
      "date": null,
      "userInfo": "5 reviews · 1 photo"
    },
    {
      "user": "Klara Crean",
      "rating": "4/5",
      "text": "Dear Klara Crean,\n\nThank you for taking the time to provide us with this review. We are delighted … More",
      "date": null,
      "userInfo": "Local Guide · 12 reviews · 2 photos"
    },
    {
      "user": "D B",
      "rating": "5/5",
      "text": "Fantastic!  Thank you for the 5 stars!",
      "date": null,
      "userInfo": "Local Guide · 12 reviews · 119 photos"
    }
  ]
}