{
  "placeDetails": {
    "name": "Walker Hotel Tribeca",
    "address": "77 Walker St, New York, NY 10013",
    "phone": null,
    "rating": "4.1",
    "totalReviews": "541",
    "website": "walkerhotels.com"
  },
  "reviews": [
    {
      "user": "Laura Kee",
      "rating": "3/5",
      "text": "My husband and I have stayed in a lot of hotels in Manhattan and wouldn’t return here. The location is great and the Blue Bottle in the lobby was lovely to have. Check in was a mess, service throughout our stay was not great, and room keys worked only intermittently. We stayed in one of the larger king rooms and it was still the smallest NYC room I’ve ever stayed in, almost comically so. It’s not a bad hotel but for the price you can do much better, even in Manhattan.",
      "date": null,
      "userInfo": "3 reviews",
      "photos": []
    },
    {
      "user": "Tribecca Choi",
      "rating": "4/5",
      "text": "There were a few surprises with this hotel, both good and bad. First, there’s a hidden facility fee that wasn’t clear when I booked—it’s calculated daily and is quite a high percentage, so the final price is not what you initially see.\n\nThe rooms are small, which is typical in NYC, but even so, I was surprised by Walker Hotel’s layout. The interior design isn’t very functional, with a large single sofa taking up a lot of space. The sofa isn’t particularly comfortable either, and moving it is a hassle—the heavy backrest can easily pinch your fingers. I had a painful experience with it, and what really touched me was my 1.5-year-old trying to “scold” the sofa for hurting me! My heart melted, but be cautious and don’t let kids play around with it—it’s very easy to get injured. The room is so tiny that even turning around is difficult.\n\nUltimately, you’ll probably just stay on the bed, which isn’t a problem if all you need is a place to sleep. After all, the hotel’s location is excellent—perfect for exploring NYC, not staying in the room.\n\nThe hotel isn’t very stroller-friendly either. The check-in desk is on the basement level, and from the first floor, you have to take the stairs up with your luggage and stroller before heading downstairs again to check in. There’s a man at the entrance wearing a flashy outfit, but all he does is point you to the stairs and then downstairs—he won’t actually help you with your bags. It’s just how some New Yorkers are: indifferent and cool.\n\nOn the bright side, the coffee shop on the first floor is quite nice, and I had a pleasant experience there.\n\nOverall, while the staff could be more helpful and the rooms are not the most practical, the location and the café downstairs do add some redeeming qualities. Just be prepared for a bit of inconvenience if you’re traveling with kids or have a lot of luggage.",
      "date": null,
      "userInfo": "Local Guide · 28 reviews · 86 photos",
      "photos": [
        "https://lh5.googleusercontent.com/p/AF1QipM0bN8gPIu467r9NhUmLRVHfcDrOOI96ur1xceS=w300-h225-p-k-no",
        "https://lh5.googleusercontent.com/p/AF1QipOUu8rn5vTdoabKUIbGDJOgsdhbbWP_WPLSOV4u=w300-h225-p-k-no",
        "https://lh5.googleusercontent.com/p/AF1QipPxG8plerHNlbOthtDid0ycCCz0xSNdml3FaMuY=w300-h225-p-k-no",
        "https://lh5.googleusercontent.com/p/AF1QipMD1kqqNfPobminXc0OTZO7HpIjQCmlNLVkQzXR=w300-h225-p-k-no"
      ]
    },
    {
      "user": "Alex Anderson",
      "rating": "2/5",
      "text": "Good location, nice staff and ambiance.\n\nBut facilities and furniture needs to be improved.\n\nWalls are full of random uneven paints. Table chips. Sink chips. Set up of the bathroom is weird too but not that big of the deal in this. Lights are missing randomly. TV is not working well. Walls are also not soundproof, might lead to sleep difficulties.\n\nStaffs are very welcoming and helpful. I hope you guys can review this issue and improve",
      "date": null,
      "userInfo": "46 reviews · 22 photos",
      "photos": []
    },
    {
      "user": "Kelly Elaine Alexander",
      "rating": "2/5",
      "text": "Location was fine and the room was clean. Service at the front desk was extraordinarily, above-and-beyond helpful, with everything from AC to check-in. However, the rooms are so small that they're barely habitable—the bed was so small that my husband and I didn't fit together on it, and my legs stuck out over the edge. There was no place to charge our phones. It was a really depressing evening overall.",
      "date": null,
      "userInfo": "50 reviews · 1 photo",
      "photos": []
    },
    {
      "user": "Madelyn Taylor",
      "rating": "5/5",
      "text": "I could not have asked for a better experience at this hotel! From the moment we walked in, the staff was friendly and helpful. We were upgraded to a king suite and received free drink vouchers. While we were only staying one night, we got to check out the rooftop bar with amazing views, drinks, and food. The staff there was incredible as well. I could not believe how nice of a hotel this was for the price. The room was perfect for two people and very clean. I will not stay anywhere else when I return to NYC! I would recommend this hotel to anyone looking to stay in this area.",
      "date": null,
      "userInfo": "1 review",
      "photos": []
    },
    {
      "user": "Marni Appleton",
      "rating": "4/5",
      "text": "Great location and staff are very helpful. The room was mostly clean but some corners had dust buildup and/or weren’t wiped properly. Some parts of the room a bit tired and in need of TLC. Rooms are very small - but that’s manhattan for you. Overall would recommend for a place to sleep and a nice vibe from the hotel if you don’t need much else!",
      "date": null,
      "userInfo": "9 reviews",
      "photos": []
    },
    {
      "user": "Jillian O'Connor",
      "rating": "5/5",
      "text": "The staff here are incredibly friendly and go out of their way to make sure you feel welcome! It was our first time here, and our room was upgraded and the manager gave us two free drinks as well. The rooms were exactly as pictured and very clean. Perfect for two people. Location was great as well. Would definitely stay here again!",
      "date": null,
      "userInfo": "6 reviews",
      "photos": []
    },
    {
      "user": "Jaycee Ewing",
      "rating": "5/5",
      "text": "Came here for a one night stay and it was such a lovely experience. Bridgette and all the other staff members we engaged with were so nice. The location is in great spot and you have two bars, a restaurant, and two coffee/pastries options to choose from at the hotel. The rooms are on the smaller side- but it’s exactly how it is portrayed online. They were perfect for two people and very modern and clean! We had a drink at the rooftop bar as well as the speakeasy downstairs and both were delish! Couldn’t recommend this spot more and I will continue to go back here if I’m ever in NYC again. The staff and the amenities were A++!",
      "date": null,
      "userInfo": "8 reviews · 10 photos",
      "photos": []
    },
    {
      "user": "Rafael Morales",
      "rating": "5/5",
      "text": "Stay at the hotel last week and the service was excellent. Shauna at the front the desk was super helpful and very welcoming. The rooms were great too, wish they were a tad bit bigger but definitely fine for my length of stay. Would highly recommend this place.",
      "date": null,
      "userInfo": "2 reviews",
      "photos": []
    },
    {
      "user": "Sonya Alvarez",
      "rating": "2/5",
      "text": "ADDITION:\nChecked out of the hotel - no charges mentioned at the desk - come to find out there were facility charges that the checkout didn't let me know about. Called and got the receipt emailed to me but this is hotel admin 101! I shouldn't have needed to call for anything past my stay!\n\nALSO I emailed the hotel to ask what would my next stay would look like (based on their speedy response to my last post) NO RESPONSE.. it's nice and all that you have someone checking Google Reviews to appease unhappy clients, but don't play your customers for fools - if you're going to offer to make something right, then do it.\n\nOLD REVIEW:\nDon’t know how hotels like this get away with the shoe box sized rooms and the insane cost per night. I’m a native NYer come back here for work regularly and have stayed at many boutique hotels. This is by far the worst for its cost. The room is a literal closet, Lumpy pillows (seriously?? How hard is that to get right?), even though it’s small they have made it worse through their design choices. You lose space because of the massive garbage cans (there are two; 1 for recyclables - why aren’t these smaller where they could fit under the sink? Or beside the toilet?)\nPeople say you pay for location but honestly, if you’re staying in Manhattan ANYWHERE is close to ANYTHING! There is no need for this small a room. And then the WiFi (!!!) can’t open a single website on this WiFi. COME ON. Terrible.\n\nOh had to come back to add MOTHS!! There are moths in my room…🙄😩🤦‍♀️\n\nAnother addition. Staff I’m sure is generally good, I didn’t have a specifically notable experience except I had a friend coming to meet me and asked to leave a key at the desk which they said they couldn’t do but said they’d add him to the reservation and he’d just need to show ID to get the key but later that evening I got a call from my friend saying I needed to call the front desk because they wouldn’t give him a key. The person at the front desk said that I needed to add my friend to the reservation and I explained that I had at check in but somehow that wasn’t done. It’s not a big deal but that’s why my staff review isn’t higher. Other than that folks are friendly. Haven’t needed them for anything else.",
      "date": null,
      "userInfo": "Local Guide · 7 reviews · 2 photos",
      "photos": []
    },
    {
      "user": "Courtney Schmidtberger",
      "rating": "5/5",
      "text": "Stayed here for a long weekend with a friend. It was a lovely hotel with character and charm. Loved the on-site restaurant, coffee shop, lounge and rooftop. Staff were always friendly. Good location. Would definitely recommend.",
      "date": null,
      "userInfo": "30 reviews",
      "photos": []
    },
    {
      "user": "Brandon Dellucky",
      "rating": "5/5",
      "text": "I’ve stayed here many times over the years and I love it. Perfect location for my interests, comfy rooms, and great staff. In particular, Nelson is always ready to help with my bags, storing items before and after checkout, and offering water and umbrellas when needed. He’s such a cheerful and positive presence and a great representation of the rest of the Walker staff!",
      "date": null,
      "userInfo": "7 reviews",
      "photos": []
    },
    {
      "user": "David Irthum",
      "rating": "5/5",
      "text": "I was impressed with the check-in with their friendly but professional personality. They explained how use your room car to use to go up to your or roof top. They gave a map of  how locate the numerous art galleries nearby The check -in staff told of what services were available.",
      "date": null,
      "userInfo": "Local Guide · 278 reviews · 381 photos",
      "photos": [
        "https://lh5.googleusercontent.com/p/AF1QipOb18CAxCs0cke_bw8xNxkzUBBgmYLq1c8qN58S=w300-h450-p-k-no",
        "https://lh5.googleusercontent.com/p/AF1QipMO6aM66zUud2q5dYzuOPO9FfQR9aDRVess8BbY=w300-h450-p-k-no"
      ]
    },
    {
      "user": "Erika B.",
      "rating": "2/5",
      "text": "Location and service were fine. Room was awful. It was insanely small, but that was expected. No fridge, our safe was broken so we couldn’t even use that, and we couldn’t sleep at night because it sounded like the window was open (even though it wasn’t). We heard absolutely everything, including the extremely loud trucks and construction in the morning. Some noise is obviously normal and expected, but it really sounded like the window was completely open. Maybe it was broken? Who knows. Either way, I would not stay here again and would not recommend to anyone wanting to sleep at night.",
      "date": null,
      "userInfo": "5 reviews · 2 photos",
      "photos": []
    },
    {
      "user": "Richard Kahn",
      "rating": "3/5",
      "text": "Pros:\n- Great location!\n- Rooms are clean and nice feeling.\n\nCons:\n- This is more like a pod hotel than other places I've stayed at, including in downtown Manhattan. Bed takes up the bulk of the room, very little room to stand.\n- They stick you with one of those annoying scammy mandatory resort fees at check-out for $40 a night. This should be divulged at booking, or at the very latest, at check-in.\n- The gym, while aesthetically appealing, is basically useless. Only has light weights, some strange cardio equipment, and a hard to use cable machine.",
      "date": null,
      "userInfo": "5 reviews",
      "photos": []
    },
    {
      "user": "Steven Anthony",
      "rating": "2/5",
      "text": "Great location. On check in, my door lock was broken and couldn’t close my door. I asked for someone to come fix it and nobody showed up within 1 hour so I tampered with the door and closed it myself. I was only visiting nyc for 2 days so I didn't want to waste my time waiting for someone to fix my door.\n\nFigured out at 4am that the window was also broken as it was stuck open so all the construction noise from outside was entering the room.\n\nTerrible room, mid service. Wouldn’t stay here again.",
      "date": null,
      "userInfo": "Local Guide · 81 reviews · 199 photos",
      "photos": []
    },
    {
      "user": "R B",
      "rating": "3/5",
      "text": "I stayed here in May 2024 and I can say I will not stay here again or recommend it to friends. The rooms are tiny, even by NYC standards, the layout of the hotel is odd, no ramp for luggage, front desk down a set of stairs, small dark elevators…It’s definitely overpriced for what you pay. No coffee, no mini bar, no breakfast, no fridge or microwave or room service. It feels that the priority here is the cafe and restaurant downstairs. It’s not really oriented towards the guest experience or comfort for travelers. The pluses I would say are the showers are very good, the rooms are very clean, bed comfortable, great bedding and lighting and outlets that are convenient. However, it’s overpriced and there are better valued accommodations in the city.",
      "date": null,
      "userInfo": "6 reviews",
      "photos": []
    },
    {
      "user": "Blondie 205",
      "rating": "5/5",
      "text": "Went here for a solo trip into NYC for MDW. Honestly the best spot and reasonable for being in Tribeca. You are just minutes away from Chinatown and Little Italy not to mention the Brooklyn Bridge. Tons of great restaurants and the nightlife at the hotel is awesome.\n\nThe room that I got was a bit small but honestly it was fine for me as I just slept there. I spent most of my time outside.\n\nCouple of things to mention: the rooms are not sound proof so if you're a light sleeper that might be an issue. Also there are fees that are additionally paid at the hotel. The bed was arranged looking out the window. It didn't look like the window was darkened on the outside so people could look in so I kept it shut.\n\nGreat find will be back!",
      "date": null,
      "userInfo": "Local Guide · 132 reviews · 652 photos",
      "photos": [
        "https://lh5.googleusercontent.com/p/AF1QipNeAqyZmeOzqBTO8qOmXzwgFjiJs8zAFYLbECkU=w300-h225-p-k-no",
        "https://lh5.googleusercontent.com/p/AF1QipM4H63i3Zg3aBh8c8MLCPtRcLzpGSdjjaELa-uG=w300-h225-p-k-no",
        "https://lh5.googleusercontent.com/p/AF1QipPtxjoA-pqxeMJoc5mWwBaQktL3-Q9krYZ544Te=w300-h225-p-k-no",
        "https://lh5.googleusercontent.com/p/AF1QipPg3K8PCuzvmdfFQ5ADrOGobwvakALbwce4HpbS=w300-h225-p-k-no"
      ]
    },
    {
      "user": "Whatsa MyName",
      "rating": "4/5",
      "text": "I'm going to give you the good and the bad.\nThere are a lot of good things about the Walker Tribeca, which you will see in the pictures. The bad things, though, while few, are enough of a deal breaker that it will keep me from going back, and it's mainly the height of things. The bed's platform is so high off the ground that it needs a step ( but doesn't have one) and to get up in the middle of the night is tricky. If you want to look out the windows, you have 3 options: climb up onto the bed and walk across it, roll across it, or climb up and try to walk the narrow ledge at the end of the bed, which can pretty much only be done by a gymnast on a balance beam. And to get up in the middle of the night when there are two of you and you are the person on the side by the window is a near-death experience. The second issue is that they positioned the handheld shower so high that even on my tiptoes, I could not reach it! And while I understand why a hotel would not put the room number on their room key (plus it's black so you wouldn't see it anyway), it is tricky when you can't easily remember your room number!\nThe hotel itself is beautifully appointed yet comfortable, not pretentious. EVERY SINGLE STAFF PERSON WAS NICE! They were all friendly and kind. There are multiple public spaces within the hotel:  a seating area near the cafe, an on-site restaurant, a lower area lounge by re reception area, and a beautiful  rooftop bar/cafe with amazing views. The hotel is near multiple subway lines and Canal Street, and is right around the corner from the Banksy Museum, as well as within walking distance of both Chinatown and Little Italy. I'd say if you have gymnastic skills to get onto the bed safely, then this hotel is for you.",
      "date": null,
      "userInfo": "88 reviews · 140 photos",
      "photos": [
        "https://lh5.googleusercontent.com/p/AF1QipOAPTwRnYs7LKmmzYyt7UvWZYsj0_-ICERPd8JT=w300-h225-p-k-no",
        "https://lh5.googleusercontent.com/p/AF1QipPsG13Fshii-eYsIAnpDSAydCzMpnnm-FETz2gQ=w300-h225-p-k-no",
        "https://lh5.googleusercontent.com/p/AF1QipNRfveRDRI_FgGnX1Lpp4RURFS2UsvQ4uz_tspC=w300-h225-p-k-no",
        "https://lh5.googleusercontent.com/p/AF1QipMNNOfo2LWp8m8IyDXgy4Il-FOGL1LZQWEbiIZD=w300-h225-p-k-no"
      ]
    },
    {
      "user": "Aimée Jordan",
      "rating": "3/5",
      "text": "No ramp for luggage and no one helps you get up to the front desk which I thought was odd. There are a number of steps to get inside and then you have to go downstairs to check in. The elevator and hallways are small and narrow but the rooms are TINY. There is no fridge in the room and more than one person could not stay in a room despite there being a queen size bed. The hotel was clean, centrally located, and quaint, but I wouldn't stay again because you can barely walk around the bed.",
      "date": null,
      "userInfo": "Local Guide · 125 reviews · 1,588 photos",
      "photos": []
    },
    {
      "user": "Lutz Zimmermann",
      "rating": "5/5",
      "text": "Really friendly staff everyone, great coffee and breakfast. Unique experience in their underground bar. Nice room. Good gym. Would come again! 🥰",
      "date": null,
      "userInfo": "22 reviews · 1 photo",
      "photos": []
    },
    {
      "user": "ozz",
      "rating": "2/5",
      "text": "Both elevators were down, the whole hotel had to use the staff elevator. Incredibly slow\nNo coffee maker inside rooms. The “do not disturb” light didn’t work, so was woke by endless knocking of housekeeping every AM.\nTiny, I mean tiny rooks. Price is low but now I know why!",
      "date": null,
      "userInfo": "Local Guide · 46 reviews · 35 photos",
      "photos": []
    },
    {
      "user": "Angela Ho",
      "rating": "2/5",
      "text": "I recently stayed at the Walker Hotel in Tribeca and was disappointed by my experience. Despite the hotel's charming decor and convenient location, several issues significantly marred our stay.\n\nFirstly, we were charged an extra $172.1 without any prior notification or invoice. I tried to contact the hotel via email to resolve the issue, but I received no response. The lack of communication and transparency was frustrating and unprofessional.\n\nSecondly, the overall service during our stay was subpar. The staff seemed disinterested and were not helpful when we needed assistance. This level of service is unacceptable, especially given the additional charges we incurred.\n\nIn summary, while the Walker Hotel in Tribeca has potential, the poor communication and service we experienced overshadowed the positive aspects of our stay. I hope the management addresses these issues to prevent future guests from having a similar experience.",
      "date": null,
      "userInfo": "1 review",
      "photos": []
    },
    {
      "user": "Talia Paquet",
      "rating": "5/5",
      "text": "I visit the city on a monthly basis and this is the ONLY place I would ever stay in NYC. It is honestly a second home for me. From beginning to end, the Walker Tribeca offers you a flawless stay. Perfect location. Best area. The bars and restaurants in this hotel are perfect - shoutout to Francisco &Collin at Saint Tuesdays and Pablo & Cesar at the Walker Rooftop Bar! At the front desk, everyone is super friendly, welcoming & helpful - a special thank you to Nelson, Randon & Edwin!\n\nThe best hotel in the city.",
      "date": null,
      "userInfo": "26 reviews",
      "photos": []
    },
    {
      "user": "Mulan Mu",
      "rating": "2/5",
      "text": "Room 219 is extremely noisy --- DO NOT STAY. If you stay, make sure you stay on a higher floor and/or not on the same corner as 219.\n\nThere was noise from both inside and outside of the building.\n\nNoise from outside of the building: the sound of trucks backing up, loading, and unloading is non-stop throughout the night. The sound of people chatting, laughing, yelling, and shouting right outside of the building was also constant. For a room this close to the street, this hotel should really invest in soundproofing windows.\n\nNoise from inside of the building: the room is right next to the service elevator. The noise of maybe boxes or trolleys being moved is not as constant, but it's disturbing, adding on top of the noise from outside.\n\nI couldn't sleep both nights when I was there. I would warn anyone who's staying to be aware of the room the hotel staff assign you to stay.",
      "date": null,
      "userInfo": "2 reviews",
      "photos": []
    },
    {
      "user": "Anne Hedekin",
      "rating": "5/5",
      "text": "My daughter and I had a great time at the Walker. Yes, rooms are small but that is what is expected in TriBeCa/soho and from a fun boutique hotel.  We booked through NYU and thought we were getting a deal but looks like we overpaid a bit-my only regret there but we had a great stay and love the space.",
      "date": null,
      "userInfo": "4 reviews",
      "photos": []
    },
    {
      "user": "Lisa Lucas",
      "rating": "3/5",
      "text": "Very beautiful hotel, except the size of the room my wife and I rented for just a few hours was very small and very expensive for us, charged us $354.00.They didn't offer a bereavement fare nor a complimentary breakfast. None of our money back when we checked in around 4 AM Wed morning and checked out before the 10 AM check out time..",
      "date": null,
      "userInfo": "Local Guide · 16 reviews",
      "photos": []
    },
    {
      "user": "Lloyd van den Ende",
      "rating": "4/5",
      "text": "We are very happy to have booked this hotel. It has a convenient location near the Canal St. Metro station and SoHo. Lots of different breakfast, lunch and dinner options within walking distance.\n\nThe hotel appears very modern and luxurious. Downside is that the entrance from the street does not accommodate large suitcases, since you immediately stumble upon stairs. Reception of the hotel is also on the Lower Level. Check in was quick and without any hassle. Note that $500 deposit is required (via creditcard).\n\nThe rooms are not big, but we stayed here for five nights and had enough room to store everything. It's a modern room with a lot of smart buttons for the lighting and blinds. Air Conditioning is also very good, just as the smart tv. Casting your phone actually worked in our room. WiFi is also pretty fine! We do missed a mini fridge and our safe did not work. Even after asking the reception twice to fix it. There were even more minor observations that made me decide to give the review four stars instead of five. The bedframe (or how you can describe it), was broken and made noise when moving. One shelf in the closet had also fallen down and nobody seemed to have fixed it.\n\nAltogether we were happy to have chosen this hotel as the bed was comfortable and the location of the hotel was great.",
      "date": null,
      "userInfo": "Local Guide · 324 reviews · 993 photos",
      "photos": [
        "https://lh5.googleusercontent.com/p/AF1QipNLNEDX-Ye7A2AqRTiqR9A7FD78rzkLhhptaDBk=w300-h225-p-k-no",
        "https://lh5.googleusercontent.com/p/AF1QipN0pwUqLL-m_9LxqZMK5gqy5JUnFdCCSIFIQu2I=w300-h225-p-k-no",
        "https://lh5.googleusercontent.com/p/AF1QipOM70JAPAvPabuu-tj3mYZHlRiD1nHnu2a4w76Y=w300-h225-p-k-no",
        "https://lh5.googleusercontent.com/p/AF1QipNxh77Y0foiwCLYlf-zmKU6xR44nxNKkIO0RWSV=w300-h225-p-k-no"
      ]
    },
    {
      "user": "Saint Tisdale",
      "rating": "5/5",
      "text": "The Walker Hotel Tribeca is a hidden gem in the heart of New York City, offering an unparalleled boutique experience. From the moment you step into the stylish lobby, you're greeted by a warm and welcoming ambiance that perfectly blends modern sophistication with historic charm.\n\nOne of the standout features of the Walker Hotel Tribeca is its exceptional service. The staff is incredibly attentive, friendly, and eager to assist with any needs or requests. Whether you're looking for dining recommendations, directions to nearby attractions, or simply a friendly chat, the team goes above and beyond to make you feel at home.\n\nOverall, the Walker Hotel Tribeca is an exceptional choice for travelers seeking a unique and memorable stay in New York City. With its stylish design, top-notch service, and unbeatable location, it truly stands out as one of the city's finest boutique hotels.",
      "date": null,
      "userInfo": "3 reviews",
      "photos": []
    },
    {
      "user": "Ryan Rios",
      "rating": "1/5",
      "text": "I was traveling with family and friends, and coordinated the group to stay at the hotel, with three reservations. The night prior to arriving in NYC, I called to see if we could have access to one room to drop our luggage and freshen up from the flights. The person over the phone said just to show up and there will be an option available. I would've preferred some assurance, or a plan to avoid the convo again when checking in. When we arrived, sure enough I had to give the whole spiel, and was told that they didn't say that, and they meant I could store them in a closet. I've been to many hotels and understand what's available and how it works. Anyways, we got a room after my lecture. The room had a pubic hair on the pillow, a large dip in the ground upon entry, the door threshold cracked had to SLAM the door to close it, toothpaste or something on the bathroom light switch. Just not comfortable and not what a room should be like. I figured I would just accept it and after the AC not working that night, knew I couldn't spend more nights there. The night desk agent was helpful and switched my room, and when going into that one, there was another pubic hair and stains on the vanity counter, in addition to the issues of leaking showers. There are definitely structural issues and water issues happening in these rooms.\n\nOne night, I was walking to show my sister Saint Tuesday. The young male host attendant  spoke to me so nasty and sarcastic, I was embarrassed and angry about it. I chose to accept it, but now wish I would have given it back to him. Completely unprofessional, rude, and uncalled for. I think he forgot who the host was and who the guest was. When I told the same night agent, she apologized and offered a late check out. Why the hell would I want to stay in this place longer? Not an acceptable resolution. Very disappointed and will never stay again, despite many trips each year to the city. The pictures definitely paint a different experience.",
      "date": null,
      "userInfo": "2 reviews · 4 photos",
      "photos": [
        "https://lh5.googleusercontent.com/p/AF1QipMz2aCBq2TIlJoXIBTtJaHCC2dgxUxCqoJnqeN1=w300-h225-p-k-no",
        "https://lh5.googleusercontent.com/p/AF1QipNJz2geXVwcVCGtxwm-AQOeZPcG-DfbvZB9IdEH=w300-h225-p-k-no",
        "https://lh5.googleusercontent.com/p/AF1QipPy0QUQxhqSklAVZdpAi_PJkPTtdmoO8pA98eRX=w300-h225-p-k-no",
        "https://lh5.googleusercontent.com/p/AF1QipOCyM-rEQnF3rIfdOcb_Xnnqr_nHWsIppIplR86=w300-h225-p-k-no"
      ]
    },
    {
      "user": "Kae Yen W",
      "rating": "3/5",
      "text": "The rooms are so absurdly tiny it’s kinda funny. Especially for the price. King bed is up against three walls so you can only access it from one side. Terrible sound proofing from the street and inside. You can easily hear other people’s conversations and when they use the bathroom, which is also very tiny.\n\nNicely decorated though. And the bed was comfortable. The staff were great and my room was serviced every day.",
      "date": null,
      "userInfo": "20 reviews · 8 photos",
      "photos": [
        "https://lh5.googleusercontent.com/p/AF1QipPzig2QvHSbhbY-djTj7BEw5qahFl8vQw7zO14K=w600-h450-p-k-no"
      ]
    },
    {
      "user": "Marco Milano",
      "rating": "1/5",
      "text": "I checked in and have been asked for a caution of 500 USD (to be frozen on the credit card) to cover eventual damage, or for expenditure I will have like drinks. As I checked out, they told me I have around 70 USD costs for some stuff I ate, and 55 USD for Internet costs (already strange). I accepted and paid, asked for a detailed invoice list per email. As I was gone and received the email, suddenly the costs were of 457 USD and taken from my credit card. As I asked explanation they told me, it is for the daily use of internet (I just slept in that hotel).  Beside the craziness of the amount, and the dishonest way it has been charged on my credit card, I showed them on my reservation that in any case all supplementaries  and taxes were paid with the booking.  They didn’t care, I had to fly back home and never saw my money again.",
      "date": null,
      "userInfo": "8 reviews · 6 photos",
      "photos": []
    },
    {
      "user": "Gabriel Lesnick",
      "rating": "1/5",
      "text": "rooms are small for NY and poorly maintained. hotel is not actually in tribeca. there are so many better hotels, I don't know why anyone would ever willingly stay here",
      "date": null,
      "userInfo": "Local Guide · 51 reviews",
      "photos": []
    },
    {
      "user": "Jolie",
      "rating": "3/5",
      "text": "Pros: The rooms are well designed with a comfortable bed and nice sheets. Shower is great and the auto blinds are clutch. The location is also really great and I love how there’s a coffee shop downstairs.\n\nCons: The rooms are very small, which means you’ll lack basic amenities like a kettle or coffee maker. You can request them, but it may not be in stock and… this is all assuming they remember your request. 80% of the time my requests go into a void and I would have to follow up repeatedly and they may not get back to me until a day or two later. I simply cannot trust the staff when they say they will handle something or call me later with an update.\n\nThe cleaning staff here also don’t really clean, they’ll change towels and sheets, but won’t sweep up the floors or even wipe the surface. Restocking stuff like tissues is also a problem… For a 4 star hotel and the price, I would’ve expected better service in both the staff and cleaning.\n\nLastly… the gym is OK. It’s aesthetically pleasing, but not really functional.",
      "date": null,
      "userInfo": "10 reviews · 3 photos",
      "photos": []
    },
    {
      "user": "Myra Rivers",
      "rating": "3/5",
      "text": "The room was the size of a closet, no space to put anything or even walk. Extremely cramped. Only had access to the bed from one side. The view is of another building across the street. The location was more of Chinatown than TriBeCa. It’s located right off Canal St in Chinatown. Shower was so tiny, good luck if you’re over 6 feet, or if you’re heavier than the average person. A lot of bumping into things! Bumping into the bed, bumping into the sink, bumping into the toilet,etc. Just way too tiny for $250/night. Not a reasonable price. Also tacked on some fees. For one single night they held $450 on my credit card. That included the $125/day refundable fee. The staff were great, the hotel was clean. But it was just way too cramped & overpriced for me & my guest. Wouldn’t stay here again or recommend if you want room to breathe.",
      "date": null,
      "userInfo": "Local Guide · 31 reviews · 22 photos",
      "photos": []
    },
    {
      "user": "Mark Wilson",
      "rating": "5/5",
      "text": "I was invited here on a sex date. The rooms are small but smart; the closeness of the walls and furniture provide lots of sturdy push-off points for different positions and angles. Staff made me feel welcome and unashamed as I left early. The croissant stand loved hearing me sing the rooms praises. Their croissant and coffee are exceptional and very different. I've been back since just for these, and plan to meet my date there again in 24.",
      "date": null,
      "userInfo": "Local Guide · 85 reviews · 37 photos",
      "photos": []
    },
    {
      "user": "S G",
      "rating": "5/5",
      "text": "Staff is amazing it’s always a pleasure staying here they definitely go above and beyond to accommodate you best staff ever  I also love how clean the rooms are would recommend this hotel to everyone",
      "date": null,
      "userInfo": "7 reviews · 1 photo",
      "photos": []
    },
    {
      "user": "Truc Duong",
      "rating": "1/5",
      "text": "we booked the trip far in advance and paid all needed fees when we arrived they placed a $400 hold on our credit card for “incidentals”. after we left we were charged $107 for wifi(on the website it said free), water, gym, and 20% off the restaurant we did not even go to. the hotel rooms are very small and cramped as well. very noisy outside we could not even sleep at night",
      "date": null,
      "userInfo": "2 reviews",
      "photos": []
    },
    {
      "user": "Leigh Tolboe",
      "rating": "5/5",
      "text": "Last minute booking for one night - staff was all very helpful, especially Nelson. Kind and willing to help out. I requested a couple things for the room and the service was quick and got what we needed right away.  The room is small but I actually loved it.  It felt super cozy. There were 2 of us (my daughter and me) so might not be an ideal set up for others.  The location is great if you’re wanting to stay downtown.  The gym was small, but clean and had what I needed.  We didn’t get to enjoy the public spaces or coffee shop /restaurant bc it was such a short stay, but looked great.  Will definitely book again if staying downtown!",
      "date": null,
      "userInfo": "4 reviews",
      "photos": []
    },
    {
      "user": "Pallavee Panchal",
      "rating": "5/5",
      "text": "Had an amazing time at the Walker Tribeca. The location was incredible and in the heart of everything we wanted to do. The staff were responsive, kind and helpful. Our room had the most beautiful view of the entire downtown. We loved the blue bottle coffee, the Mostrador cafe coffee and had such a great time at Saint Tuesday’s. Would recommend to anyone looking to stay in Manhattan. Everything you could want is within a 10-minute walking distance - shopping, food, cute cafes and entertainment!",
      "date": null,
      "userInfo": "6 reviews",
      "photos": []
    },
    {
      "user": "Allison Williams",
      "rating": "2/5",
      "text": "This hotel needs a serious tune up- both in service as well as condition of the rooms.\nThere is no real lobby - the entrance leads to a restaurant check in and a shared space with Blue Bottle coffee. The shared space is nice looking. l have no idea if it is filled with hotel guests or blue bottle customers. There is no drinks service in the lobby and both the roof bar and restaurant bar are closed several days a week. The whole place feels like some rooms above a whole bunch of leased spaces for other businesses.\n\nBiggest issues for me is there is no one to greet you at the entrance, the “lobby” is in a sub-basement. Getting in or out of a car with packages is a juggle on a busy street up and down several flights of stairs with no help.\n\nThe service is seriously disappointing. Its earnest but utterly hapless, I get the feel that most people have never worked in hospitality before. They have no idea what to say or do when confronted with something as simple as a package delivery or pickup- this is not a business hotel at all.\n\nThe base rooms are very tiny, I was staying in the corner which is somewhat more spacious. But the surfaces are seriously worn- cigarette holes in upholstery, very visible peeling paint etc.\n\nIf you are looking for prime location and a place to sleep this might be a good fit, if you are looking for a “hotel” with a modicum of service and pleasure look elsewhere.",
      "date": null,
      "userInfo": "Local Guide · 12 reviews · 2 photos",
      "photos": []
    },
    {
      "user": "Cameron Vidrine",
      "rating": "4/5",
      "text": "I’m giving 4 stars because the room was so tiny it didn’t make me mad but rather laugh. Staff is great and there is an amazing speakeasy. Bed was comfortable. Be aware that my partner and I couldn’t both leisurely hang AT ALL in the room, but that’s okay. We weren’t here to stay and lounge in our hotel room. It was solely to sleep and shower — that’s it.",
      "date": null,
      "userInfo": "Local Guide · 39 reviews",
      "photos": []
    },
    {
      "user": "Cesar Ramos",
      "rating": "5/5",
      "text": "The hotel is between Soho and Tribeca, near the Canal subway station. Edwin and Nelson at the front desk are outstanding in being efficient, friendly, helpful, and polite; they speak English and Spanish. The rooms are according to the concept of the hotel, of course. Very functional and well illuminated, despite being small; impeccable cleanliness. They have a cafe with great bread and espresso, a small restaurant with good breakfasts, and a Blue Bottle cafe within the complex. I would recommend this hotel without hesitation for couples who are going to the theater or walking for a few days in NYC.",
      "date": null,
      "userInfo": "24 reviews · 3 photos",
      "photos": []
    },
    {
      "user": "Colin van den Bosch",
      "rating": "5/5",
      "text": "Nice hotel in a great location - downtown Manhattan. They serve the best coffee in the coffee shop in the lobby. I recommend.",
      "date": null,
      "userInfo": "6 reviews",
      "photos": []
    },
    {
      "user": "Rijo Mathew",
      "rating": "5/5",
      "text": "What a great location for a hotel! Would highly recommend to friends and family visiting from out of town or even just for a staycation. Cozy, functional room with incredible views and access to top-notch food and activities. The staff were always so helpful and generous with their time. Special shout out to the security guard, who always went above and beyond! Loved the entertainment at Saint Tuesdays and it was perfect being able to just go downstairs for dinner, and then for drinks. With Au Cheval next door, the location couldn’t be better. Would definitely come back!",
      "date": null,
      "userInfo": "4 reviews",
      "photos": []
    },
    {
      "user": "Kristýna Hojgrová",
      "rating": "5/5",
      "text": "It was perfect! Big thanks to Nelson from the hotel staff, he was really helpful.",
      "date": null,
      "userInfo": "5 reviews · 1 photo",
      "photos": []
    },
    {
      "user": "Bridget Porich",
      "rating": "3/5",
      "text": "Smallest hotel room I’ve ever experienced. Surprise “facilities fee” gets charged without any warning - $35 per day. Wish we booked somewhere else for the price it ended up coming to. Don’t be fooled by the nice photos. It’s claustrophobic and better off looking elsewhere",
      "date": null,
      "userInfo": "25 reviews",
      "photos": []
    },
    {
      "user": "Rola Al Sharif",
      "rating": "5/5",
      "text": "the room was tiny, had no coffee station! but the location and the service were amazing... check the bars at the hotel and they are awesome...",
      "date": null,
      "userInfo": "Local Guide · 53 reviews · 79 photos",
      "photos": [
        "https://lh5.googleusercontent.com/p/AF1QipPUbD242XVEkDsrejGsNDDrW2JGmP4m_dkLT0Wn=w600-h450-p-k-no"
      ]
    },
    {
      "user": "Chimere Fullilove",
      "rating": "2/5",
      "text": "I Really don’t know where to start should I start off with the guest service from host who didn’t acknowledge us not even once then when ask a question about parking or anything else around there no answer but that’s not my concern my main concern was I had a guest who was with me took a shower when I went in behind them shower was stopped up it really freaked me out that someone else dirt touch my feet in the shower water filled up then same thing with the sink which is outside of the bathroom the sink was stopped up as well so I couldn’t brush my teeth for a while waiting for water to go down then went to sleep after being tired but whole time the smell of the pillows stink so bad I don’t know if it’s breath smell from others but I do know the hotel needs work done in room and a thorough cleaning new pillows very unpleasant stay on top of rooms being so tiny you can barely move in them not worth the money at all.",
      "date": null,
      "userInfo": "3 reviews · 15 photos",
      "photos": []
    },
    {
      "user": "Sophie Leamon",
      "rating": "1/5",
      "text": "the photos online are cute and charming, but the rooms themselves are comically small, claustrophobic, and poorly designed. especially for the price, i was surprised to see an entire shelf missing under the bed, veneer peeling, holes in the walls and tiles, the tv and other hangings off center and hanging weirdly, and the toilet paper holder falling off the wall. I also booked directly through the hotel website and paid for parking and late check-out but they had no record of it until searching for 20 min. after double checking that we had the room until 2 pm and paying for the late check-out, we were locked out of the room anyway. would recommend a different hotel or airbnb!",
      "date": null,
      "userInfo": "8 reviews · 6 photos",
      "photos": []
    },
    {
      "user": "April W.",
      "rating": "5/5",
      "text": "This review is for Nelson, the nicest porter who helped me get my super heavy bags down a few stairs and into my uber. Uber driver didn’t lift a finger so Nelson helped me hoist the bags in the trunk. Very knightly and kind of him!",
      "date": null,
      "userInfo": "11 reviews",
      "photos": []
    },
    {
      "user": "Shawn Rogers",
      "rating": "3/5",
      "text": "For half the price of a normal NYC room you get what you pay for, 1/3 of a room. I ended up in one of their smaller rooms basically a walk in closet, it didn’t even have a chair. The open space in the room was 5 x 5 foot, standing room only. The bed was comfortable but raised off the floor so high it wasn’t a spot to sit, plus the TV is behind you. A good spot for a college aged kid on a NY trip but not a place I would ever stay again. Spend $100 more and get a regular hotel room.",
      "date": null,
      "userInfo": "4 reviews",
      "photos": []
    },
    {
      "user": "Szandra Léner",
      "rating": "5/5",
      "text": "The hotel is at a good location, we could walk to almost everywhere, and the subway station is also very close.\nThe room is small, but very cozy, comfortable and clean. We had a room on the top floor and the view was breathtaking.\nAll the staff we have met were lovely and helpful.\nThe only negative thing is that the restaurant is not open every day and feels very fancy (to only have a drink at the end of the day).",
      "date": null,
      "userInfo": "4 reviews · 1 photo",
      "photos": []
    },
    {
      "user": "Ed Chubin",
      "rating": "4/5",
      "text": "Smallest room i ever had, but acceptable. I am under 5'6\" and was just able to fit for the bed which was very restful and comfortable. Great location between Chinatown and Little Italy. Room was clean, shower good. Raised toilet. I was not aware of add on daily charge around 35.",
      "date": null,
      "userInfo": "Local Guide · 702 reviews · 703 photos",
      "photos": [
        "https://lh5.googleusercontent.com/p/AF1QipNDx4YtYLUbMoX0NTi3JXpmdROnIxfhZdeCJVeJ=w600-h450-p-k-no"
      ]
    },
    {
      "user": "moto yosh",
      "rating": "3/5",
      "text": "Room was absurdly small, must be hard for housekeeping. Front desk offered no help in getting a taxi, we had Three suitcases and a large artwork portfolio. We dragged them out to curb while I went two blocks to retrieve a taxi. Front desk had a attitude upon checking out, kept 200 dollars of a 500 dollar “incidental charge.\nI work in Japan at a four star hotel, I will never stay at this TriBeCa snotty hotel again !!!\nI grew up in this neighborhood, and sadly my neighborhood has been ruined by businesses like this hotel, horrendous example of new TriBeCa attitude.\nNEVER AGAIN !!!!!\nOnly one person offered us help, a Spanish man( never got his name).\nRemember hospitality is our business, and should be the first directive ! !!",
      "date": null,
      "userInfo": "2 reviews",
      "photos": []
    },
    {
      "user": "Dolly Parks",
      "rating": "5/5",
      "text": "Was part of the Bernadette Thompson nail team for another Fashion show during Fashion week on September 7, 2024. The work area was small to do nails, but everyone was professional and was about getting the job done.",
      "date": null,
      "userInfo": "Local Guide · 197 reviews · 157 photos",
      "photos": [
        "https://lh5.googleusercontent.com/p/AF1QipPmhkB4YTdwJJM9K6f_RJ3A_HdL8PkjtQ_W3m-B=w300-h225-p-k-no",
        "https://lh5.googleusercontent.com/p/AF1QipNkHR7WANKxrDa2CYw_Z0gB0DuMR8erOLD10DvO=w300-h225-p-k-no",
        "https://lh5.googleusercontent.com/p/AF1QipO2Couc0kKn0N0rW4pLibYxPr4HptFFRUWKiPM2=w300-h225-p-k-no",
        "https://lh5.googleusercontent.com/p/AF1QipOcMmt7oxzUswTtLkbwn58blbngxucdsCvDhM9y=w300-h225-p-k-no"
      ]
    },
    {
      "user": "Enno Krey",
      "rating": "4/5",
      "text": "Overall very comfortable hotel in a great location with some downsides. Few things to keep in mind before you book:\n\n- Rooms can be quite loud because of street noise, if you’re a light sleeper pack earplugs\n- WiFi is unfortunately very slow, it’s almost impossible to work from the hotel, I would expect fast & free internet in a 4-star hotel\n- Rooms are on the small side with no possibility to store luggage, as a result it can become crammed if you have a larger suitcase\n- Gym is basic, more of a „basement fitness room“, only light weights\n- They charge a facility fee of $34 per night for water and wifi on top which you have to pay separately in the hotel, if you travel for business it’s an additional hassle to expense this",
      "date": null,
      "userInfo": "9 reviews",
      "photos": []
    },
    {
      "user": "Aileen Allan",
      "rating": "4/5",
      "text": "Great location & lovely hotel however, we found the corner room noisy. Baring in the mind it’s NYC, there is traffic (we get it) however there appears to be little sound proofing in the windows (compared to another hotel we stayed at in Times sq at the start of our trip)\n\nThat being said, the rooms are elegant & very comfortable. We had a great sleep (using ear plugs) and the linens are super soft.\nThe Bluebottle coffee in the lobby is a great addition.\nWater pressure in the shower / loo is a little on the low side but again, I assume it’s an older building & this isn’t a huge issue, just flush twice ;)\n\nThe bellman was great when we left, helping us store & move our luggage.",
      "date": null,
      "userInfo": "Local Guide · 53 reviews · 86 photos",
      "photos": [
        "https://lh5.googleusercontent.com/p/AF1QipNRPgXvfm6D7cvKRFLPj_Uxq9vxz7GavgP9uGZh=w300-h225-p-k-no",
        "https://lh5.googleusercontent.com/p/AF1QipNk62YYBtxA9qoBFbD4Ocv2qVDMCnaDRFbN1tvV=w300-h225-p-k-no",
        "https://lh5.googleusercontent.com/p/AF1QipOTP-W6LBYVfEgBVBuhKpQ9cbQPgYl8zV2xMUMW=w300-h225-p-k-no",
        "https://lh5.googleusercontent.com/p/AF1QipOnw_dzCX2apQVHPAF0mJuTpxPGBLs7KgENr7ME=w300-h225-p-k-no"
      ]
    },
    {
      "user": "Maya Moore",
      "rating": "5/5",
      "text": "The rooms are on the smaller side but I enjoy a queen size bed and still felt like I had room to walk back and forth to the restroom. The view and location is what I enjoyed most. Plenty of places to walk to for coffee and it’s so conveniently located. But above all meeting Nelson, was the highlight of my stay. He is truly a beacon of joy and kindness. I’m disabled and I felt so seen, considered and cared for every time I interacted with him during my stay. He went above and beyond. I will be returning because of him and the location.",
      "date": null,
      "userInfo": "3 reviews",
      "photos": []
    },
    {
      "user": "Dylan H",
      "rating": "5/5",
      "text": "This was a great stay. We walked in and wend down the stairs where I felt as if I was entering a speak-easy. It was not but the beautiful wood work in the ceiling was cool.\n\nOur room overlooked a real janky sweatshop looking thing (I loved it). The rooftop views with “colorful letters” made the room special.\n\nWill definitely return!",
      "date": null,
      "userInfo": "Local Guide · 96 reviews · 12 photos",
      "photos": []
    },
    {
      "user": "Emma Rivera",
      "rating": "5/5",
      "text": "Location:\nPerfect location for getting around the city. I spent a lot of time in Tribeca which ended up being my favorite part. The hotel is also on a low traffic street so it was easy to get a nights rest.\n\nStaff:\nThe hotel is clean and staff is friendly and welcoming.\n\nRooms:\nSmaller than expected but was perfect for me as I was solo traveling. Not big enough however to fully open my checked bag in the room so I unpacked everything and put my luggage zipped up in a corner.",
      "date": null,
      "userInfo": "Local Guide · 49 reviews · 70 photos",
      "photos": []
    },
    {
      "user": "Emily Counsellor (PamperingPanda)",
      "rating": "5/5",
      "text": "This place is always very clean with friendly staff! We arrived early and not only did the receptionist accommodate us on a really busy graduation weekend, they gave us a handicap accessible room without us asking because they noticed my partner was using a visual cane. Also, amenities like room shades that are automatic and multiple areas where lights can be accessed really helped my partner manage getting around with more ease. I am so grateful to this hotel and its staff for being so kind, caring, and accessible!",
      "date": null,
      "userInfo": "Local Guide · 62 reviews · 22 photos",
      "photos": []
    },
    {
      "user": "Daisy Chung",
      "rating": "5/5",
      "text": "The room was compact for a king but well designed - staying on my own for three nights I found it secure, comfortable and clean. I booked directly via the hotel website which offered breakfast and 2pm checkout as part of the room rate. The breakfast is a coffee and non-savoury pastry from their Uruguayan restaurant - which was delicious for lunch. The late check out caused a little hassle because my room key wasn’t working when I returned around 1:30pm to get my luggage and I had to wait for someone to let me in with a managers key. Someone also called me at 1pm to remind me I needed to check out, so I think their systems haven’t noted which rooms are late check outs. If there is a way to get luggage in and out of the building without having to navigate some stairs I never found it. But I appreciated the clean design and perks and would stay again.",
      "date": null,
      "userInfo": "40 reviews · 9 photos",
      "photos": []
    },
    {
      "user": "Maxine F",
      "rating": "3/5",
      "text": "i was staying there for  1 night the reception are so helpful the room are nice small but modern design i like it. the bed is agains the wall no more space not really affordable for the kind of room and there wifi soooo bad i ddnt connect it cos my data is more strong than there wifi they have 2 bottle of water free.. and i was surprise next day they charge me 35$ and i ddnt know and i call them and they say its for 20% of hotel guess to the resto and for the water and wifi i ddnt even use there resto and they charge me even there wifi sooo slow..",
      "date": null,
      "userInfo": "20 reviews · 16 photos",
      "photos": []
    },
    {
      "user": "Rachel Lanskey",
      "rating": "4/5",
      "text": "The rooftop bar is great. Greg views. Heated alcoves.",
      "date": null,
      "userInfo": "Local Guide · 345 reviews · 19 photos",
      "photos": []
    },
    {
      "user": "Meghan",
      "rating": "5/5",
      "text": "Awesome hotel! The AC was working perfectly, it was a really hot weekend. The room is small but perfectly set up. The lights are great and everything was clean. Staff was really helpful and nice. The lobby is shared with a really nice coffee shop, it's calm with busy worker which make it a nice ambiance. Bed was comfortable, the pillow a bit too soft for me. The Walker St was pretty busy even at night, I would maybe ask for a higher room or maybe facing the Alley.\nIf you have suitcase, you can put them underneath the bed, there is closed compartments. Plenty of room in the closed for your clothes etc..",
      "date": null,
      "userInfo": "Local Guide · 130 reviews · 179 photos",
      "photos": [
        "https://lh5.googleusercontent.com/p/AF1QipNp00rmE57jyNZioOOqyKlttNicpRcq7O0RejLa=w300-h450-p-k-no",
        "https://lh5.googleusercontent.com/p/AF1QipMmo0PfyuMWeSipMRXpLw6Y6LImKooSLCkYLIRe=w300-h225-p-k-no",
        "https://lh5.googleusercontent.com/p/AF1QipPpbyr1tKiirjdByQjsexLEdi06Lo-2U5HJRFff=w300-h225-p-k-no"
      ]
    },
    {
      "user": "Madison",
      "rating": "1/5",
      "text": "i stayed here last week and was incredibly taken aback by how rude the manager Mia was. she greeted me with the nastiest look when i walked in tuesday morning and asked what her problem was and she had the nastiest reply back of just “nothing” and kept walking with her nasty grin right to her office.",
      "date": null,
      "userInfo": "7 reviews",
      "photos": []
    },
    {
      "user": "Nadine Wurster",
      "rating": "5/5",
      "text": "We stayed here for 4 nights during a short trip to NYC. Absolutely amazing staff, every single person we came across was so nice, couldn’t have felt more welcome, looked after and comfortable!\nThe location is fab, easy walking distance to both the East and Greenwich village and transport links. Great gateway also\nto access lower Manhattan. Our room was on the 10th floor with stunning views of the city, compact and neat, super clean and very detail oriented, modern and stylish! The coffee bar on the ground level in the building serves very good coffee!! Highly recommend!",
      "date": null,
      "userInfo": "Local Guide · 48 reviews · 16 photos",
      "photos": [
        "https://lh5.googleusercontent.com/p/AF1QipOTU0tH8nk9QQkWqolbQrJsfobT0iSp-a2d-VgK=w600-h450-p-k-no"
      ]
    },
    {
      "user": "K Vice",
      "rating": "2/5",
      "text": "My recent stay with the Walker Hotel Tribeca was less than desirable. Although the staff did their best to accommodate, this was an uncomfortable experience that only allowed so much for rest. I first had to switch rooms due to features that needed updating or care. Secondly, when I did switch rooms there was a heavy odor of marijuana and an eventual alarm that persisted for much of the rest of my stay. Please see below for additional details on what I encountered during my stay. Again, while the staff was kind the night of my arrival and during the day, this seems to be issues that need better management for optimal guest experiences. Unfortunately, I'm not sure that Walker Hotels will be a first choice for me again.",
      "date": null,
      "userInfo": "5 reviews",
      "photos": []
    },
    {
      "user": "Hannah Fallais",
      "rating": "2/5",
      "text": "I would not book this hotel again. Rooms like shoeboxes, limited service. Location is okay but canal street is not the nicest area in my opinion.",
      "date": null,
      "userInfo": "Local Guide · 131 reviews · 12 photos",
      "photos": []
    },
    {
      "user": "Dani Levin",
      "rating": "5/5",
      "text": "This place was very fun and great spot in New York! Great prices for New York for a clean and modern place. It’s pretty much a high end hostel (especially if you get the smallest room). The room is super small but has everything you need. The view is incredible and the mattress was so comfortable. The pillows could have been firmer. The shower was good too. Overall an excellent decision and I loved it. The area can get a bit sketchy at night so though during the day it was easy to use the subway at night I ended up Ubering back to the hotel. And the location is great but far from a lot of areas.\n\nMy only point with the hotel is the staff though very friendly and kind were not always knowing what to do. I asked multiple times if I can pay in cash and was told once I check out it won’t be a problem. I come to check out and they had already charged my card. I ended up having to wait 20 mins for them to figure it out. That’s one example of a few things that happened. Obviously won’t keep me from staying again but it could have been more seamless with a more professional staff.\n\nOtherwise, really enjoyed and will stay again! I love also stayed at Greenwich and I think I liked this one better (though Greenwich was great as well). Definitely recommend!",
      "date": null,
      "userInfo": "Local Guide · 248 reviews · 187 photos",
      "photos": [
        "https://lh5.googleusercontent.com/p/AF1QipMP66pkF5-dJBov51E1XFb4le0oE1QV62WklQxd=w300-h450-p-k-no",
        "https://lh5.googleusercontent.com/p/AF1QipOS0pbaHDPrYwtYPiMQAyIRL0YL-0NpX0jLHbZP=w300-h225-p-k-no",
        "https://lh5.googleusercontent.com/p/AF1QipOX-jOoJBm_hoSoqxhBczslVPqVSKLEYIDV7cgY=w300-h225-p-k-no"
      ]
    },
    {
      "user": "Jessica Laursoo",
      "rating": "5/5",
      "text": "I stayed here on a short trip I took in February and I could not recommend this place more. The staff was amazing and provided such great service. They were also all super friendly and willing to help. I also loved the convenience of being right on Broadway St. The rooms were the perfect size for me and I loved the view out of the window by my bed. Can't wait to stay here again.",
      "date": null,
      "userInfo": "5 reviews",
      "photos": []
    },
    {
      "user": "Janina McCormack",
      "rating": "5/5",
      "text": "I love visiting lower Manhattan and staying in TriBeCa. This small hotel was a great place to stay and enjoy a night in the heart of it all. Located on a quiet side street, I enjoyed the views of Broadway and Walker Street. The lobby and staff were all friendly and helpful. Gym has fun and unique equipment for a quick workout. Breakfast was excellent at the adjoining restaurant. I would definitely come back to enjoy a stay here.",
      "date": null,
      "userInfo": "Local Guide · 9 reviews · 12 photos",
      "photos": [
        "https://lh5.googleusercontent.com/p/AF1QipNvTQJV-fT0WjYljJsQRTiiB7l-zTMEYqQPUXmh=w300-h450-p-k-no",
        "https://lh5.googleusercontent.com/p/AF1QipNkT4u45qaisyltvG6zd7Zp7aH9uDxl-9YuK2gx=w300-h450-p-k-no"
      ]
    },
    {
      "user": "Karin John",
      "rating": "2/5",
      "text": "The location of the hotel is perfect. Nearby are buses and metro. Many galleries.\n\nNegative: tiny rooms, not sustainable. Towels and bed linen changed almost every day. Small portions of shower gel, shampoo, conditioner. A hotel should be sustainable",
      "date": null,
      "userInfo": "Local Guide · 25 reviews · 147 photos",
      "photos": []
    },
    {
      "user": "Greg Jones",
      "rating": "2/5",
      "text": "The regular rooms are comically small.\nThe employees were great.\nThe wifi is useless.\nBeing charged an extra $140 in facilty fees, plus taxes, each day AFTER I left makes me not want to use them again. I was told this was for wifi access, 24 hr gym access & so on, when I called & asked.",
      "date": null,
      "userInfo": "Local Guide · 57 reviews · 74 photos",
      "photos": []
    },
    {
      "user": "Nicola Bailey- James",
      "rating": "5/5",
      "text": "We have stayed at hundred if not thousands of hotels all over the world and the staff at this one are THE best.  They are exceptionally helpful, warm, friendly and caring.\nThe room is a little snug, but the beds are insanely comfortable.  The building is chic and relaxed making it feel like you’re not stuck in tourist hell.\nWill return without doubt.",
      "date": null,
      "userInfo": "13 reviews",
      "photos": []
    },
    {
      "user": "Joel Alesch",
      "rating": "4/5",
      "text": "Sorry New York, we are from LA and we have a lot of space, your micro rooms where the beds literally touch 3 walls freaks me out. You almost bump your face on the back wall as you come in the door. I thought I stepped into another elevator. just kidding, like being in a hall way. if you have another person in the room don't expect a speck of privacy. It was very clean, comfortable bet, hard to climb into. No coffee machine, I called to get one, which a not said to do, left a message, nothing. Next morning got coffee at the little bar, super gross, maybe the almond milk was bad? 2 coffees, undrinkable, 1 good blueberry muffin, 16 dollars. Hmmm...Staff very nice, restaurant for breakfast not open Monday or Tuesday, hmmmm....lame. when you walk into the door you have to go downstairs to check in, up the stairs to go to your room. Hmmm. It's just out of control cramped and crowded, they do the best they can do. Maybe Europeans or little people would be cool with it, put I'm a Jumbo guy who swings his arms around, likes good coffee and a pool and lots of space required, so I'm going to Palm Springs.",
      "date": null,
      "userInfo": "Local Guide · 471 reviews · 1,053 photos",
      "photos": [
        "https://lh5.googleusercontent.com/p/AF1QipMTwLU3DOV0JXBPZLZivxEOycyUshDbyMYKbzA=w300-h450-p-k-no",
        "https://lh5.googleusercontent.com/p/AF1QipMJ0vasDcRm7WVNKZ6By6ciq0wT33d5lHhdiJQ=w300-h225-p-k-no",
        "https://lh5.googleusercontent.com/p/AF1QipN-ycoiEk_I-OsEs0QmBrwAVKTrw04PL_K2oa4=w300-h225-p-k-no"
      ]
    },
    {
      "user": "Wentao Ma",
      "rating": "1/5",
      "text": "I prepaid my room but got double charged. It’s been a whole week still haven’t received any response.",
      "date": null,
      "userInfo": "3 reviews",
      "photos": []
    },
    {
      "user": "Lin Lee",
      "rating": "4/5",
      "text": "So friendly, helpful, professional, warm staff. Very accommodating. Up to date room, sink in room, king bed, spacious modern shower/toilet. Cafe service, beautiful rooftop another club. All secure with W card needed to access areas. Felt safe/secure. Wonderful pm (mod ) validated my overnight stay, thank you. Best visit! Parked at Edison ParkFast.\nThis review is for the 77 Walker Street Tribeca Location. There are 2 Walker Hotels. Parking is close.",
      "date": null,
      "userInfo": "Local Guide · 60 reviews · 37 photos",
      "photos": [
        "https://lh5.googleusercontent.com/p/AF1QipPKPjIEIVFbuGkpftZcgbCs6AsM2HucuevhjHZu=w300-h450-p-k-no",
        "https://lh5.googleusercontent.com/p/AF1QipNRWB2M90eeV6fzUE1tadHNElLE-FkWsw5T7Pl-=w300-h225-p-k-no",
        "https://lh5.googleusercontent.com/p/AF1QipOen0gFI-1cR_OWkqRtYA3kCcH6zVBj78fgthzy=w300-h225-p-k-no"
      ]
    },
    {
      "user": "Adrienne Kim",
      "rating": "5/5",
      "text": "What a special place- I brought some of my grad students this morning for a coffee and the woman at the front desk made sure we were cared for with coffee and water even though the cafe wasn’t open when we arrived. Her true hospitality took my breath away. The lobby is a gorgeous place to visit but the people are the reason to treasure this place.",
      "date": null,
      "userInfo": "10 reviews",
      "photos": []
    },
    {
      "user": "Sarah Toews",
      "rating": "5/5",
      "text": "I stayed here just for one night, traveling for work. This is one of the cutest hotels I have ever stayed at! The rooms are small but I didn’t mind it since I was traveling alone. The view from my room was incredible. The coffee shop downstairs was so good. The people were friendly and the coffee was top notch. I loved staying here! Hope to come back soon.",
      "date": null,
      "userInfo": "Local Guide · 37 reviews · 9 photos",
      "photos": []
    },
    {
      "user": "Sean Snelders",
      "rating": "4/5",
      "text": "Nice hotel. Room was small but adequate. Hotel employees were very nice.",
      "date": null,
      "userInfo": "Local Guide · 87 reviews · 1 photo",
      "photos": []
    },
    {
      "user": "Rozeenascurlytravels",
      "rating": "5/5",
      "text": "This hotel is a gem in Tribeca. We booked a large room but I believe the regular rooms are pretty NY standard (#iykyk). Staff were friendly and helpful. Room was clean and stylish. There’s a cafe, coffee shop, restaurant and speak easy all on site. Would definitely stay here again. Finding space to work in the lobby was hard (it was always busy), but the room has a desk. Highly recommend.\n\nWe sat in the lobby and worked after we checked out and the doorman/security assist that was in the lobby that day was so genuine and caring. I watched him interact with customers and he went above and beyond. Hard to find people like that - I hope the hotel pays him well!",
      "date": null,
      "userInfo": "Local Guide · 147 reviews · 22 photos",
      "photos": []
    },
    {
      "user": "Lyric Kaplan",
      "rating": "2/5",
      "text": "Room 705 has no blackout curtains. The light will wake you up when the sunrises. Forget trying to sleep in. Not happy.",
      "date": null,
      "userInfo": "109 reviews · 8 photos",
      "photos": []
    },
    {
      "user": "Maggie Rich",
      "rating": "5/5",
      "text": "We booked a stay for a long holiday weekend on Manhattan and had a really great experience! The rooms are no smaller than we were expecting, and they were cozy and sleek. The bar was really really fun, and the coffee shop on site is excellent. The service was also really excellent -- we rushed our check-in so that we could make it to a dinner reservation and they were so accommodating; stashed our bags quickly and wished us a good dinner. All around the service was kind, prompt, and lovely.",
      "date": null,
      "userInfo": "3 reviews",
      "photos": []
    },
    {
      "user": "Dan Holland",
      "rating": "5/5",
      "text": "Great hotel in the heart of Tribeca, easy walk to Soho etc. Fantastic staff, special shout out to Mercedes who was a ray of light after a tough journey, made our check-in process smooth and we felt instantly welcome.\nBlue bottle coffee right next door, good restaurant for lunch also attached to hotel plus even a speakeasy underneath. What more could you ask for? Rooms are a little small but hey, it’s Manhattan. I’ll be back",
      "date": null,
      "userInfo": "17 reviews · 2 photos",
      "photos": []
    },
    {
      "user": "Claudia Higgins",
      "rating": "1/5",
      "text": "Avoid at all costs! Birthday ruined. Visited end of May - June.\n\nFirstly, the rooms are tiny even for New York. Its a struggle to fit two people in even the largest of rooms with luggage. Hardly any closet space and the bathroom is tricky.\n\nSecondly, the staff at this establishment are despicable, bar one guy, who is Jamaican, who helps with luggage. He was the only friendly and respectful person employed by this hotel and offered suggestions on what to do in the blistering heat, which was more local than the tourist hot spots. The cleaning in our room was not substantial as they found earrings that didn't belong to me and left them on the counter even though they were covered in junk/dust.\n\nThirdly, which brings me to the most heinous point of all. I had a sentimental plushy which was given to me by my partner when we first met 8 years ago. The cleaners somehow took this from our room, and presumably got caught up with the sheets. When we reported it to the reception they told us we were lying because 'why would a cleaner want that' and said we must have misplaced it because the cleaners said they left it in our room. We were in no way accusing them of theft but explained to this incredibly rude woman on reception that we suspected it was caught up. She denied they had it explicitly and was not helpful. We checked in for the rest of our trip to see if it had shown up but were met with the same attitude. We left our details, so if they did indeed find it, it could be returned to us ASAP as, stated above, it holds extreme sentimental value.\n\nA few days after we left, my partner did in fact receive an email from Mercedes, saying they unsurprisingly had found the plushy. There was no apology, and no time frame stated as to when this needed to be collected. As myself and my partner do not live in the US, we enlisted the help of a friend to collect but they weren't able immediately as were working in LA. My partner called to check a couple of weeks ago about when this could be sent to us as we realized it may take too long only to find that the hotel had thrown it away. We received no communications from them stating that it needed to be collected before x date. They just decided that they would throw something away we specifically had asked them to find. THAT THEY HAD TAKEN FROM US IN THE FIRST PLACE.\n\nThis hotel ruined my birthday and has lost something that to me was priceless. I implore people to never stay here as they clearly do not value their customers and are literally some of the worst service staff I have ever encountered.",
      "date": null,
      "userInfo": "6 reviews",
      "photos": []
    },
    {
      "user": "Noah Dillon",
      "rating": "1/5",
      "text": "I was shocked that the rich like this kind of abuse and degradation. We came here as an after party for an art fair. I told the very nice front desk person that the closest I'd ever been to the hotel is to use the bathroom at Blue Bottle in the lobby one time.\n\nWe went up to the roof, which has a grand view of the city and hideous decor at the bar. There was a drink list, but I guess you had to ask for a menu. It seemed like the only food anyone could order is a mezze plate where everything appeared to be from Key Foods and served on what I think are those awful disposable bamboo plates.\n\nThe drink list was appalling. One red and one white wine. Four or five underwhelming IPAs and a lager. Four sickly house cocktails and three treacly frozen drinks. A liquor menu that resembles the options available on a Jet Blue flight.\n\nEverything was overpriced, but nothing seemed as insultingly expensive as I had guessed. We ordered two simple well drinks, listed at $14. The bartender gave us a bill for $36—one for $20, the other for $16, which she says is the cost of adding mixers like sugar and lemon juice.\n\nSome companions showed up and left immediately. I wished we'd done the same. We watched an enormous TV flicker through someone's window three blocks away. We looked at the skyline and tried to see my office. We looked at the Renzo Piano Jenga tower and the other famous buildings. Of course we couldn't see our neighborhood in Queens from there, where our local dive objectively surpasses this con job in every metric. Who goes here, I don't know. It's probably the same kind of person who makes a reservation at like a Chili's in Times Square while they're visiting the city to shop at Bergdorf and take selfies at Trump Tower. They're probably getting cancer from bowel insertions of a platinum AmEx and are probably over-leveraged. When I go running in the morning, in an attempt to outlive these cretins, I am in a citywide cloud of smog, caused in part by their Ubers and the Ubers of people like them.\n\nI feel sorry for them, but they also brought this on themselves while they ruin everything for everyone else.",
      "date": null,
      "userInfo": "Local Guide · 62 reviews · 15 photos",
      "photos": []
    },
    {
      "user": "Ryan Franz",
      "rating": "3/5",
      "text": "Location was great. Rooms are extremely small. You get a bed, a closet, a sink, and a bathroom. For those of you traveling with a companion, the bathroom door loosely slides closed and doesn’t latch. There is no fan. You can hear EVERYTHING your traveling companion is doing in there. No refrigerator, no coffee, no iron. The quality of the rooms was mixed. Bedding was very comfortable and the plumbing fixtures were high quality. The shade for the window in the room only operates on an automatic button. Ours did not function upon arrival. Maintenance was able to fix it promptly. Service was polite, but not quite what I was expecting. We ordered champagne when we booked the room and they forgot to deliver it on the first night. When I asked about it the second night, they apologized and sent us up a bottle. However, I was just handed a bottle of warm champagne. Not even a bucket of ice with it. Overall, it was fine, but I’d consider another property on my next visit to the city.",
      "date": null,
      "userInfo": "2 reviews",
      "photos": []
    },
    {
      "user": "Kelsey Harker",
      "rating": "5/5",
      "text": "Every aspect of our stay at this hotel was amazing. The staff was above and beyond accommodating. From making sure we had a room with a view, to great recommendations from the bellman, to the kindness of the housekeeping staff - it was all an amazing experience. The room itself was so comfortable. We loved every aspect of our room. The location is right near the Canal Subway Station, and there is tons of food in the area. I don't think I will be able to stay anywhere else next time we return to NYC! This was just too great, and I can't recommend enough!",
      "date": null,
      "userInfo": "8 reviews · 1 photo",
      "photos": []
    },
    {
      "user": "gregory mark",
      "rating": "4/5",
      "text": "I stayed here for a week and it was a great place for a business trip to NYC. Wi-Fi is strong, there’s a Blue Bottle coffee in the same building (with lots of couches for doing work on), a nice bar at the connected restaurant, and the hotel’s gym is amazing. Rooms are designed nicely — a lot of reviews mention the rooms being small, but I didn’t feel that traveling solo. If you’re looking for a room that has a really nice bed / bathroom, a small desk, with a chair, you’ll be happy.",
      "date": null,
      "userInfo": "6 reviews · 38 photos",
      "photos": []
    },
    {
      "user": "Shilpi Sanchetee",
      "rating": "5/5",
      "text": "Walker Hotel Tribeca was the perfect home for my 5 day trip to NYC. The room is very chic, and super clean with all amenities & more. The staff is super friendly and always available to help. They have a coffee shop & lunch/dinner spot in the hotel as well as a tucked away speakeasy (Saint Tuesday) - this hotel has it all. It made my stay super easy as I could get a drink, coffee, and a meal all in the same place.\n\nDefinitely staying here on my next trip to NYC.",
      "date": null,
      "userInfo": "5 reviews",
      "photos": []
    },
    {
      "user": "Melody Ha",
      "rating": "5/5",
      "text": "The Walker Hotel is beautifully designed and furnished, affordble, and every single staff member I met were super friendly and helpful. I stayed for work - there's a great space to work and hang out in the lobby. The Blue Bottle cafe was a nice perk. The rooms are very small but it doesn't feel cramped - the trade off is great natural light and a nicely designed boutique room.\n\nThe location is super convenient as well and they have a gorgeous rooftop bar and bar on the ground as well. Would highly recommend if space is not a concern for you!",
      "date": null,
      "userInfo": "1 review",
      "photos": []
    },
    {
      "user": "Robert Wood",
      "rating": "5/5",
      "text": "I loved the location amenities the room was small but large bed and big tv. They have a nice coffee shop on the first floor so that was convenient.  The shower spout was in the ceiling. Plenty of hot water. Best shower ever. Very clean. Rooftop bar has amazing views. Only problem was the key stopped working and I had to switch rooms across the hall.",
      "date": null,
      "userInfo": "2 reviews",
      "photos": []
    },
    {
      "user": "Donald",
      "rating": "10/10",
      "text": "Located near SoHo, Chinatown, and Little Italy. Also a short walk (less than 5 min) to Canal St. Subway Station!\r\nComfortable bed, luxurious bath products, and even a rainfall shower head! Room …",
      "date": null,
      "userInfo": null,
      "photos": []
    },
    {
      "user": "Brianna Payne",
      "rating": "1/5",
      "text": "Some of their staff - Alicia/Alyssa and Met - are not great quality. The rest have been great, but I won’t be visiting again after dealing with those two. I was a fan and gave this place five stars after my first stay, not this time. This place barely has heat and of course is pretty small, they can’t afford awfully behaved receptionists as well.",
      "date": null,
      "userInfo": "118 reviews · 10 photos",
      "photos": []
    },
    {
      "user": "Ginny Kafka",
      "rating": "5/5",
      "text": "I had an opportunity to have an evening to myself, away from my husband and daughter, to recharge.  I picked this hotel to get away and it was perfect for the moment.  Visitors should be warned that the rooms are very small with showers only (I love a tub), but they are also absolutely perfect.  The bed was SUPER cozy, the window opened up so I could enjoy some fresh air, and the shower was very nice with the rain feature.  I also liked the location---it is kinda where Tribeca and Chinatown and Little Italy all connect.  The only suggestions:  have on-demand available so I can rent the movie of my choice, and room service should deliver directly to the room instead of to the desk.  I will absolutely return for future \"mom away for the night\" opportunities.",
      "date": null,
      "userInfo": "1 review",
      "photos": []
    },
    {
      "user": "Anonymous A",
      "rating": "3/5",
      "text": "Front desk any time I stay or call seems overwhelmed. They get flustered when balancing both calls and check in. Johnathen couldn’t get my email correct after 3 attempts, then asking me to take down their email instead, basically passing me off. He rushed through each of his calls with me. Thank you to Jalen for your great service, getting my email right the first time and my needed information sent to me urgently.",
      "date": null,
      "userInfo": "10 reviews",
      "photos": []
    },
    {
      "user": "Valence Tan",
      "rating": "2/5",
      "text": "The room is clean, comfortable and gorgeous. However, the back office and customer service was rude and horrible. Called to ask why was the room half made or unmade ok different days and half drank water bottles (not ours) was left in our room on two separate days. I wasn’t even mad or upset but just wish to understand. Instead the back office or customer service (more like disservice) didn’t even want to listen and cut me off. So very rude. I felt like I called for assistance but got scolded in return. Seriously horrible people. Avoid this place.",
      "date": null,
      "userInfo": "2 reviews · 3 photos",
      "photos": []
    },
    {
      "user": "nathalie keym",
      "rating": "5/5",
      "text": "I’m currently staying in Walker Hotel Tribeca, the hotel has such a cool vibe and great atmosphere in the cafe downstairs!! But I came in here just to say how wonderful and helpful the staff is! JOSEF the manager has been super helpful and kind and NELSON one of the staff members who helped me settle into my new room was so nice and helpful - you can sense their genuine interest in your well being! And that really counts for a first timer in New York. I felt safe and supported and can’t wait for the rest of my stay :))",
      "date": null,
      "userInfo": "6 reviews",
      "photos": []
    },
    {
      "user": "Daniel Roca",
      "rating": "3/5",
      "text": "Decent, clean comfy bed, small rooms.\nStaff ranges from ok to clueless. One staff woman at the checkout kept calling me “sweetie”… a little too familiar. Another had no idea who was in charge of housekeeping. Baggage handler brought boxes labeled “This Side Up” with proper handles UPSIDE DOWN. Location is the reason to be here.",
      "date": null,
      "userInfo": "Local Guide · 41 reviews · 22 photos",
      "photos": []
    },
    {
      "user": "Javier Camorlinga",
      "rating": "5/5",
      "text": "It was my first time visiting New York and I stumbled upon this beautiful boutique hotel online. I stayed here for 4 nights and it was the best decision I made. Disregard the comments about the size of the room. The room is a cozy size, there are compartments for all your luggage/bags, it is tech-savvy, and the beds are extremely comfortable. The staff always made sure my stay was going well and that we had water in the room.\n\nThe lobby and main seating area are exceptionally beautiful. They did an amazing job on their interior design. I had the opportunity to speak to a lady who is part of the marketing and interior design team. We had a lovely talk about the design that went into making the hotel. The seating area on the 2nd floor is a great spot to unwind and have a cocktail or coffee during your stay.\n\nChoose this hotel instead of the other chain hotels in NY. The experience and customer service that you will receive here is top notch. Thank you to the staff of Walker Hotel for a superb first visit to NY!",
      "date": null,
      "userInfo": "4 reviews · 6 photos",
      "photos": [
        "https://lh5.googleusercontent.com/p/AF1QipPJAamO9Xe4cuuhnPRqbo1JQlqpfvIpuT1pcebN=w300-h225-p-k-no",
        "https://lh5.googleusercontent.com/p/AF1QipPmRB-pwdFngsDRCKgTrEL6wgrA8UAE3vEjPiZX=w300-h225-p-k-no",
        "https://lh5.googleusercontent.com/p/AF1QipMJQr_kMlYB8snC0TzRMqm-kC3XpF9B9FQabuly=w300-h225-p-k-no",
        "https://lh5.googleusercontent.com/p/AF1QipM4X55B2gxA72Nqu2pjleIYunlQKgtgbEX4CQPE=w300-h225-p-k-no"
      ]
    },
    {
      "user": "Betty Huang",
      "rating": "4/5",
      "text": "We stayed there for two days of New York City weekend fun. We booked trips to jazz clubs/restaurants/plays. It was a great location.\nWe got a standard room which was very small but normal for New York City.\nThere was easy to use TV/electronics which allowed you to cast music and videos.\nThe service was courteous and efficient.\nGood looking basement lobby.\nOverall good value.",
      "date": null,
      "userInfo": "Local Guide · 71 reviews · 1 photo",
      "photos": []
    },
    {
      "user": "Anna Whiteman",
      "rating": "5/5",
      "text": "First time staying and was very impressed. Staff was extremely friendly! I booked with Bell a few hours before arriving and she was absolutely lovely. The space is very well decorated and awesome vibes. Very clean facility rooms are smaller but what more do you need! You won’t spend much time in the room anyways!",
      "date": null,
      "userInfo": "7 reviews · 1 photo",
      "photos": []
    },
    {
      "user": "Maddy Slatt",
      "rating": "2/5",
      "text": "We arrived at the Walker Hotel for the weekend and the check-in was extremely uncomfortable. Once given the key to our room, we opened the door to find an unclean room with towels stacked on the bathroom floor, a dirty shower, no soap, a full garbage and a messy bed. We were celebrating a special occasion and this room was expensive so this was shocking to see. We first called down to the front desk about this situation and no one answered. Then, we went to the front desk and explained the situation. Then, we were given a key to a different room. This next room was much smaller than the original room. So now, we were even more upset. We proceed to go back down to the front desk and explain that the new room was not what we expected or paid for and they said that there was nothing else available and we’d have to check in later (with no guarantee) for another room. We then asked if they could muster an apology for this situation as we explained that this was very unprofessional of the hotel. To which the front desk responded, “it is not unprofessional, it is human error.” The tone of the front desk and the complete lack of empathy was very unsettling. We ended up staying in the second room as we didn’t want to deal with the front desk anymore. Aside from this, the rooms (both that we saw) were tiny and the staff are not customer service oriented. We would not come back.",
      "date": null,
      "userInfo": "14 reviews · 14 photos",
      "photos": []
    },
    {
      "user": "Grant Kendzior",
      "rating": "5/5",
      "text": "This hotel blew me away! I travel constantly for work and am usually Marriott loyal but this experience made me rethink that. This hotel is perfectly thoughtful to the modern traveler.  It open community area is the ideal environment for working on the go. The rooftop area has one of the best views of NYC. The rooms are small but exquisite, providing everything you need and more. The staff was beyond kind and courteous, even bringing local cookies to the room :) DON'T HESITATE, STAY AT THE WALKER!",
      "date": null,
      "userInfo": "5 reviews · 1 photo",
      "photos": []
    },
    {
      "user": "Mi Shum",
      "rating": "5/5",
      "text": "Great customer service and really friendly staff. Room is compact but clean and bathroom is neat and nice. Bed is comfortable.\n\nThere is no fridge in the room but you can request one at the reception. Or you can tell the staff to save your food in their fridge too.\n\nLove the deco and location of the hotel. Will be going back!!",
      "date": null,
      "userInfo": "Local Guide · 17 reviews · 17 photos",
      "photos": [
        "https://lh5.googleusercontent.com/p/AF1QipN1uCizPu57NDyzzgNDffK2m2C8yboYZSOgantc=w300-h225-p-k-no",
        "https://lh5.googleusercontent.com/p/AF1QipNmhIcMeI3GcJEXOGZwKSpWwPz3Q5dAFAd-fv0C=w300-h225-p-k-no",
        "https://lh5.googleusercontent.com/p/AF1QipNeUXgztODyNS-PJnF49kUc6_rfTKRoOgEnKqYu=w300-h225-p-k-no",
        "https://lh5.googleusercontent.com/p/AF1QipORlMj88Pk6OuvgTrQVYD3Vt6jeDLnwwR34PeD0=w300-h225-p-k-no"
      ]
    },
    {
      "user": "Jen Smith",
      "rating": "5/5",
      "text": "This has become my go to NYC hotel. I absolutely love it. The rooms are sleek, modern, and NY cozy. The staff is incredible. Every time I stay, they are so welcoming, friendly, and helpful with anything! The lobby and other public spaces are beautifully designed and great to work in or just hang. I also love that street parking has been very easy every time I’ve stayed here! Ohhh and they have a rooftop with amazing city views! 🙌  My new favorite thing is the Speakeasy bar with unique and extraordinarily tasty cocktails!",
      "date": null,
      "userInfo": "Local Guide · 65 reviews · 197 photos",
      "photos": [
        "https://lh5.googleusercontent.com/p/AF1QipMiZxFO3y_Fzt8cphCuRwbN9_qlWPfiCvyHZato=w300-h450-p-k-no",
        "https://lh5.googleusercontent.com/p/AF1QipNXT5NQ4Sg7rbwqKepPFkFeBxqHwhxeUIpUsr9I=w300-h225-p-k-no",
        "https://lh5.googleusercontent.com/p/AF1QipNMDHOdD-A9mqSQFgGUKdmmWxZffAkgIaA1hSSi=w300-h225-p-k-no"
      ]
    },
    {
      "user": "Alanna Foley",
      "rating": "5/5",
      "text": "I have stayed at this hotel once before and it was a very pleasant experience. Today I wanted to give a special shout out to Edgar, who was fantastically helpful the other day as I was planning my next stay at the property. He answered the phone when I called with a slew of random questions, and instead of making me feel rushed/silly (which is usually the case when you call a busy front desk), he took my call in another room to ensure he could hear me clearly / was delightfully patient and upbeat throughout our interactions as I asked redundant questions. He really put me at ease throughout our communications in a way that made me feel great about re-booking a stay at this hotel. These are the kinds of experiences that make me want to be a patron somewhere time and time again. So, all that is to say thank you to Edgar for your top notch customer service skills. I hope you get ample recognition for what you are bringing to this establishment.",
      "date": null,
      "userInfo": "5 reviews",
      "photos": []
    },
    {
      "user": "Danielle Murray",
      "rating": "5/5",
      "text": "I booked this trip for work due to proximity, and I loved it. I looked at a lot of reviews and honestly, was not super sure due to various good and below average reviews, but I only had the best experience with the staff, room, cleanliness, etc. The bookings are clear on how big they are - 190SF for the Cortland Corner King I booked. That is small, yes, but it is NYC, and also not too small at all. Again, they tell you this in the booking, so no surprises. The 3 windows in the corner room make it feel bigger too, so I recommend booking a Cortland Corner King room (the description in booking also clarified 3 windows, as opposed to 1). Shower was incredible - hot water and great pressure. I was on the 4th floor (of 10) but the view was still nice of the buildings around me. I am sure a higher floor would be even better. Only comments on the room for improvement is that the outside glass of the windows were filthy, so it blocked some of the view / not good for taking a photo of the window views, and then there is really no place to hang towels by the sink - would be easy to add those to the rooms so there is a place to set wet / drying towels (there is 1 hook in the bathroom right next to the toilet - not an ideal hygienic place to set a hand or face towel). Lastly, no mini fridge for food leftovers, drinks, etc. That is a nice feature when traveling alone and not being able to finish a meal, but wanting to save for later.\n\nThe staff was very friendly and I interreacted with at least 5 different people between the desk staff and the bellhops / doormen throughout my stay (no issues - just check in, random questions, and holding my baggage).\n\nBlue Bottle in their lobby is a great amenity. I had coffee there all three days, and worked from there prior to my check in after I landed. Many options for sitting / lounging / working. I was there the last day the rooftop bar (Honey Be?) was open for the season, and this is the only part of the hotel where the staff was not super friendly. The male bartender was great, but there was a female bartender who was simply not enjoying being there and did not care to offer any type of friendly service. No bother, I got two yummy (but overpriced) drinks and beautiful views of the city, so not a huge bummer. Lastly, the small bar below the hotel was incredible - I went 2 nights in a row, and two different bands were playing wonderful live instrumental music (jazz both times). Again, the drinks are pricey, but they also offer beer and wine at a bit lower of a price point if wanting to just hang there and listen to music without spending way too much. open until 2am as well.\n\nOverall, I loved my stay here, and would 10/10 book again in a Cortland Corner King.",
      "date": null,
      "userInfo": "Local Guide · 23 reviews · 38 photos",
      "photos": [
        "https://lh5.googleusercontent.com/p/AF1QipNsDfFtC3yIDaR2Ia3f-bf8Ot0JdviXdCGitE79=w300-h225-p-k-no",
        "https://lh5.googleusercontent.com/p/AF1QipMTANpKMEtDYnA7FBLa36UI1VDviRcA6uzLfh98=w300-h225-p-k-no",
        "https://lh5.googleusercontent.com/p/AF1QipPc75sYMOIZB160HEIB9lhmxKn7JakwkgH9Cj5S=w300-h225-p-k-no",
        "https://lh5.googleusercontent.com/p/AF1QipPQmscbQeQydUU_sMXoK4MH0tpIow9-WiEo70-T=w300-h225-p-k-no"
      ]
    },
    {
      "user": "J G",
      "rating": "5/5",
      "text": "The lowest-priced rooms are tiny but well-appointed. The staff is awesome. There is a dude at the front named Jay that helped me out a bunch while I was there this week with directions, getting a table to work at, finding my bags, chit-chatting about NYC, etc, etc. He was awesome. The rooftop was really nice and mellow. I will definitely be back.",
      "date": null,
      "userInfo": "16 reviews · 1 photo",
      "photos": []
    },
    {
      "user": "Andy Malone",
      "rating": "5/5",
      "text": "Amazing hotel - friendly and professional staff; clean and modern rooms; great vibe throughout the facility. A tremendous value for NYC, and the location can't be beat. Just awesome!",
      "date": null,
      "userInfo": "9 reviews",
      "photos": []
    },
    {
      "user": "Brandon Barlow",
      "rating": "5/5",
      "text": "Nice little boutique hotel. The rooms are a little small but nicely updated and clean. The coffee shop on the main floor is clutch for early mornings. They also have a rooftop bar which has an incredible view that I cannot recommend enough. Nice location centrally located. I stay here every time I'm in New York",
      "date": null,
      "userInfo": "Local Guide · 113 reviews · 19 photos",
      "photos": []
    },
    {
      "user": "Nina Benavides",
      "rating": "5/5",
      "text": "Absolutely loved this hotel! Great location, conveniently located around train stations. Hotel staff was great, Eric was great and very accommodating. Hotel and rooms overall are pretty clean and beds are comfortable, the rooms are small but cozy and I personally loved the layout I had. Due to COVID, there are certain days for room maintenance so keep that in mind. This is a great stay, the only downside is the staircase when you first enter. I travelled with my baby so it was tiring to have to heave the stroller up and down the stairs but staff was also helpful with that.",
      "date": null,
      "userInfo": "9 reviews · 10 photos",
      "photos": [
        "https://lh5.googleusercontent.com/p/AF1QipPuavJ2HTfqeVxTuICDgahnSbzRmMaUgng235BJ=w300-h450-p-k-no",
        "https://lh5.googleusercontent.com/p/AF1QipPpX5UknnE03L5bhtxtFkXOG5Pp69REn7aqhYvb=w300-h450-p-k-no"
      ]
    },
    {
      "user": "Spencer Reynolds",
      "rating": "5/5",
      "text": "Walker hotel is a millennial's dream spot in NYC. The location is great, the hotel is cute and modern and just sexy enough. Staff is accommodating and polite.\n\nThe rooms are tiny but that's new york. I have zero complaints about this hotel, it was exactly as advertised and surprisingly charming. Blue Bottle coffee in the lobby is a bonus.",
      "date": null,
      "userInfo": "Local Guide · 31 reviews",
      "photos": []
    },
    {
      "user": "Carl J",
      "rating": "3/5",
      "text": "Well decorated and ideally located to explore NYC. But for the rest not a good experience. We knew the room was small but not that small. You can't even go around the bed. But the worst part was the noise, we could hear everything going on in the street making it really difficult to rest. And the room service that knocks on the door 4 times when we left the sign DO NOT DISTURB.",
      "date": null,
      "userInfo": "Local Guide · 118 reviews",
      "photos": []
    },
    {
      "user": "Alexandra Reyes",
      "rating": "5/5",
      "text": "Room is small, but we were out all day and only used it to sleep so it was perfect and everything we needed. The room is nice and fancy. My dog loved the king bed. The staff was not a bother and very accommodating. The hotel is very clean at no point did I wonder if it was clean and was all around comfortable. 10 out of 10 recommend especially with pets. Hotel location could not be better.",
      "date": null,
      "userInfo": "4 reviews · 2 photos",
      "photos": []
    },
    {
      "user": "ALINA GRIGORIAK",
      "rating": "5/5",
      "text": "Me and my boyfriend stayed there during Christmas holidays. You can see warm\nsunset on the whole New York from the window! The hotel is really clean and smells good. Really photogenic too so I took some pics for my insta. The location is really nice. We were just walking to some places from the hotel. Recommend it to stay in New York!",
      "date": null,
      "userInfo": "Local Guide · 120 reviews · 306 photos",
      "photos": [
        "https://lh5.googleusercontent.com/p/AF1QipMAPexk3JywNNGT9Fkm_W3kKkj2BjcjWjjStCq2=w300-h225-p-k-no",
        "https://lh5.googleusercontent.com/p/AF1QipOxUCm3a1QdEl1Y1IiFAZk11IMQe-L5W0VocpEN=w300-h225-p-k-no",
        "https://lh5.googleusercontent.com/p/AF1QipO1eAUzxQ3TnvBX9DNGmE2Zcg6DEwekG6STLgee=w300-h225-p-k-no",
        "https://lh5.googleusercontent.com/p/AF1QipO7vfqAHXdBn5RYiW8ACLU0jl6pLYJrusj1dATR=w300-h225-p-k-no"
      ]
    },
    {
      "user": "Meghan Dorn",
      "rating": "4/5",
      "text": "Rooms are on the smaller side but service is always friendly and is very convenient to get around nyc from here",
      "date": null,
      "userInfo": "Local Guide · 67 reviews · 136 photos",
      "photos": [
        "https://lh5.googleusercontent.com/p/AF1QipNsxwvofJHVaGN314GeupBKaF7AS6HVCpT9kD4L=w300-h450-p-k-no",
        "https://lh5.googleusercontent.com/p/AF1QipNESfeYLtgezfpIxEmulfwVTKCVSofDtBxk6pGE=w300-h450-p-k-no"
      ]
    },
    {
      "user": "Andrew Dodson",
      "rating": "4/5",
      "text": "Nice, hip place! Clean with a very interesting gym. I've never used a fast manual treadmill before so it was nice that I was given the chance to try something new.",
      "date": null,
      "userInfo": "Local Guide · 24 reviews · 3 photos",
      "photos": []
    },
    {
      "user": "Sofía Moñino",
      "rating": "2/5",
      "text": "No good experience. Many broken things at room: safe, store behind the bed, light key….\n\nGood location, gentle staff good coffe in blue bottle.\n\nUnfortunately I prefered an other hotel for my next trip.",
      "date": null,
      "userInfo": "Local Guide · 61 reviews · 106 photos",
      "photos": []
    },
    {
      "user": "frederic charnoz",
      "rating": "5/5",
      "text": "I'd love the location, not a busy street but still very convenient as close to Soho, chinatown, metro station\nDoesn't offer breakfast all the time but the lobby is comfy plus a nice underground jazz bar  and a very nice rooftop !enjoy !",
      "date": null,
      "userInfo": "Local Guide · 68 reviews · 146 photos",
      "photos": [
        "https://lh5.googleusercontent.com/p/AF1QipO98seufIWuZFzH40YTD9C7j9Jmavb7tQEFti_l=w300-h450-p-k-no",
        "https://lh5.googleusercontent.com/p/AF1QipO6yXn9XLqfd5ACWQl3slSzCGX6K4h32KoWIk_v=w300-h450-p-k-no"
      ]
    },
    {
      "user": "Jordan",
      "rating": "2/5",
      "text": "Pretty subpar experience at this hotel - seemed to be not well kept and lacked basic essentials (i.e robes). Further the heat was not working, and wasn't fixed for the duration of our stay despite asking. A baseboard heater was sent but would have preferred the AC system to actually work - the technician didn't even try.",
      "date": null,
      "userInfo": "14 reviews",
      "photos": []
    },
    {
      "user": "Kayla Huffman",
      "rating": "5/5",
      "text": "Met all my expectations. As a solo traveller the King room was more than enough space. Super comfortable bed, great shower, and nice central location. Would definitely stay again and recommend to friends.",
      "date": null,
      "userInfo": "5 reviews",
      "photos": []
    },
    {
      "user": "Ken Egozi",
      "rating": "5/5",
      "text": "Room is tiny but the bed was super comfortable with a really high quality mattress. The reason for 4 starts is that the window is hardly doing anything in the way of noise filtering making the night very noisy. Every street conversation and everything track cracking on its hinges carries straight to the room. I was on the fourth floor, next time I'll ask for a higher floor and see if that helps",
      "date": null,
      "userInfo": "Local Guide · 36 reviews · 54 photos",
      "photos": []
    },
    {
      "user": "Katya Braxton",
      "rating": "5/5",
      "text": "Amazing customer service - from the moment of a friendly staff opening the door for you, to the most graceful, elegant and welcoming front desk manager Edgar (who deserves a separate 5 start review!!) to the cleaning team and the most friendly bartenders and wait stuff. Rooms are tiny but functional, beds are comfy. I’m totally staying at the walker if I need to stay in NYC.",
      "date": null,
      "userInfo": "14 reviews · 3 photos",
      "photos": []
    },
    {
      "user": "The Rebel Camp",
      "rating": "5/5",
      "text": "This was such an amazing stay and highly recommended! We will be back for sure",
      "date": null,
      "userInfo": "3 reviews",
      "photos": []
    },
    {
      "user": "Ashley Wilson",
      "rating": "3/5",
      "text": "The hotel was amazing! The room was super cute, pod style. Lobby, restaurant and cafe were awesome. The staff could’ve been nicer though… I was there for an engagement and they didn’t seem to care or was welcoming. The Bartender was super super nice tho! Overall, great place, I will recommend!",
      "date": null,
      "userInfo": "Local Guide · 13 reviews",
      "photos": []
    },
    {
      "user": "Briana",
      "rating": "5/5",
      "text": "Seamless check in and out. Service was outstanding from beginning to end. Loved the industrial/art deco design. Room finishings were of high quality. Lobby/ coffee lounge area was so peaceful to hang about. Definitely will stay again!",
      "date": null,
      "userInfo": "7 reviews · 18 photos",
      "photos": []
    },
    {
      "user": "Zoe C",
      "rating": "3/5",
      "text": "Nice decor in rooms. Perfect for 1/2 night stay but limited storage/wardrobe space for longer& could be slightly cleaner. No restaurant /bar facilities in the evening but presumably covid 19 is mostly to blame. Presumably the atmosphere in the hotel would otherwise be more vibrant.",
      "date": null,
      "userInfo": "Local Guide · 24 reviews · 4 photos",
      "photos": []
    },
    {
      "user": "Rens Pieters",
      "rating": "2/5",
      "text": "Just overall weird vibes for the amount of money you pay. People walking in and out all the time with no security. Lobby is located downstairs. Was trying to work in the lobby (which was very dirty) and they tried to send me to my room. Rooms are very cramped for the high price point.",
      "date": null,
      "userInfo": "Local Guide · 27 reviews · 20 photos",
      "photos": []
    },
    {
      "user": "Team Ponce",
      "rating": "3/5",
      "text": "It was an okay experience. The receptionist who greeted and assisted us during the stay was so friendly.\nIt's my first time booking a hotel during the pandemic so maybe I'm just not used to people not wearing masks on public areas.\nThe AC didn't make the room cold enough.\nWe asked for assistance and not much really happened.\nKinda modernized, but the floors were not given much attention.. Not sure how old the hotel is.\nProbably another thing that was covid-affected was their kitchen.\nWe wanted to try their room service but the menu was limited and needed to be picked up in the lobby.\nOverall, the hotel gave us a decent place to stay and that is the purpose of it all.\nThank you Walker Hotel Tribeca.",
      "date": null,
      "userInfo": "7 reviews · 1 photo",
      "photos": []
    },
    {
      "user": "Sean Symes",
      "rating": "3/5",
      "text": "So be careful when booking, we ended up booking at the wrong Walker hotel. This spot was not terrible as an overall experience but the room was really small. Our room had a queen bed facing a single large window and next to it was 3 feet to the wall. There was a single chair, small desk, the sink for the bathroom and closet. The bathroom was tiny, with a stand up shower. As a 6'2\" 240lbs man this room made me feel claustrophobic. It was clean and the staff was decent.",
      "date": null,
      "userInfo": "Local Guide · 55 reviews · 4 photos",
      "photos": []
    },
    {
      "user": "Emely Taveras",
      "rating": "5/5",
      "text": "This hotel is fantastic. The design is thoughtful and very nice. The rooms are small. You can even see a floorplan of the rooms on the website. This didn't bother me at all but I want to mention it because it's part of the charm. The rooms have everything you need and again, are thoughtfully designed. The bed was very comfortable and I slept soundlessly every night. I stayed in a Full room and it was great for a solo traveler. The hotel does have Queen and King rooms which have a bit more space for couples. The location of this hotel is exceptional. Right at the end of SoHo, Tribeca, and the LES. I highly recommend staying here.",
      "date": null,
      "userInfo": "13 reviews",
      "photos": []
    },
    {
      "user": "S J",
      "rating": "4/5",
      "text": "Cute little place in a great location!\nRoom was very small even for one person.\nNo coffee in room but you can buy one at the cafe located on site.\nDidn’t have a chance to check out the rooftop but their speakeasy was great-  live jazz and good drinks",
      "date": null,
      "userInfo": "59 reviews · 3 photos",
      "photos": []
    },
    {
      "user": "Christina Villarreal",
      "rating": "5/5",
      "text": "In the middle of lower Manhattan close to everything 12-15 minutes! Close to Chinatown and little Italy...many restaurants to enjoy! In the morning lovely coffee shop and pastries to enjoy and in the evening a beautiful roof top bar to relax and enjoy too!",
      "date": null,
      "userInfo": "Local Guide · 57 reviews · 73 photos",
      "photos": [
        "https://lh5.googleusercontent.com/p/AF1QipMzFHRLKxXu6duXP-KUHj-itSlHqEHNDpgUzqpk=w300-h225-p-k-no",
        "https://lh5.googleusercontent.com/p/AF1QipPx27p2jh-m6uj6slwSBEmaE1i_O1FY-FIYmrvF=w300-h225-p-k-no",
        "https://lh5.googleusercontent.com/p/AF1QipP9LrhqHadi9KERAj3dFiB4-rV3M_HWSpAjCw5c=w300-h225-p-k-no",
        "https://lh5.googleusercontent.com/p/AF1QipMKjtNelY5IeIdczzM2BxJjFM9QquSxDeYT5Vn8=w300-h225-p-k-no"
      ]
    },
    {
      "user": "Julie H",
      "rating": "5/5",
      "text": "Super pleased with my stay. I was here for 3 nights in May 2022. The room was immaculate and the bed super comfy. Huge windows with tons of light. Marble bath with rainhead shower. Lavender peppermint bath goodies. Great coffee shop in lobby. Near everything fun to see and do in Tribeca. Great check-in, all staff was helpful and kind.",
      "date": null,
      "userInfo": "Local Guide · 34 reviews · 51 photos",
      "photos": []
    },
    {
      "user": "Christopher Simard",
      "rating": "1/5",
      "text": "Don’s usually post reviews, but feel compelled in this situation. Short trip to NY to visit family @Little Italy. Read review and ratings and chose the Walker. Clean place, but significant issues leading to a very poor experience. Room was not ready to check in until after 5:30 pm. After a day of walking, finding out we could not check in in the afternoon after 3:00 was more than a significant inconvenience. Once we were finally able to check in, we were further disappointed to find the electric blinds did not work and were stuck in the up position. Being a light sleeper, not having blinds - significant problem. Desk clerk offered us sleep masks - seriously. No other rooms available. We will not be return customers.",
      "date": null,
      "userInfo": "2 reviews",
      "photos": []
    },
    {
      "user": "Mara G",
      "rating": "5/5",
      "text": "Rooms were great. All of the guys were super tentative! It has a great location, with two coffee shops in the first floor.",
      "date": null,
      "userInfo": "10 reviews",
      "photos": []
    },
    {
      "user": "Brian Tran",
      "rating": "5/5",
      "text": "The decor, details, the staff and the vibe everything about this hotel lobby and café. It's  the subtle elegance that keeps me coming back and just lounge with a drink and smile. The staff is always welcoming and friendly, no matter who you are. It´s clean and just feels right.",
      "date": null,
      "userInfo": "Local Guide · 644 reviews · 5,616 photos",
      "photos": []
    },
    {
      "user": "Chris Trechter",
      "rating": "4/5",
      "text": "Very comfortable bed and I couldn't hear any of my neighbors. These are really the two most important parts of any hotel. Definitely wish there was less hair all over the bed when we checked in but overall we had a good experience.",
      "date": null,
      "userInfo": "Local Guide · 361 reviews · 19 photos",
      "photos": []
    },
    {
      "user": "405 Broadway Penthouse Facts",
      "rating": "5/5",
      "text": "If you end up being locked out of 405 broadway overnight or not electricity or hot water. This hotel is the best. Cheap and cool place to chill. While you wait to figure out what to do with your life. Also a great meeting spot!",
      "date": null,
      "userInfo": "5 reviews · 1 photo",
      "photos": []
    },
    {
      "user": "Megan Casian",
      "rating": "4/5",
      "text": "Overall had a great stay! Location was perfect with great access to the subway and ease to get around SoHo, Chinatown and lower Manhattan + Brooklyn. The hotel itself was very nice & trendy as were the rooms.\n\nI know people have complained how small the rooms are but honestly for a solo traveler spending little time in the room it was perfect and everything was well thought out! I think much of the problem is people don't understand the size perhaps in comparison to their own rooms/other hotels. On the official Walker Hotel website not only do they give the square footage but they show a room floorplan and photos. I booked on Hotels.com and they did not give as much info so maybe it's third party websites not disclosing as much info that's leading to some surprises when people see the size of the rooms.\n\nOne qualm was that the Chromecast did not work. I tried multiple times and separately with my phone and iPad - nothing worked. Additionally, as others had mentioned no mini fridge and water only upon request. Also my room had a view right into a fabric/furniture factory (?) so I couldn't keep my shade open much but this might just be reality on lower floors of a hotel in a big city.",
      "date": null,
      "userInfo": "2 reviews",
      "photos": []
    },
    {
      "user": "Cesar Caicedo",
      "rating": "5/5",
      "text": "Flower shop roof top bar is amazing",
      "date": null,
      "userInfo": "17 reviews · 2 photos",
      "photos": []
    },
    {
      "user": "Tammy Vinson",
      "rating": "5/5",
      "text": "My go-to hotel in NYC. Super nice staff. Comfy bed. Well-designed and aesthetically pleasing. Good water pressure and toiletries. Lobby coffee, nice chairs, and occasional music are nice touches as well!",
      "date": null,
      "userInfo": "Local Guide · 173 reviews · 17 photos",
      "photos": []
    },
    {
      "user": "O H",
      "rating": "4/5",
      "text": "Love hate relationship. Loved how the room was so up to date. Hated how tiny the room was - but for one day only it was good. The pillows weren’t great. The bed was good. I paid a high price for a tiny room, but hope to try a larger room at a more reasonable price. Pillows need an upgrade though.",
      "date": null,
      "userInfo": "Local Guide · 140 reviews · 255 photos",
      "photos": [
        "https://lh5.googleusercontent.com/p/AF1QipOq-CHEYPbzaHHET4smdKgxsETDTxD9SX0R0aBQ=w300-h225-p-k-no",
        "https://lh5.googleusercontent.com/p/AF1QipPxfNbnL5Xz9_M6Pl_yelvwGdxc7Fe7eAEI016z=w300-h225-p-k-no",
        "https://lh5.googleusercontent.com/p/AF1QipNbwTTYbqJyXqndaHB3ENHzeaYaD_RJ4g_kEgRa=w300-h225-p-k-no",
        "https://lh5.googleusercontent.com/p/AF1QipNK6murwcCTcpXiBpk8M5hw_hQXXUoXAX06ePjc=w300-h225-p-k-no"
      ]
    },
    {
      "user": "Lillylee Lee",
      "rating": "5/5",
      "text": "If you want somewhere to just relax kick up it's cool",
      "date": null,
      "userInfo": "Local Guide · 142 reviews · 20 photos",
      "photos": []
    },
    {
      "user": "Kristen Phillips",
      "rating": "3/5",
      "text": "I stayed at the Walker Tribeca late last year. I liked the hotel lobby and coffee shop. It was nicely decorated with plants. The staff were friendly and helpful. The room was small, but that isn't uncommon in NY. The room was clean and the premisis were stylish and well-maintained. The gym was ok - I'm not sure whether I liked the tredmill equivalent equipment, but it was different! The one major drawback to my experience was how THIN the WALLS were. I could hear EVERYTHING from my neighbors activities next door, and it was disturbing. I called the hotel, and they offered to do a floor check. Eventually it quieted down but hearing very graphic sounds at night, into the early morning hours was quite unpleasant.",
      "date": null,
      "userInfo": "6 reviews · 1 photo",
      "photos": []
    },
    {
      "user": "Christie Schultz",
      "rating": "5/5",
      "text": "Walker Hotel Tribecca is beautifully designed (as an Interior Designer myself) and I really appreciate those details.\n\nStaff was extremely accommodating, welcoming, and attentive. Can't ask for more!\n\nThe room itself was comfortable, albeit a bit tight for myself as I'm used to my Texas home. It was perfect for our stay, and exactly what we needed. Loved it!",
      "date": null,
      "userInfo": "41 reviews · 57 photos",
      "photos": []
    },
    {
      "user": "Alba Aponte Muñoz",
      "rating": "5/5",
      "text": "Great coffee shop in the lobby.\nThe pistachio croissant is really world class.\nThey put a lot of effort into making every food they serve the most excellent in a very casual environment but still elegant and cool",
      "date": null,
      "userInfo": "Local Guide · 163 reviews · 411 photos",
      "photos": []
    },
    {
      "user": "Caroline Jan",
      "rating": "5/5",
      "text": "EXCELLENT SERVICE\nMy boyfriend and I stayed there for 17 days!! We had a very easy, welcoming and fast Check-In, done by Zach. The hotel is well located, its so close to Canal Street, Metro stations, Broadway, Little Italy and Chinatown. I loved the blue bottle coffee shop which is behind the hotels lobby area (the serve good coffee, better than the one from the lobby bar). There is a Gym, but I didnt use it.\nThere were cleaning issues with our room and the room we had was extremely small. My boyfriend informed the management, they took care and offered a solution. At the end we were really happy with the larger room and the better cleaning. What I liked about the rooms was the king bed and big TV. Also no need to insert any cards to get electricity (I hate that in other hotels). There was not enough light to do make up (bring your own mirror and use daylight). The view was not spectacular, but for us a cozy bed with TV and cleanliness were more important. Bathroom was ok. Little people might need help to get the shower head 😂 The reception was also extremely helpful regarding restaurants recommendations and reservation calls (@Steven, we tried Boqueria the other day and were rolling home that night! So yummy!). Go and talk to the reception staff, they are so nice, funny and helpful.\nWe really enjoyed our stay over Christmas and NYE and will consider coming back to Walker ❤️",
      "date": null,
      "userInfo": "Local Guide · 60 reviews · 18 photos",
      "photos": []
    },
    {
      "user": "Abby Bass",
      "rating": "5/5",
      "text": "Had a great stay here! Rooms are small but cool vibe and cozy. The rooftop, speakeasy and coffee shop are a great addition. Thank you to the team for helping with my accommodations and Nelson was super helpful!",
      "date": null,
      "userInfo": "2 reviews",
      "photos": []
    },
    {
      "user": "Mitchel Turner",
      "rating": "3/5",
      "text": "Weird location, felt closer to Chinatown then Tribeca. Rooms were extremely small. Online pictures made them look bigger, got the King Comfort room and thought that would be much larger than a 150sqft room",
      "date": null,
      "userInfo": "Local Guide · 101 reviews · 72 photos",
      "photos": []
    },
    {
      "user": "Jason Caponi",
      "rating": "5/5",
      "text": "Very nice but very tiny room; I am not sure if all of the rooms are this small so beware before brining kids.  This would be great for a couples getaway; very intimate and inviting hotel.",
      "date": null,
      "userInfo": "Local Guide · 73 reviews · 124 photos",
      "photos": [
        "https://lh5.googleusercontent.com/p/AF1QipOKe0ykrCHyaoEmOTQajllHzl7TOZlicvMu2DyP=w600-h450-p-k-no"
      ]
    },
    {
      "user": "Joanna Sable",
      "rating": "5/5",
      "text": "This hotel has one fabulous location. It is brand new and quite terrific. I love the lobby with its super cool vibe. The rooms as everyone has said are super small but hey it is NYC after all. I found mine really clean and love being on the top floor. I must say the rooms seem quite sound proof. Service was very attentive and always pleasant.\nI am looking forward to the Greenwich Village location as I hear the rooms are a bit bigger!\nPlease follow @joannasable on instagram for more food and travel fun.",
      "date": null,
      "userInfo": "Local Guide · 312 reviews · 2,633 photos",
      "photos": [
        "https://lh5.googleusercontent.com/p/AF1QipP1GuM_cYmY5_dsxy-y3MEeGh6GJtTLNukGp4Tl=w300-h225-p-k-no",
        "https://lh5.googleusercontent.com/p/AF1QipPi62tX90qL8nKwdhKZ21q0BLNkFiIq5anln3Me=w300-h225-p-k-no",
        "https://lh5.googleusercontent.com/p/AF1QipOSD1mzNRPQyNMKqZireY5ZzURmc8ZNMLNYNGdC=w300-h225-p-k-no",
        "https://lh5.googleusercontent.com/p/AF1QipOecFWSLedVHmfxPsTclizksokikMqnwZw_VTa9=w300-h225-p-k-no"
      ]
    },
    {
      "user": "Jacqueline Stephan",
      "rating": "1/5",
      "text": "Worse experience ever.  I am a New Yorker and have to say my stay here was awful. A fight broke out on the corner of the Walker Hotel amongst a crowd of 30 to 40 people around 3 am. My husband and I asked the concierge to contact the Police Department to break up the brawl but he stated that because it was off premises there was nothing he could do . He simply stood by and watched the crowd fight I had to call the Police. The entire ordeal was not handled properly and a supervisor should definitely investigate this matter for training purposes on how to handle these situations in the future if they should ever occur again. A refund would have been appreciated since I was unable to sleep nor enjoyed my stay",
      "date": null,
      "userInfo": "5 reviews · 4 photos",
      "photos": []
    },
    {
      "user": "Austin Viny",
      "rating": "5/5",
      "text": "I've never stayed at the Walker but have gotten drinks here and frequently do work on my computer in their lobby on the weekends.  I love this place.  The docor is extremely pretty and the couches / lounge area is very comfotable.  The best part about the Walker is definitely the employees.  I have always found them to be extremely warm, kind and considerate.  I felt motivated to write this post because I am so impressed with them.",
      "date": null,
      "userInfo": "5 reviews",
      "photos": []
    },
    {
      "user": "Felipe Rodrigues",
      "rating": "3/5",
      "text": "It’s fine. It’s more in Chinatown than in Tribeca itself. The intersection on the way from SoHo/Midtown can be a little creepy. Rooms are very tiny, so I do not recommend this place if you’re staying for more than 3 nights.\nWe booked the corner room with a “view”. Save your money and don’t book that room because it is not worthy. The rooftop was closed one night because it drizzled for about 10 minutes earlier that afternoon.\nThe bathroom light switch was broken; the shower is very tiny, and there’s no way to turn it on without getting cold water in your face. Idk, even though it’s a boutique hotel, I was definitely expecting for more.\nThe coffee shop downstairs is nice, though.",
      "date": null,
      "userInfo": "Local Guide · 113 reviews · 31 photos",
      "photos": []
    },
    {
      "user": "Shaul Sharabani",
      "rating": "5/5",
      "text": "I had an amazing stay in this hotel. From the check-in to check-out and during my stay the service was tremendous. The hotel is just opened, so there are a few renovations going on but that didn't effect the pleasure I had, since staff did everything to make me feel comfortable.\nThe room I stayed in is very well designed and the bed is comfortable as well, so all in all a very good stay and I'm sure once I get back to NY I'll stay in the same hotel.",
      "date": null,
      "userInfo": "7 reviews · 13 photos",
      "photos": []
    },
    {
      "user": "Christos Manolis",
      "rating": "2/5",
      "text": "Location is great. So is ambiance.\nService is poor, bordering on arrogant.\nReplenishments (water bottles, towels, toiletries) are stingy.\nRooms are tiny, even if you opt for a corner room.\nTake it from someone who’s stayed in a number of hotels in the area (11Howard, 50Bowery, The James - currently Modernhaus SoHo), this is not worth it",
      "date": null,
      "userInfo": "Local Guide · 27 reviews",
      "photos": []
    },
    {
      "user": "Simon Dent",
      "rating": "5/5",
      "text": "Check in was quick - staff attentive and friendly.  Room was compact but clean and well laid out.  Much better than my other experiences with Manhattan hotels",
      "date": null,
      "userInfo": "Local Guide · 71 reviews · 64 photos",
      "photos": []
    },
    {
      "user": "K Kiecker",
      "rating": "5/5",
      "text": "I arrived late in the evening on a Monday night.  The lobby was quiet, except for two gentlemen doing some light painting as they're still touching the place up after opening not too long ago.  Check-in is on the very bottom floor.  This place has the best vibe.  The décor was warm and inviting, and the gentlemen checking me in was great.  Happy smiley, open face, and personality!  Sensed his pride in the Walker and the transformation into a boutique Hotel.\nTraveled up the elevator to my room, appreciating the security measure of needing a key to get to your specific floor.  A clean narrow hall in muted tones guided me to my suite for the evening.\nI looooovvved my room, which was a Walker Full!  Incredibly good use of space for its size.  Have a look at the photo's on site.  They represent the room well and are not manufactured.  The bed was super comfy, room temp great, shower divine and all and all a cozy, perfect place for the night!  My only criticism is I wish I had been staying longer!",
      "date": null,
      "userInfo": "4 reviews",
      "photos": []
    },
    {
      "user": "Kathrin",
      "rating": "5/5",
      "text": "This place is sensational! We stayed in a beautiful room on the 9th floor waking up to a splendid and slightly different view each morning. The shower was absolutely magical (we spent quite some time analysing why; we agreed it was a combination of the perfect temperature and the softness of the water). The hotel is so modern and luxurious, very well designed with a high level of focus on details. Would advise to book for people who are comfortable to be naked around each other: the shower screen is see through and the bathroom door (where the toilet is) doesn't really close 100% so could be a little too personal for some guests. The staff was super friendly and very welcoming. We would love to visit again!",
      "date": null,
      "userInfo": "Local Guide · 134 reviews · 144 photos",
      "photos": []
    },
    {
      "user": "Sarah",
      "rating": "5/5",
      "text": "Our stay was incredible! So clean, beautiful, and kind staff.  The view is incredible and amenities are top notch.  The bed is the comfiest I’ve had from a hotel. Wouldn’t change a thing!  If you’re considering it, stay here! You won’t regret it. This is the only place I’ll be staying from now on!",
      "date": null,
      "userInfo": "Local Guide · 36 reviews · 11 photos",
      "photos": []
    },
    {
      "user": "Júlia",
      "rating": "1/5",
      "text": "The hotel lobby is beautiful but there were a few problems in our stay. First of all, the hotel front desk is located in the -1 floor which means Guests are not able to see the the staff when arriving at the hotel, so do not expect any personal service. When we arrived at the room, there were dirty spots at the bed and the shower was sinking. We reported to the concierge and do not receive any feedback about the problems during our stay. The worst thing that happened is that our door was left OPEN by the cleaning staff and we found out when we arrived at the hotel 11 PM. Our room door was left open for the entire day. I am extremely disappointed with the service of the hotel and would recommend to look into other options instead of this one.",
      "date": null,
      "userInfo": "1 review",
      "photos": []
    },
    {
      "user": "Gaby",
      "rating": "5/5",
      "text": "Very pretty rooftop at this moment, with all the flowers! It gives a good view of the skyline, and it has rather fairly priced glasses of wine / beer to refresh!",
      "date": null,
      "userInfo": "Local Guide · 106 reviews · 14 photos",
      "photos": [
        "https://lh5.googleusercontent.com/p/AF1QipPRDjkHHrb6N1O06pS40n8T4i_b1JDUQncw69cr=w600-h450-p-k-no"
      ]
    },
    {
      "user": "Phineas The Frenchie",
      "rating": "1/5",
      "text": "The lobby security person is very inappropriate. While leaving one of the restrooms and heading up stairs I heard them say “He must of blown that up” referring to the amount of time I spent in the restroom. What a disgusting and disrespectful thing to say. Not to mention the assumed gender pronoun used, but it’s also winter and people have layers etc on. A comment you’d expect at a frat house, not from the staff at a hotel in Tribeca.",
      "date": null,
      "userInfo": "Local Guide · 64 reviews · 14 photos",
      "photos": []
    },
    {
      "user": "Ally Lin",
      "rating": "5/5",
      "text": "Perfect experience staying in New York! Will definitely come back again! Gym is most of the time empty although it's slightly tiny. The lobby is beautiful!",
      "date": null,
      "userInfo": "Local Guide · 36 reviews · 42 photos",
      "photos": [
        "https://lh5.googleusercontent.com/p/AF1QipNIdoqfsSquAH_sM14oZY5GWMSld3RheAfqFyDp=w300-h450-p-k-no",
        "https://lh5.googleusercontent.com/p/AF1QipNO313CrdaXRlgIqFwkArPEMslJQiBvG3OarLwH=w300-h450-p-k-no"
      ]
    },
    {
      "user": "W G",
      "rating": "5/5",
      "text": "Staff was excellent! Rooms clean, small but served the purpose. Enjoyed the modern technology like lights/shade controls and casting home service on TV. Great water pressure in shower and plenty of hot water. Bed very comfortable and heat/ac was so quiet you couldn't tell it was on. Location central to lots of sites within walking distance. Safe area, never concerned about walking alone at night. I'll be back. Be sure to go to the Brandy Library a drink!",
      "date": null,
      "userInfo": "9 reviews · 8 photos",
      "photos": []
    },
    {
      "user": "Peter Gaston",
      "rating": "4/5",
      "text": "Really friendly service and a chic property. We liked our room, and were barely in the room at all, but be aware that some of the rooms are very small. They make amazing use of the space, but it's tight!",
      "date": null,
      "userInfo": "Local Guide · 50 reviews · 3 photos",
      "photos": []
    },
    {
      "user": "Brian McCormick",
      "rating": "5/5",
      "text": "5 stars- I highly recommend the Walker Hotel in Tribeca. This is a beautiful hotel and the rooms are really nice as well as comfortable. It's a very high-end boutique hotel which feels like a home away from home. Awesome location right on the Tribeca/ Soho border which is super convenient. The staff was incredibly helpful and made sure that I was well taken care of if I ever needed anything. This will be my go-to hotel whenever I'm in NYC and I'll be recommending it to all of my friends as well.",
      "date": null,
      "userInfo": "2 reviews",
      "photos": []
    },
    {
      "user": "Forrest Jones",
      "rating": "1/5",
      "text": "Moved rooms twice with no A/C in either. Checked in here with high hopes but didn’t stay longer than about 3 hours. The A/C in the first room wasn’t working when I checked in - no big deal I just called down to ask for someone to take a look while I grabbed a bite to eat. I come back and it’s still not working. I call down to the front desk and the receptionist says they can’t move me because they are all “booked up” even though they had rooms available online. Eventually the manger Matt calls me and says “you’re correct sir it seems you’re having a HVAC issue” - you don’t say Matt. He offers to move me to a new smaller room for the same price. I was being very polite while Matt was being rude and condescending while we were making the switch. I begrudgingly took the smaller room so that I wouldn’t have to spend my night looking for a new hotel. Low and behold the A/C is not working there either. I asked Matt if the whole building was having issues and he responded “nope just the rooms we are putting you in”. He offered no resolution almost expecting me to leave at this point.That was the last straw as I did not feel welcome here at all. No one apologized once and Matt had zero empathy for the fact that I would now have to try and find a new hotel at 9 o clock at night in a new City due to their lack of customer service. Ended up staying at Moxy in East Village, it was amazing! Do not recommend giving Walker your business mostly because of the manager there Matt.",
      "date": null,
      "userInfo": "10 reviews · 1 photo",
      "photos": []
    },
    {
      "user": "Lucy Xu",
      "rating": "5/5",
      "text": "Superb service, especially from the two doormen/bell boys. Room was small but space was clean and incredibly efficiently used - there was space to store everything out of the way for two. Bathroom was very comfortable. What more can you ask for?",
      "date": null,
      "userInfo": "3 reviews",
      "photos": []
    },
    {
      "user": "Jenny Gibbs",
      "rating": "1/5",
      "text": "Its Christmas Eve. All flights were cancelled about an hour ago. Now not only am I not able to be with my mom, I am out $400. The Walker pocketed the whole fee and refuses to rebook.\n\nHere is what Kim Arvic from Expedia said: \"I do apologize for the\ninconvenience, as much as\nwanted to help you with this. I\nexplained your side to them as the flight cancelled but they do not want to waive the penalty for this.\"\n\nTo which Scott Fredericks the Walker manager replied \" I would recommend booking directly with the hotel. We are aware of all your reviews and not (sic) of these are encouraging a different decision concerning the\nagreement you booked and agree (sic) to.\" In other words, don't book here using Expedia and don't share your experience in a review if you are hoping for a refund. Good to know.",
      "date": null,
      "userInfo": "Local Guide · 41 reviews · 6 photos",
      "photos": []
    },
    {
      "user": "Alex Dickman",
      "rating": "4/5",
      "text": "Good:\n\nThe hotel was brand new (opened Sep 2019) - electronic curtains, USB by the bed.\nThe staff was extremely helpful and friendly. From changes during our stay, to recommendations around, sent mail on my behalf and were constantly smiling and friendly.\nWe really liked the location (except one thing as listed below) - walking distance from Soho, very close to the subway. 7-eleven right on the corner of the street, a few restaurants close by. Not very touristic which was a big plus for us.\nThe price we paid was definitely good value for money.\n\nBad:\n\nThe rooms are very, extremely small. I've stayed at Manhattan hotels in the past and I expected a small space but this was something else. Very well thought of in terms of smart space usage but for a couple on a week long vacation to NY, with plenty of luggage, that was extremely uncomfortable. The hotel did switch us to a bigger room when we asked, but even the bigger room was significantly smaller then we're accustomed to.\nThe room was very poorly isolated. We could hear EVERYTHING that happened around us. Both from the street and from other rooms. We're not light sleepers but still we had a trouble sleeping, especially after 7am as there wasn't good light cover and the room got a lot of sunlight even with curtains on. We basically couldn't sleep past 7am or 8am tops. An afternoon nap (we tried) was completely impossible, because of above reasons but also house cleaning cleaned rooms with the door open around us very noisily.\nThe location was great (very close to subway, soho, far from most touristic areas) BUT very close to the hotel, on the way from the subway there was a corner with 3-10 homeless people. It was very uncomfortable passing through them every night. Sometimes we prefered to stay in as my wife was uncomfortable to come back late at night because of them.\nSome additional not critical but \"constructive\" feedback:\n- Some functionality in the room wasn't well installed - the toilet flushing cover was broken (we complained but wasn't fixed) so it fell off every time we flushed\n- It was very difficult to set the level of the electric curtains. Either completely up or completely down.\n- Our room wasn't cleaned every day. On our 3rd night we had to ask the front desk specifically to clean the room and get us more TP as it wasn't cleaned since we checked in. Same thing on our 6th night.",
      "date": null,
      "userInfo": "Local Guide · 104 reviews · 206 photos",
      "photos": [
        "https://lh5.googleusercontent.com/p/AF1QipO2suDepAgs7LqerUSNmvvFKQKrD1s-EO7f7_zt=w300-h450-p-k-no",
        "https://lh5.googleusercontent.com/p/AF1QipMGgiReFLD4-M6P0uhZ4bqOy0lmWP4g3NV42la4=w300-h225-p-k-no",
        "https://lh5.googleusercontent.com/p/AF1QipNowq-rQrByzSdGQ3-dCpbdwLVLBKey4mGcW6jB=w300-h225-p-k-no"
      ]
    },
    {
      "user": "R Xu",
      "rating": "4/5",
      "text": "Rooms are basically coffins but quiet so if u want to just sleep in a coffin to have a great night's sleep, it's awesome",
      "date": null,
      "userInfo": "11 reviews · 2 photos",
      "photos": []
    },
    {
      "user": "Charles Kerr",
      "rating": "5/5",
      "text": "The King room is super comfortable and well designed. This is the PERFECT hotel if you are looking to AVOID CATCHING COVID. The rooms have HUGE windows that open and it is NOT CENTRAL AIR. Each room's heat/AC is on a closed circuit meaning that the air that is heated or cooled comes from your room and not from anywhere else. This is the best hotel for hiding away from the pandemic",
      "date": null,
      "userInfo": "14 reviews",
      "photos": []
    },
    {
      "user": "Dede T",
      "rating": "5/5",
      "text": "I had the most amazing stay here during COVID. I was in town for work for just one night. Francis at the front desk couldn't have been any nicer or helpful when I asked him for food delivery options. The lobby is beautiful, and my room was amazing too. I hope I'll have to go back again soon :)",
      "date": null,
      "userInfo": "Local Guide · 142 reviews · 389 photos",
      "photos": []
    },
    {
      "user": "Becky Yee",
      "rating": "5/5",
      "text": "Great convenient location near all transportation. has a lovely lobby where you can work and also a great rooftop bar as well as a speakeasy in the side street in Courtland Alley. highly recommend",
      "date": null,
      "userInfo": "Local Guide · 11 reviews · 6 photos",
      "photos": []
    },
    {
      "user": "Célia",
      "rating": "5/5",
      "text": "As a huge fan of boutique hotels I approve this one. Very charming, attention to detail, comfortable with an ideal location in between Tribeca and Chinatown. We had a lovely stay and we will be back for sure!",
      "date": null,
      "userInfo": "Local Guide · 290 reviews · 2,124 photos",
      "photos": [
        "https://lh5.googleusercontent.com/p/AF1QipM6lZ2h0FH9K5j5kzi3TOgCEYfdaa1Tc1QH92G-=w300-h225-p-k-no",
        "https://lh5.googleusercontent.com/p/AF1QipPlXTm-kodR4R-gUxGImIRGljqNlo_Fcwr9xMgo=w300-h225-p-k-no",
        "https://lh5.googleusercontent.com/p/AF1QipP1Ro_m_i-MxrF_iGflhkLkAe67bPKPsDUf8JBX=w300-h225-p-k-no",
        "https://lh5.googleusercontent.com/p/AF1QipM3XsZ-uaA1fzUu4nKgrEvrN6hY00bwvHFaWvq1=w300-h225-p-k-no"
      ]
    },
    {
      "user": "M T",
      "rating": "5/5",
      "text": "Joshua Bellmen went above and beyond to assist today. Greatly appreciate his professionalism and help.",
      "date": null,
      "userInfo": "12 reviews · 2 photos",
      "photos": []
    },
    {
      "user": "Katja Smith",
      "rating": "3/5",
      "text": "Hotel was fine with a nice coffee shop downstairs. However reception and back office staff are rude and incapable. They completely messed up the charges of our group, overcharged my card (by about 5k!) and caused me hours of work to sort this out. Won't chose them again.",
      "date": null,
      "userInfo": "5 reviews",
      "photos": []
    },
    {
      "user": "Vern Kreuter",
      "rating": "5/5",
      "text": "Quaint hotel in the heart of tribeca. Rooms are  small, but functional and cozy. The bar and coffee shop downstairs are very convenient for late nights or early mornings. Location is excellent, close proximity to China town, little italy, subway station on canal st, etc. Staff were friendly and helpful. Would definitely stay here again.",
      "date": null,
      "userInfo": "Local Guide · 181 reviews · 491 photos",
      "photos": []
    },
    {
      "user": "Jalesh Melwani",
      "rating": "2/5",
      "text": "Concierge would not accept my Mastercard credit card from Canada which requires tap/insert, however they also refused to key-in my credit card number, making it extremely difficult to pay for my hotel room. At this point, I was treated like I did not 'belong' at this hotel because they could not accept my method of payment. After arguing for 15 minutes they finally keyed in my number which worked perfectly. Now that I am checking my credit card statement, I can see that I was charged twice for my stay. The rude attitude and hassle of being charged was not worth the stay.",
      "date": null,
      "userInfo": "1 review",
      "photos": []
    },
    {
      "user": "Andrej Rusakov",
      "rating": "1/5",
      "text": "The room is basically the bed. Wall-to-wall-to-window the bed is directly attached on three sides to the three walls of the room.  The bed takes up 95% of the room.  You walk into the bed - it is one step from the door.  You living space is 5x5 feet space right in front of the bed on one side of it right between the bed and the door.  The worst value for money in the world.",
      "date": null,
      "userInfo": "2 reviews · 2 photos",
      "photos": [
        "https://lh5.googleusercontent.com/p/AF1QipMLNlEnr7YYBlVYuEAS2xUJ65EV9bFiHiotRJOC=w600-h450-p-k-no"
      ]
    },
    {
      "user": "Frank Matheis",
      "rating": "2/5",
      "text": "The room was barely big enough for two people to stand up. Small even by new York standards. No AC all night long, so it was sweltering and sticky. The staff was friendly the bed sheets clean, and we had hot water. The pillow was thin and lumpy. We will never go back.",
      "date": null,
      "userInfo": "Local Guide · 106 reviews · 6 photos",
      "photos": []
    },
    {
      "user": "Michael Lis",
      "rating": "5/5",
      "text": "Walker Hotel Tribeca is an excellent hotel with amazing service. Steven at the reception desk was kind enough to print package label and help me navigate my stay. I even extend my stay an extra night. Beautiful kind room with sleek and contemporary modern design all over. Love the hotel lobby and coffee shop. Perfect for working remotely. Thank you Steven!",
      "date": null,
      "userInfo": "15 reviews · 14 photos",
      "photos": [
        "https://lh5.googleusercontent.com/p/AF1QipO1capxdfEdbocum0obfgRN3KLGWP1I2Fz6dpuc=w300-h450-p-k-no",
        "https://lh5.googleusercontent.com/p/AF1QipM5FztglQFiDClQD_wnCwrn4Lx_3o7nYFARCV60=w300-h450-p-k-no"
      ]
    },
    {
      "user": "Silvia Wu",
      "rating": "2/5",
      "text": "We arrived at midnight and receptionist gave us the smallest room, which is clearly on the map on the door. Also I am pretty sure this room is for one person since the bed is in full size and only one robe in the closet, which makes me really confused about the arrangement of the room.\nI already have the idea that the room would be small, but I still want to try this hotel since the decorations looks pretty nice.\nBTW we waiting 30 mins for the slippers and cancelled at last...",
      "date": null,
      "userInfo": "5 reviews · 1 photo",
      "photos": []
    },
    {
      "user": "jay corriveau",
      "rating": "3/5",
      "text": "We upgraded our room and the bed still touched three of the four walls. Incredibly tiny NY rooms. I question if this is in Tribeca, as it is in the heart of Chinatown.\n\nLobby is fine to hangout in or to work from. Generic bath amenities (Bigelow?) and no real work surface in the room. TV interface is overly complicated.\n\nIf you need a bed and the price fits your budget, here you go.",
      "date": null,
      "userInfo": "Local Guide · 164 reviews · 34 photos",
      "photos": []
    },
    {
      "user": "Nadine",
      "rating": "2/5",
      "text": "The hotel and the location are fine! Nothing amazing but for the price is perfect. The real reason this experience was bad is because of the service. It is terrible. Very disappointed with the front desk and in general just everyone seemed annoyed to do their job, one cup for coffee seemed impossible ( they would give you coffee but no cups 😐), would not recommend to stay here. Go somewhere else even if it's a bit more pricey.",
      "date": null,
      "userInfo": "Local Guide · 13 reviews · 9 photos",
      "photos": []
    },
    {
      "user": "Andrew Hua",
      "rating": "3/5",
      "text": "It was cozy and cute stay. The wifi and technology was a hit and a miss in the room. The staff were kind. There was room damage as well. It didn't significantly hinder the trip but I would sink in to the hole in the ground every so often when I went to the restroom.",
      "date": null,
      "userInfo": "2 reviews",
      "photos": []
    },
    {
      "user": "Gabriela Bortz",
      "rating": "5/5",
      "text": "Very good hotel, well located between Tribeca and the Soho. Rooms are small, but is something recurrent in Manhattan. We managed to walk almost all our way into NYC. The treatment by the staff is great, kind and helpful. Special mention to Jay at the door, it was great to meet him!!",
      "date": null,
      "userInfo": "Local Guide · 58 reviews · 65 photos",
      "photos": []
    },
    {
      "user": "Gee Hue",
      "rating": "5/5",
      "text": "Fantastic place with completely excellent service. the young lady at the front desk/counter was amazing, she was highly delightful to converse with especially attractive to look at and very insiteful to question about availability of rooms. She always was very knowledgeable about current events and how those said events are effecting her place of employment/business. This isn't the greatest neighborhood, during the day there was homeless people abound all around the area in literally every single direction and Just Around the corner there seems to be an alleyway where homeless tend to congrigate, inject drugs, openly use the bathroom and dedicate literally out in the street. But other then that, the actual inside of this place is quiet fancy, I recently had a room on the 5th floor and I felt as though is was literally the best bargain price I've ever paid for a hotel room In my entire life and that it was an extremely well maintained and groomed room especially for the price",
      "date": null,
      "userInfo": "350 reviews",
      "photos": []
    },
    {
      "user": "connorado9",
      "rating": "5/5",
      "text": "The Walker Hotel Tribeca was lovely. The mid century modern vibe is exactly as advertised, and the lobby is impeccable. The cafe and lobby bar are so convenient, as well as the nearby subway hub on canal street. I was surprised to hear the rooftop bar is also open until 2am (though it closed early on us due to weather). Pro Tip: the stairwell to the roof is unlocked! Location is great right at the corner of Chinatown, Little Italy, SoHo and Tribeca. Although rooms are small and cleaning could be improved, they work well and have lots of hidden storage. All in all, I highly recommend staying at Walker Hotel!!",
      "date": null,
      "userInfo": "Local Guide · 347 reviews · 540 photos",
      "photos": [
        "https://lh5.googleusercontent.com/p/AF1QipM5gD480qBmaqQemBJk2N_9LfB-39qoAssjBl2q=w300-h225-p-k-no",
        "https://lh5.googleusercontent.com/p/AF1QipNofkHL5byCNpmt2rbE9M7YE4-6wJKlGIOmhcD6=w300-h225-p-k-no",
        "https://lh5.googleusercontent.com/p/AF1QipPcqcl8z8UP4QUbo5RqJHAu0aTXyjlV223mOzuN=w300-h225-p-k-no",
        "https://lh5.googleusercontent.com/p/AF1QipOrwHv897AfqMGdSDTBPb2Tm5zSHGpp5LxLOhBG=w300-h225-p-k-no"
      ]
    },
    {
      "user": "Tamara Jones",
      "rating": "5/5",
      "text": "Fantastic hotel - will stay here every time I'm passing through NYC. Staff, decor, views, everything was great.\n\nOnly note- wifi is really weak. Could take conference calls but it definitely struggled, had to find cafes to work from instead.",
      "date": null,
      "userInfo": "Local Guide · 141 reviews · 70 photos",
      "photos": []
    },
    {
      "user": "Ramzi",
      "rating": "1/5",
      "text": "I would avoid if you want a no-worries stay (especially for business).\n\nPros: Staff are generally kind.\n\nCons: Lack of seriousness regarding issues raised by customers. Reported a heating issue on day 1 of my stay, where the air conditioning was not working and the window did not full close. Reminded the staff every day for the next 4 days about the issue, and 8 days later, the problem has still not been looked into. Yes, that meant staying in a room where -6°C freezing winter air was coming through.\nOne staff member was kind enough to install a “temporary” electric heater (thank you again!) on day 5 which ended up being used for the whole stay since no one bothered to fix the window and heating.\n\nAlso, spent 3 days asking for the safe to be unlocked so I could use it, but eventually gave up.",
      "date": null,
      "userInfo": "12 reviews",
      "photos": []
    },
    {
      "user": "Joseph Alfie",
      "rating": "5/5",
      "text": "Great Staff. Clean Rooms. Great Location. Fantastic rooftop bar and beyond amazing coffee in the lounge area. will definitely be coming back, they care about their clientele!",
      "date": null,
      "userInfo": "Local Guide · 47 reviews · 1 photo",
      "photos": []
    },
    {
      "user": "Brennan Fox",
      "rating": "2/5",
      "text": "The concierge / bartender on floor 1 was extremely rude and overbearing for guests of the hotel when trying to have 1 drink at one of the bar options - made 4 of us feel super uncomfortable and we chose to leave",
      "date": null,
      "userInfo": "43 reviews · 7 photos",
      "photos": []
    },
    {
      "user": "Rey Tanada",
      "rating": "5/5",
      "text": "Wow, what can I say about the Walker Tribeca? I had a bit of a transcendent experience but I'll try my best to describe my stay.\n\nLocation:\nNestled between Chinatown and Tribeca, with SoHo's shops a brief jaunt up Broadway, the only problem with the hotel's location is figuring out which of the many sights, sounds, tastes, and feels you want to explore first. Canal St. Station is right around the corner for excursions outside the immediate area. You hungry? Feast your eyes and ears on a cacophony of halal carts and myriad cafes offering priced sustenance (who is to say what is over or under?).\n\nAmbience:\nThe air conditioning was cool, especially during NYC's sweltering summer humid swamp season--but the lobby is even cooler. Reception is in the lower floor, a Blue Bottle cafe affixed to a decidedly modern-chic first floor. When you start feeling a bit claustrophobic from working out of your admittedly cozy suite, make your way down to the cafe and feel free to conduct your all day on-site interviews there (don't forget your noise canceling headphones!). The aesthetic was perfect for what I was looking for, and I wasn't even looking for anything in particular. It just felt right.\n\nAmenities:\nI could drone on and on about \"amenities\" like the awesome picturesque 12th floor rooftop bar, or the luxurious food and drink in the first floor barestaraunt, or the **redacted** (you'll have to make friends in order to find out what awesome amenity this is referring to). But ultimately, it's the people that made this an essential part of my NYC city experience. In my unplanned extended residence at Walker Tribeca, the staff really made me feel right at home. No exaggeration. From Luis, to Lisa, Cory, Chris, Chris, Joe, and a few others I've undoubtedly missed, they treated me both as a welcome guest and dear friend. Several nights I convinced myself to call an audible because the drinks and conversation were so engrossing at the Hotel bars\n\nIn summary, if you are looking for a centrally-located base of operations to take on NYC, you would be hard-pressed to find an experience quite like Walker Tribeca. Thank you again to the whole staff for an unforgettable stay.",
      "date": null,
      "userInfo": "2 reviews · 1 photo",
      "photos": []
    },
    {
      "user": "Hana",
      "rating": "5/5",
      "text": "The service here is amazing: thoughtful and warm. Thanks Fatima❤️ and the entire staff.\nI think it’s better to go to a higher floor because of the noise. Otherwise? It was fantastic",
      "date": null,
      "userInfo": "Local Guide · 141 reviews · 2,927 photos",
      "photos": []
    },
    {
      "user": "Ben Danna",
      "rating": "4/5",
      "text": "Nice hotel in a nice location at a reasonable rate but service could be slightly improve. Also kinda weird, and a pain if you have a lot of luggage, is that there are stairs up or down right as you enter - before you have access to an elevator or check in",
      "date": null,
      "userInfo": "21 reviews",
      "photos": []
    },
    {
      "user": "Christine Khamisi",
      "rating": "5/5",
      "text": "Friendly staff, cool lounge, and cute rooms!  The location was great for us, just a short walk to the subway or to our new favorite pizza place (Manero's in Little Italy!).",
      "date": null,
      "userInfo": "17 reviews · 10 photos",
      "photos": []
    },
    {
      "user": "Troy Farlow",
      "rating": "5/5",
      "text": "The Walker Hotel was amazing!  While the rooms were charming, nice, well appointed, with marble bathrooms, and great views, etc, etc., it was the HOTEL STAFF that made it truly amazing.  The people that work at the Walker are SINCERE.  As in, they actually give a damn!  And well, that's priceless.  I highly recommend The Walker Hotel.",
      "date": null,
      "userInfo": "7 reviews",
      "photos": []
    },
    {
      "user": "alex m",
      "rating": "1/5",
      "text": "The customer care person was not helpful and rude.\nThe hotel room offered was not aligned with the description.\nThey even gave me trouble when requested to be invoiced.\nTerrible - stay way.",
      "date": null,
      "userInfo": "3 reviews",
      "photos": []
    },
    {
      "user": "Rick Hochman",
      "rating": "5/5",
      "text": "Rooms have been updated with the latest electronics while retaining the old world charm. View from the rooftop bar is spectacular. If you can find the speakeasy after roof closes, it will be well worth it.",
      "date": null,
      "userInfo": "Local Guide · 70 reviews · 144 photos",
      "photos": [
        "https://lh5.googleusercontent.com/p/AF1QipPGWpIKthCIw30pV4J5__7HVs99dbc-CWOedBRP=w300-h225-p-k-no",
        "https://lh5.googleusercontent.com/p/AF1QipNdf5gVhRR4Cp8egQJs_7rBDQFzFqT_AxXPFXjt=w300-h225-p-k-no",
        "https://lh5.googleusercontent.com/p/AF1QipNmt649sDI36txDhN3ZbUEiYu_QTzF2kyUV1ZBb=w300-h225-p-k-no",
        "https://lh5.googleusercontent.com/p/AF1QipODJCXjJg5Wc-HK2E3JItviRx6KqdaMYN4lX152=w300-h225-p-k-no"
      ]
    },
    {
      "user": "Caitlin Cardwell",
      "rating": "5/5",
      "text": "Excellent amenities, clean, and in a great location. Would highly recommend.",
      "date": null,
      "userInfo": "Local Guide · 269 reviews · 71 photos",
      "photos": []
    },
    {
      "user": "Victoria Queen",
      "rating": "5/5",
      "text": "Lovely hotel. Great location and mind-blowing view! Be aware, that the bar is not open every day and there is no breakfast on Monday.",
      "date": null,
      "userInfo": "101 reviews · 23 photos",
      "photos": []
    },
    {
      "user": "Leanne",
      "rating": "5/5",
      "text": "Great location close to lots of subway lines. Rooms are small but has everything you need. Great coffee next door.",
      "date": null,
      "userInfo": "6 reviews · 1 photo",
      "photos": []
    },
    {
      "user": "Eshika Patel",
      "rating": "4/5",
      "text": "i only went to the coffee shop, good place to work but the wifi is really bad. i would only go if u bring ur own hotspot. but a lot of people work in the lobby/coffee shop area!",
      "date": null,
      "userInfo": "Local Guide · 160 reviews · 139 photos",
      "photos": []
    },
    {
      "user": "Maria M",
      "rating": "5/5",
      "text": "Love it!  Love the gym design.\nStaff super friendly. Eli helped me tons with all my luggage during my checkout. It wasn’t even his responsibility and he was way too nice to help me! He was my hero.",
      "date": null,
      "userInfo": "15 reviews · 2 photos",
      "photos": []
    },
    {
      "user": "Dimitri Ivanoff",
      "rating": "5/5",
      "text": "Brand new hotel located in Tribeca area, just off the Canal Street. Walking distance to Little Italy and SoHo. Very friendly service, reasonable prices. Please note that rooms are on a smaller size - perfect for a weekend getaway but probably won't work for a week long vacation, YMMV.\nAs of now (January 2020) hotel restaurant is not yet finished, but Chinatown is 5 minutes away including 24-hours places. Hotel lobby has a small bar and Cafe.\nLyft ride from Penn station is about 20-25 minutes.",
      "date": null,
      "userInfo": "Local Guide · 357 reviews · 5,874 photos",
      "photos": [
        "https://lh5.googleusercontent.com/p/AF1QipPuBHdAm0Z8NXIo8EbRxCeTUXIMH6MkFOiwK-wk=w300-h225-p-k-no",
        "https://lh5.googleusercontent.com/p/AF1QipNVwGBRykks7VQoJjsyyXzckXoZlCeV6bITvo2j=w300-h225-p-k-no",
        "https://lh5.googleusercontent.com/p/AF1QipPNIiagB8tCB42O87gqbY-gkbNHt0GsenlYFAp7=w300-h225-p-k-no",
        "https://lh5.googleusercontent.com/p/AF1QipNTW8s3vELZpO3XauQ9lTZiru17rD0ki3cgwiNE=w300-h225-p-k-no"
      ]
    },
    {
      "user": "Amanda Messenger",
      "rating": "5/5",
      "text": "Although the room was quite small, it was perfect for my needs, with a lovely view. The staff was so helpful and accommodating. I would definitely stay again !",
      "date": null,
      "userInfo": "8 reviews",
      "photos": []
    },
    {
      "user": "Natalie Waechter",
      "rating": "1/5",
      "text": "The smallest hotel I have ever stayed in.  Awful.  Not advertised as a “micro” hotel.   Front desk insisted that’s what it was. Received pushback from asking for extra hangers.",
      "date": null,
      "userInfo": "12 reviews · 1 photo",
      "photos": []
    },
    {
      "user": "mariana qb",
      "rating": "3/5",
      "text": "The room is clean, very tight but good design. The Wifi is NOT GOOD in the room! It's very unstable. Everything is smart, but not everything works – some lights in my room were not working.",
      "date": null,
      "userInfo": "Local Guide · 85 reviews · 192 photos",
      "photos": []
    },
    {
      "user": "Noa",
      "rating": "5/5",
      "text": "One if the best hotel experience I ever had!\nAmazing team, great location with everything around-good food, bars, art galleries and shops.\nAlso the hotel have amazing bar and rooftop !! Just perfect",
      "date": null,
      "userInfo": "6 reviews · 10 photos",
      "photos": []
    },
    {
      "user": "Mr. Dolor",
      "rating": "5/5",
      "text": "Our stay was excellent! Reservations were quick and simple to book online. From the location, to the amenities, and service teem in place, Walker Hotel Tribeca is a fun and easy way to enjoy the big city in style and comfort!",
      "date": null,
      "userInfo": "5 reviews · 1 photo",
      "photos": []
    },
    {
      "user": "Catie Case",
      "rating": "5/5",
      "text": "My new favorite hotel jn downtown NYC. Great for work trips bc the rooms are comfortable and feel homey. Staff is friendly and the new restaurant is fab.",
      "date": null,
      "userInfo": "Local Guide · 141 reviews · 388 photos",
      "photos": [
        "https://lh5.googleusercontent.com/p/AF1QipMXfBfk_2zfNDx2rse0roy7M6tPVtwQOpkuGwrc=w300-h450-p-k-no",
        "https://lh5.googleusercontent.com/p/AF1QipM_ctaqRPe7aUXiOcwZ0yKBhEX9tHBtb9PYaCst=w300-h225-p-k-no",
        "https://lh5.googleusercontent.com/p/AF1QipOYNldA66TuSXtY0QC-Sb5YTT7NytKMk_7Rv5en=w300-h225-p-k-no"
      ]
    },
    {
      "user": "Michal Levy",
      "rating": "4/5",
      "text": "Quite small room, but for a one person it us OK. Great location next to all must seen places in the Soho!",
      "date": null,
      "userInfo": "8 reviews · 86 photos",
      "photos": []
    },
    {
      "user": "Felix Frank",
      "rating": "2/5",
      "text": "Don‘t go in winter. The window in my room did not close properly and since the bed is directly next to the window it was really cold at night. Also, despite asking several times, I could not get a second blanket.",
      "date": null,
      "userInfo": "5 reviews",
      "photos": []
    },
    {
      "user": "Kutluhan Bayram",
      "rating": "5/5",
      "text": "Pillows are garbage, but I don’t want to be mean and give a 4 because it’s a great hotel. Fix your pillows tho.",
      "date": null,
      "userInfo": "Local Guide · 26 reviews · 5 photos",
      "photos": []
    },
    {
      "user": "Stefan Müller",
      "rating": "5/5",
      "text": "Located in lower Manhattan, near to a subway station. You can reach all the highlights of NYC real quick. Modern hotel, nice rooms, top Service. Everything was absolutely perfect",
      "date": null,
      "userInfo": "10 reviews",
      "photos": []
    },
    {
      "user": "Corinne Margo",
      "rating": "5/5",
      "text": "It is perfect and everyone is super friendly! I also love the different \"play spaces\" such as lounge, roof, coffee shop, and speak easy!",
      "date": null,
      "userInfo": "Local Guide · 67 reviews · 39 photos",
      "photos": []
    },
    {
      "user": "Will Levy",
      "rating": "5/5",
      "text": "Joshua the bellman was very helpful and courteous. Thank you",
      "date": null,
      "userInfo": "1 review",
      "photos": []
    },
    {
      "user": "Holly Bastin",
      "rating": "5/5",
      "text": "The Walker Hotel was wonderful, the room was tidy and simple- all I needed with a little extra for convenience. The staff was the best part. They were super accommodating to some random requests and did everything they could to make sure I had a great experience. Thanks y'all!",
      "date": null,
      "userInfo": "Local Guide · 49 reviews · 45 photos",
      "photos": []
    },
    {
      "user": "Miguel Zapata",
      "rating": "1/5",
      "text": "This doesn't have a bar, Doesn't have a rooftop, doesn't have a restaurant, rooms are beyond Small. They were office Spaces converted into Rooms. The elevator is constantly getting stuck, also the fire alarm panel is forever going off. And Top of that they have bed bugs",
      "date": null,
      "userInfo": "Local Guide · 5 reviews",
      "photos": []
    },
    {
      "user": "Rob",
      "rating": "5/5",
      "text": "This is a beautifully maintained, clean, hip, fun hotel in a great location. The staff is incredibly friendly (just meet Belle). You will love it.",
      "date": null,
      "userInfo": "44 reviews",
      "photos": []
    },
    {
      "user": "Fleur Suijten",
      "rating": "5/5",
      "text": "My stay in the Walker Hotel Tribeca was really excellent! I can recomment it for sure! Easy to walk to midtown or visit lower Manhattan. Rooms are very clean. Perfect service and modern interior. Next time I go to NY I will visit again.",
      "date": null,
      "userInfo": "8 reviews · 4 photos",
      "photos": []
    },
    {
      "user": "Lan C",
      "rating": "4/5",
      "text": "The lobby here is the new living room for quick coffee breaks and work meetings. There is a Blue Bottle Coffee off the lobby. Afternoons, the lobby bar has beer, wine, coffee, and fresh baked cookies.",
      "date": null,
      "userInfo": "Local Guide · 236 reviews · 355 photos",
      "photos": [
        "https://lh5.googleusercontent.com/p/AF1QipN_pyIpz-Dl0tGMTtVI5VOPoSN8RWYYsM1vvW1S=w600-h450-p-k-no"
      ]
    },
    {
      "user": "Eric Amador",
      "rating": "5/5",
      "text": "Great location, efficient room layout, awesome rooftop bar, and a Blue Bottle Coffee in the lobby. Really could not have asked for more from my stay.",
      "date": null,
      "userInfo": "2 reviews · 2 photos",
      "photos": []
    },
    {
      "user": "Nicole S",
      "rating": "4/5",
      "text": "Came to the flower shop rooftop pop up! Nice views and beautiful decor. Definitely recommend!",
      "date": null,
      "userInfo": "Local Guide · 170 reviews · 449 photos",
      "photos": [
        "https://lh5.googleusercontent.com/p/AF1QipMJxI9DUXF-xvfH0rimIKX5AdNUnDKGxyWtSTYZ=w600-h450-p-k-no"
      ]
    },
    {
      "user": "Hina amin",
      "rating": "5/5",
      "text": "Nice clean hotel with accessible location. Friendly staff and Francis at the front desk very nice and helpful every time we asked for anything. We’ll stay again whenever visit NYC.",
      "date": null,
      "userInfo": "11 reviews · 2 photos",
      "photos": []
    },
    {
      "user": "Emmanuel et Floriane",
      "rating": "1/5",
      "text": "Do not recommend this place - Rude staff, dirty room\n+: * Well located that's all\n-: * Rude staff specially Micheal (night shift - who did not answer phone - I had to take him and asked him to answer the phone because Booking assistance needed to talk with hotel staff)\n* So dirty specially bathroom - Look at the pictures\n* Bad maintenance of room - Clearly not a 4 stars hotel",
      "date": null,
      "userInfo": "23 reviews · 10 photos",
      "photos": [
        "https://lh5.googleusercontent.com/p/AF1QipMIeDf48aWzR158uwIP6St9n0Ja547f1iwDpDGj=w600-h450-p-k-no"
      ]
    },
    {
      "user": "Cath Moore",
      "rating": "4/5",
      "text": "Great location, very small rooms but comfortable. I had a great city view.",
      "date": null,
      "userInfo": "8 reviews · 10 photos",
      "photos": [
        "https://lh5.googleusercontent.com/p/AF1QipPbxP220xZyuMmpFp85rXobLRQ4x1GJHaoBdgJ-=w300-h450-p-k-no",
        "https://lh5.googleusercontent.com/p/AF1QipNQWrzfKqOwtLci2XP5VjOQab2cuCwgnUFm9U-5=w300-h225-p-k-no",
        "https://lh5.googleusercontent.com/p/AF1QipMyNbes2LdgJxIhBw6aY3vy8orpoY6epXLqUYWm=w300-h225-p-k-no"
      ]
    },
    {
      "user": "Justin De Moulin",
      "rating": "5/5",
      "text": "Excellent place, classy and small room. Loved the style. Great rooftop views.",
      "date": null,
      "userInfo": "105 reviews · 60 photos",
      "photos": []
    },
    {
      "user": "B Johnson",
      "rating": "1/5",
      "text": "Room was adequate, front desk was friendly but unable to charge the correct card (corporate vs personal) despite repeated requests.  The workout room is utterly inadequate.",
      "date": null,
      "userInfo": "2 reviews",
      "photos": []
    },
    {
      "user": "Nilou Shahryari",
      "rating": "5/5",
      "text": "Nelson was SO friendly. I don’t normally write reviews but felt like he deserved some recognition.",
      "date": null,
      "userInfo": "11 reviews",
      "photos": []
    },
    {
      "user": "Hi Wang",
      "rating": "5/5",
      "text": "Excellent lodgings, clean and modern. Friendly staff as well. Rooms were small but you don’t come to nyc to stay in a hotel room",
      "date": null,
      "userInfo": "Local Guide · 37 reviews · 24 photos",
      "photos": []
    },
    {
      "user": "Kathleen McDowell",
      "rating": "1/5",
      "text": "all 5 of their lobby bathrooms said \"out of order\" and when I asked for assistance and guidance ...their concierge were unhelpful and unapologetic",
      "date": null,
      "userInfo": "6 reviews · 16 photos",
      "photos": []
    },
    {
      "user": "Cesar Naranjo",
      "rating": "3/5",
      "text": "Just okay. Rooms too small even for NYC standards. The floors were uneven and the ventilation system wasn't great.",
      "date": null,
      "userInfo": "Local Guide · 26 reviews · 13 photos",
      "photos": []
    },
    {
      "user": "Ash P",
      "rating": "5/5",
      "text": "Bluebottle on the ground floor is super.\nFriendly staff. Room is compact but everything we need is there.",
      "date": null,
      "userInfo": "Local Guide · 156 reviews · 59 photos",
      "photos": [
        "https://lh5.googleusercontent.com/p/AF1QipNLdFx3rYCe6fzMK-jTuPd8WjbxhOrZ-5OfI4Ce=w300-h450-p-k-no",
        "https://lh5.googleusercontent.com/p/AF1QipOkcCJnVlwwsdgtF_hLBYdEyHqLn8Tiu4W9bm0z=w300-h450-p-k-no"
      ]
    },
    {
      "user": "Tracey Gill",
      "rating": "4/5",
      "text": "Rooms are extremely small, but comfortable mattress.  Nice lobby with a coffee for relaxed seating.",
      "date": null,
      "userInfo": "Local Guide · 44 reviews · 649 photos",
      "photos": []
    },
    {
      "user": "Tair Korf",
      "rating": "5/5",
      "text": "The stuff is amazing, so king and willing to help any time.\nThe rooms are clean and nice and the entire hotel is really pretty and new",
      "date": null,
      "userInfo": "5 reviews · 2 photos",
      "photos": []
    },
    {
      "user": "MrRainingHeavy",
      "rating": "4/5",
      "text": "Rooms are small, especially for the price.\nStaff friendly and helpful.\nBusy coffee shop on the 1st floor.",
      "date": null,
      "userInfo": "Local Guide · 21 reviews · 1 photo",
      "photos": []
    },
    {
      "user": "Logan Gentry",
      "rating": "3/5",
      "text": "A good deal in a good location, but the rooms are tiny. Better to visit the lounge, rooftop bar and speakeasy than to actually stay.",
      "date": null,
      "userInfo": "2 reviews",
      "photos": []
    },
    {
      "user": "Ceng Sagnic",
      "rating": "3/5",
      "text": "There is no parking here. So it better be corrected. Parking is three blocks away. Otherwise convenient, small but functional hotel.",
      "date": null,
      "userInfo": "Local Guide · 18 reviews · 1 photo",
      "photos": []
    },
    {
      "user": "shay **",
      "rating": "1/5",
      "text": "I was temporarily charged 200$ for incidentals upon arrival. It has been 12 days now, and the money still has not been refunded back to my account.",
      "date": null,
      "userInfo": "4 reviews · 1 photo",
      "photos": []
    },
    {
      "user": "Jojo",
      "rating": "4/5",
      "text": "Loved the style and decor.  Room wasn’t anything special though. Small space, but that’s nyc. Try the speakeasy downstairs. Great location.",
      "date": null,
      "userInfo": "42 reviews",
      "photos": []
    },
    {
      "user": "Shant Davidian",
      "rating": "5/5",
      "text": "Location was great, staff was friendly and knowledgeable, rooms were modern and comfortable. Open bar, rooftop bar, cafe, Needed iron, but was none.",
      "date": null,
      "userInfo": "Local Guide · 360 reviews · 697 photos",
      "photos": []
    },
    {
      "user": "Jacqueline Piccini",
      "rating": "5/5",
      "text": "It’s a beautiful hotel, young and modern, I went to the roof and it’s an amazing view, the service staff were super friendly, nice cocktails.",
      "date": null,
      "userInfo": "Local Guide · 37 reviews · 10 photos",
      "photos": []
    },
    {
      "user": "MT",
      "rating": "5/5",
      "text": "Incredibly tasteful and great service and atmosphere. Amazing value for money compared to other NYC hotels. Will return!",
      "date": null,
      "userInfo": "Local Guide · 71 reviews · 24 photos",
      "photos": [
        "https://lh5.googleusercontent.com/p/AF1QipO-YHvDPZdtTcRjyTM1QhbmrWkf825kM4m7-zEo=w300-h225-p-k-no",
        "https://lh5.googleusercontent.com/p/AF1QipMB37PDzT3CuiSeimjgCNrK0uvHMWkopuzAISUh=w300-h225-p-k-no",
        "https://lh5.googleusercontent.com/p/AF1QipPPN8zBwY7tk5_T5xm-12KrtFzWv0mx23o-H2Iq=w300-h225-p-k-no",
        "https://lh5.googleusercontent.com/p/AF1QipPNM4ARic9l37agpf6YvWLEqh-g0I_Yn71FGzMv=w300-h225-p-k-no"
      ]
    },
    {
      "user": "Trip.com Member",
      "rating": "3.2/5",
      "text": "Rooms were exceptionally tiny, even by New York standards. Very friendly staff",
      "date": null,
      "userInfo": null,
      "photos": []
    },
    {
      "user": "Matt Donohoe",
      "rating": "5/5",
      "text": "Rooms are small but that’s expected in nyc. Clean, great design, really cool bathroom/shower. Would recommend.",
      "date": null,
      "userInfo": "3 reviews",
      "photos": []
    },
    {
      "user": "Elyse Kadokura",
      "rating": "1/5",
      "text": "I checked in at the Walker Hotel Tribeca on Friday 10/01 and was planning on staying for a week. On Mon 10/04, I started getting bites on my ankles. Tuesday 10/05 I started to feel raised bumps on my arm and on Wed the bites were painful and itchy. I asked for a new room and got placed in a new room. At this point I was hoping they were hives or an allergic reaction. I submitted pictures to a dermatologist through the teladoc service through my insurance and she responded right away that the bites were most likely bed bug bites. I learned that bed bugs bite in a line called \"breakfast, lunch, dinner\" configuration (you can see this along my elbow in the attached pictures). I immediately notified the front desk and checked out of the hotel. I was supposed to stay at friends' places for the rest of my stay but couldn't risk bringing bed bugs to their homes so had to buy a new flight home earlier than expected.\n\nThe hotel said that in order for me to get a refund they were having an inspection done of the room.  They would refund me if they found bed bugs but if they didn't, i would still have to pay the full amount. They called me the next day and said they didn't find evidence of bed bugs and they offered a discount on my next stay. I understand that they have to protect themself from saying they are at fault; however, given that I incurred the costs of medical appt, medication, new flight, new hotel, cleaning supplies, laundromat, dry cleaning, new luggage, plus cutting my trip short it is very, very painful for me that I still have to give them >$1,000.\n\nSome things I've learned:\n1. Even seemingly nice hotels can have bed bugs\n2. Always do your own check. When I left the room, I was really hoping they were hives so didn't check myself. I'm also going to do a thorough check every time i get to a new hotel.\n3. Don't get too upset about things that you can't control.\n\nEdit: adding photo a few days later. Bites still painful and itchy",
      "date": null,
      "userInfo": "Local Guide · 19 reviews · 5 photos",
      "photos": []
    },
    {
      "user": "J V",
      "rating": "5/5",
      "text": "While I cannot speak to the rooms, I did spend some time in the lounge/waiting area and enjoyed a delicious old fashioned. Service was excellent, I’m looking forward to going back",
      "date": null,
      "userInfo": "Local Guide · 214 reviews · 9,495 photos",
      "photos": [
        "https://lh5.googleusercontent.com/p/AF1QipNUtJC7n8TCLRMepgTRFKV3DFpXYl6eMwI5vtxz=w300-h225-p-k-no",
        "https://lh5.googleusercontent.com/p/AF1QipO0MdLTjy1PHeKLpcmeQ-Xf8QmgfZClYlL8UDWX=w300-h225-p-k-no",
        "https://lh5.googleusercontent.com/p/AF1QipNLrplgQajSIkTnO8weJ30NzpmiYgRGvkLL4-n1=w300-h225-p-k-no",
        "https://lh5.googleusercontent.com/p/AF1QipOxHqKaLpzq9EkRooiRz4iPid9e9t57s2T48O8S=w300-h225-p-k-no"
      ]
    },
    {
      "user": "Alex Macintosh",
      "rating": "5/5",
      "text": "Nice clean hotel, I would be glad to stay here again. The staff is friendly.",
      "date": null,
      "userInfo": "Local Guide · 97 reviews · 407 photos",
      "photos": []
    },
    {
      "user": "Liat Peles",
      "rating": "4/5",
      "text": "Small room but super comfortable and stylish. Well located next to soho and few subway lines",
      "date": null,
      "userInfo": "Local Guide · 310 reviews · 818 photos",
      "photos": [
        "https://lh5.googleusercontent.com/p/AF1QipNeyubLWyEutkYI7RjUhfXaBLoVQsSsXfmiJESg=w300-h450-p-k-no",
        "https://lh5.googleusercontent.com/p/AF1QipO4SDtBUWa4YW96S-6sm3OMxfrdyGDU_ZstiFBv=w300-h450-p-k-no"
      ]
    },
    {
      "user": "Keith Stubbs",
      "rating": "4/5",
      "text": "Tiny room, clean, modern.",
      "date": null,
      "userInfo": "Local Guide · 93 reviews · 92 photos",
      "photos": [
        "https://lh5.googleusercontent.com/p/AF1QipOYPARccXU392iudO-jnDuM19DUkaPUIujSVkpV=w300-h225-p-k-no",
        "https://lh5.googleusercontent.com/p/AF1QipN219UvUY_ucDss0zRq-05NSdCt_iIA6ippS-2m=w300-h225-p-k-no",
        "https://lh5.googleusercontent.com/p/AF1QipNMNS7__xALaGwrNmA5uyRtKFKmMbcSkLcDtTSo=w300-h225-p-k-no",
        "https://lh5.googleusercontent.com/p/AF1QipNd-UqSZN-sRE_yEmnKMqakI8SUW1om35IAcmrX=w300-h225-p-k-no"
      ]
    },
    {
      "user": "Lasse M",
      "rating": "5/5",
      "text": "Decent hotel, clean and modern. In the heart of TriBeCa. However, as typical in NYC though, the rooms are rather small.",
      "date": null,
      "userInfo": "Local Guide · 79 reviews · 7 photos",
      "photos": []
    },
    {
      "user": "Charlie A. Davidson",
      "rating": "5/5",
      "text": "Smallish rooms (which is everywhere in NYC) with cool decoration and theme. Great music. Great coffee in AM.",
      "date": null,
      "userInfo": "Local Guide · 9 reviews · 5 photos",
      "photos": []
    },
    {
      "user": "FreshFire Grill",
      "rating": "1/5",
      "text": "Terrible custom service.  Very impersonal.  Staff lack empathy and hospitality.  Only warmth I received was the the housekeeping lady.  Sad.  So want to be hip, forgot how to be human.",
      "date": null,
      "userInfo": "2 reviews",
      "photos": []
    },
    {
      "user": "Audrius Zujus",
      "rating": "1/5",
      "text": "Tiny rooms, not tidy, no soap, receptions doesn’t answer. You are better off in CitizenM for half the price. Not staying again.",
      "date": null,
      "userInfo": "Local Guide · 44 reviews · 13 photos",
      "photos": []
    },
    {
      "user": "Dim Sum and Doughnuts",
      "rating": "5/5",
      "text": "Love this hotel and everyone who works there! Great views, very clean and totally welcoming. I can’t wait to come back one day! ⭐️⭐️⭐️⭐️⭐️",
      "date": null,
      "userInfo": "30 reviews · 5 photos",
      "photos": []
    },
    {
      "user": "Matthew Lockwood",
      "rating": "5/5",
      "text": "My favorite place to stay in NYC. Great location, A+ staff, and a lobby that feels like your own stylish living room in the heart of Tribeca.",
      "date": null,
      "userInfo": "5 reviews",
      "photos": []
    },
    {
      "user": "Ariel Dabora",
      "rating": "1/5",
      "text": "Avoid this hotel at all costs!\nNo hot water (known problem on floors 6,7,8) alot of misinformation surrounding the issue when we inquired about it",
      "date": null,
      "userInfo": "30 reviews · 12 photos",
      "photos": []
    },
    {
      "user": "Nicholas Miles",
      "rating": "5/5",
      "text": "the walker had me feeling myself. lol. i loved the location and the coffee shop. the views from my room were beautiful!",
      "date": null,
      "userInfo": "Local Guide · 1,474 reviews · 68,284 photos",
      "photos": [
        "https://lh5.googleusercontent.com/p/AF1QipM-W-aCSq4yi8nTvK_TZ2x65zgih4wfkbtm6o-b=w300-h225-p-k-no",
        "https://lh5.googleusercontent.com/p/AF1QipPTRm2eJoi90h8Neg1CwjQ6nP6Kc0R0JxBRpqPQ=w300-h225-p-k-no",
        "https://lh5.googleusercontent.com/p/AF1QipMZIckY0AM5GzyGLcTE3M8LsDBrrVYDCP8PPH7-=w300-h225-p-k-no",
        "https://lh5.googleusercontent.com/p/AF1QipND_Ri0RVib0FafT0_HbnZmcuMgELc0DV9DoNL5=w300-h225-p-k-no"
      ]
    },
    {
      "user": "Stephen Beck",
      "rating": "5/5",
      "text": "Great spot. Good location. Rooms are comfortable. Lobby space is nice. Will stay again.",
      "date": null,
      "userInfo": "5 reviews · 1 photo",
      "photos": []
    },
    {
      "user": "Paige Orzechowski",
      "rating": "5/5",
      "text": "Great value, surprisingly spacious, very cute atmosphere and great location. I was surprised no room service.",
      "date": null,
      "userInfo": "Local Guide · 36 reviews · 42 photos",
      "photos": []
    },
    {
      "user": "Joseph Milligan",
      "rating": "5/5",
      "text": "Great service from Samantha, Johnny and entire staff. They were quick to find solutions to any issues with professionalism and courtesy.  A rare find in todays service industry.",
      "date": null,
      "userInfo": "7 reviews",
      "photos": []
    },
    {
      "user": "Johnny Ricochet",
      "rating": "5/5",
      "text": "Great area , the hotel was beautiful and unique , staff were very polite , helpful and friendly i recommended to anyone visiting NY or Manhattan for that matter 10/10",
      "date": null,
      "userInfo": "18 reviews",
      "photos": []
    },
    {
      "user": "Ryan Shilpin",
      "rating": "5/5",
      "text": "Centrally located and a great staff. The restaurant on premises is superb.",
      "date": null,
      "userInfo": "Local Guide · 214 reviews · 2,236 photos",
      "photos": [
        "https://lh5.googleusercontent.com/p/AF1QipOO8OIPCDptngp1PrPsYsLzcWEzk_a3mG8MtmLa=w300-h225-p-k-no",
        "https://lh5.googleusercontent.com/p/AF1QipOIzWrX4FOnxGhw4cjXS6ULsPQ8-Aogejg1-RkH=w300-h225-p-k-no",
        "https://lh5.googleusercontent.com/p/AF1QipOc5SSSG9akAOBTW5qFMDrevia0KNbfzXogsJnz=w300-h225-p-k-no",
        "https://lh5.googleusercontent.com/p/AF1QipMvwCQgRs51m36iCEZoC6ysI4gAwCKeHbgstLPx=w300-h225-p-k-no"
      ]
    },
    {
      "user": "She so Chic",
      "rating": "5/5",
      "text": "The rooms a super tiny but clean and modern",
      "date": null,
      "userInfo": "5 reviews",
      "photos": []
    },
    {
      "user": "Fname Lname",
      "rating": "2/5",
      "text": "Super small room, lowest value for money.\nNot clean. Not worth price more than 90$.",
      "date": null,
      "userInfo": "4 reviews",
      "photos": []
    },
    {
      "user": "Bernard Hon",
      "rating": "5/5",
      "text": "Excellent hotel stay and friendly staff. Love the lounge area, tastefully furnished and decorated.",
      "date": null,
      "userInfo": "8 reviews · 1 photo",
      "photos": []
    },
    {
      "user": "Emma Matters",
      "rating": "5/5",
      "text": "Extremely attentive staff. Rooms aren’t enormous but are neat and well kept. Lovely common areas",
      "date": null,
      "userInfo": "9 reviews · 5 photos",
      "photos": []
    },
    {
      "user": "Alexander Kern",
      "rating": "4/5",
      "text": "Great value for money and friendly staff- Wi-Fi is too slow however, in the coffee shop and in rooms.",
      "date": null,
      "userInfo": "7 reviews",
      "photos": []
    },
    {
      "user": "Effy Liu",
      "rating": "4/5",
      "text": "Value is great. Good location, easy access to things I need. Very cute lobby/coffee shop.",
      "date": null,
      "userInfo": "Local Guide · 140 reviews · 350 photos",
      "photos": []
    },
    {
      "user": "Linda Rose",
      "rating": "5/5",
      "text": "Amazing views, friendly staff and Blue Bottle Coffee being right in the lobby was the best, so conveniently located as well!",
      "date": null,
      "userInfo": "Local Guide · 15 reviews · 17 photos",
      "photos": [
        "https://lh5.googleusercontent.com/p/AF1QipOWQ-Io3fQXMZEacMfHbnApUzgeBul6_Dk3usMn=w300-h450-p-k-no",
        "https://lh5.googleusercontent.com/p/AF1QipPkhZ_Z-UmZhgu-NfGSe-yHUfF1iQNQ8tM1t8dy=w300-h450-p-k-no"
      ]
    },
    {
      "user": "Wade Trefethen",
      "rating": "5/5",
      "text": "I've not booked a hotel room but the inside of this hotel is very cozy.  I love the lobby.",
      "date": null,
      "userInfo": "Local Guide · 420 reviews · 3,145 photos",
      "photos": []
    },
    {
      "user": "andre wiesmayr",
      "rating": "5/5",
      "text": "Great location, lobby lounge, small but well-designed rooms. Solid choice.",
      "date": null,
      "userInfo": "3 reviews · 5 photos",
      "photos": []
    },
    {
      "user": "Katherine Rodriguez",
      "rating": "5/5",
      "text": "It was my first time here and Erik the employee was very polite, well spoken and helpful. He gave good recommendations, it was a great service, I definitely recommend staying here.😊😊😊",
      "date": null,
      "userInfo": "2 reviews",
      "photos": []
    },
    {
      "user": "Dan Lam",
      "rating": "5/5",
      "text": "Cute rooms, friendly service, great location. Jake at the front door was exceptionally helpful and nice, thank you!",
      "date": null,
      "userInfo": "Local Guide · 17 reviews · 7 photos",
      "photos": []
    },
    {
      "user": "Alex Stecyk",
      "rating": "5/5",
      "text": "Small rooms (it's New York), great location, friendly and helpful staff.  I'll stay there again.",
      "date": null,
      "userInfo": "Local Guide · 21 reviews · 134 photos",
      "photos": []
    },
    {
      "user": "Andrew Oman",
      "rating": "5/5",
      "text": "Great quick service, helpful staff and a clean room.  The room is very small, but that's to be expected in soho.",
      "date": null,
      "userInfo": "Local Guide · 11 reviews · 2 photos",
      "photos": []
    },
    {
      "user": "AKIRRA OUTERBRIDGE",
      "rating": "3/5",
      "text": "THIS HOTEL WAS A VERY NICE PLACE BUT I ONLY WENT THERE FOR A MODELING  AUDITION,  FROM WHAT I CAN SEE  IT IS A NICE PLACE TO STAY, THE STAFF ON SITE AT THE  TIME WAS VERY NICE AND RESPECTFUL",
      "date": null,
      "userInfo": "Local Guide · 299 reviews · 3,999 photos",
      "photos": [
        "https://lh5.googleusercontent.com/p/AF1QipM2mgm2lrBqnNK941NN3KxkgpcfV5LreomXSyIz=w300-h225-p-k-no",
        "https://lh5.googleusercontent.com/p/AF1QipOqcwZJnrPV5aLpUsZPqQCUaRT7q8S0Fe9_UTk8=w300-h225-p-k-no",
        "https://lh5.googleusercontent.com/p/AF1QipOZ-YZGHXnpoj6uiZGO_wrEOa14xeOTXe9aQKmY=w300-h225-p-k-no",
        "https://lh5.googleusercontent.com/p/AF1QipNigZQWQwxKfGI4UCU_idS4RjnBdYLy_W1Cm97B=w300-h225-p-k-no"
      ]
    },
    {
      "user": "Aimie Neighbour",
      "rating": "5/5",
      "text": "Love the location, super friendly staff and nice rooms. Small but stylish.",
      "date": null,
      "userInfo": "Local Guide · 79 reviews · 263 photos",
      "photos": []
    },
    {
      "user": "Max B",
      "rating": "3/5",
      "text": "Tiny rooms if you get the full size bed. Really meant for 1 person, not 2",
      "date": null,
      "userInfo": "Local Guide · 25 reviews · 1 photo",
      "photos": []
    },
    {
      "user": "Lucy Huang",
      "rating": "5/5",
      "text": "blue bottle coffee on the ground floor",
      "date": null,
      "userInfo": "Local Guide · 380 reviews · 618 photos",
      "photos": []
    },
    {
      "user": "T M",
      "rating": "5/5",
      "text": "Great location and rooms. I appreciate their flexibility, too!",
      "date": null,
      "userInfo": "42 reviews · 9 photos",
      "photos": []
    },
    {
      "user": "G B",
      "rating": "3/5",
      "text": "Really small rooms!",
      "date": null,
      "userInfo": "Local Guide · 83 reviews · 25 photos",
      "photos": []
    },
    {
      "user": "JLC",
      "rating": "1/5",
      "text": "Rooms so small it feels like being in prison. Soulless hotel - do not stay here.",
      "date": null,
      "userInfo": "Local Guide · 300 reviews · 19 photos",
      "photos": []
    },
    {
      "user": "Kate Sweeney",
      "rating": "5/5",
      "text": "Great location, really helpful staff, lovely room...whats not to love?! Would definitely stay again",
      "date": null,
      "userInfo": "2 reviews",
      "photos": []
    },
    {
      "user": "Nick",
      "rating": "5/5",
      "text": "Great rooms, quaint feeling, fair price",
      "date": null,
      "userInfo": "Local Guide · 223 reviews · 26 photos",
      "photos": []
    },
    {
      "user": "W Kim",
      "rating": "5/5",
      "text": "Small room... but other than that, very clean and comfy.",
      "date": null,
      "userInfo": "13 reviews",
      "photos": []
    },
    {
      "user": "Madi Caruso",
      "rating": "5/5",
      "text": "Great hotel, helpful & friendly staff, convenient location.",
      "date": null,
      "userInfo": "Local Guide · 116 reviews · 46 photos",
      "photos": []
    },
    {
      "user": "Mohamed “Ben said”",
      "rating": "1/5",
      "text": "The reception, the woman she’s very rude, I would never go again, please don’t go to this hotel",
      "date": null,
      "userInfo": "25 reviews",
      "photos": []
    },
    {
      "user": "Marcel",
      "rating": "5/5",
      "text": "I stay here all the time. Wake up early grab blue bottle back up to the room . Love it .",
      "date": null,
      "userInfo": "42 reviews · 2 photos",
      "photos": []
    },
    {
      "user": "toby weitz",
      "rating": "2/5",
      "text": "Disappointed that a 4-star hotel doesn’t offer room service or a restaurant and bar inside the hotel.",
      "date": null,
      "userInfo": "1 review",
      "photos": []
    },
    {
      "user": "Tom Marshall",
      "rating": "5/5",
      "text": "Awesome food, On the search for the best pizza in NYC and this is currently at the top of the list.",
      "date": null,
      "userInfo": "Local Guide · 61 reviews · 52 photos",
      "photos": []
    },
    {
      "user": "Ross Caton",
      "rating": "4/5",
      "text": "Tiny rooms but well-designed and high quality",
      "date": null,
      "userInfo": "Local Guide · 25 reviews · 5 photos",
      "photos": []
    },
    {
      "user": "Annette Boyd",
      "rating": "5/5",
      "text": "Love this hotel. Great neighborhood and close to so many things.",
      "date": null,
      "userInfo": "Local Guide · 26 reviews · 12 photos",
      "photos": []
    },
    {
      "user": "Ludovica Bertola",
      "rating": "5/5",
      "text": "Great location, nice room layout and details despite the size",
      "date": null,
      "userInfo": "8 reviews",
      "photos": []
    },
    {
      "user": "Kat G",
      "rating": "4/5",
      "text": "Rooms are tiny but overall good experience here",
      "date": null,
      "userInfo": "Local Guide · 80 reviews · 11 photos",
      "photos": []
    },
    {
      "user": "Laurent Bouaziz",
      "rating": "5/5",
      "text": "Very well located in Tribeca.\nCute tiny rooms with big windows",
      "date": null,
      "userInfo": "Local Guide · 458 reviews · 529 photos",
      "photos": []
    },
    {
      "user": "Michael Assraf",
      "rating": "5/5",
      "text": "Solid stay as usual , don't forget to pay a visit to Corey and Chris at the lobby bar and check out the rooftop",
      "date": null,
      "userInfo": "Local Guide · 90 reviews · 211 photos",
      "photos": []
    },
    {
      "user": "Isabelle Le Normand",
      "rating": "1/5",
      "text": "The hotel has noisy rooms and the worst staff. Bad experience.",
      "date": null,
      "userInfo": "2 reviews",
      "photos": []
    },
    {
      "user": "Daniel Zuzalek",
      "rating": "5/5",
      "text": "Small room, but everything necessary. Great view!",
      "date": null,
      "userInfo": "Local Guide · 46 reviews · 18 photos",
      "photos": []
    },
    {
      "user": "Anothai Niruttimetee",
      "rating": "2/5",
      "text": "The service is just not matched with 4 stars hotel. Quite slow..",
      "date": null,
      "userInfo": "1 review",
      "photos": []
    },
    {
      "user": "Neha me",
      "rating": "5/5",
      "text": "Good clean nice place",
      "date": null,
      "userInfo": "Local Guide · 77 reviews · 48 photos",
      "photos": []
    },
    {
      "user": "Ali Riaz",
      "rating": "4/5",
      "text": "Good little place with tiny cozy rooms. Very friendly staff.",
      "date": null,
      "userInfo": "Local Guide · 54 reviews · 2 photos",
      "photos": []
    },
    {
      "user": "Shelly Dall",
      "rating": "4/5",
      "text": "The internet was very slow. Not cool",
      "date": null,
      "userInfo": "54 reviews · 9 photos",
      "photos": [
        "https://lh5.googleusercontent.com/p/AF1QipNtHozsQBK-VBd1B-pYAqlRK-Ib0iLu9u5UIAQ=w600-h450-p-k-no"
      ]
    },
    {
      "user": "Claudia Gibbs Howard",
      "rating": "5/5",
      "text": "Love this place! Great room in a good location",
      "date": null,
      "userInfo": "Local Guide · 66 reviews · 22 photos",
      "photos": []
    },
    {
      "user": "Fahiye F",
      "rating": "5/5",
      "text": "Great atmosphere with a specialty coffee cafe in the lobby 👌🏾 …",
      "date": null,
      "userInfo": "14 reviews · 3 photos",
      "photos": []
    },
    {
      "user": "Emmanuel Águilar",
      "rating": "5/5",
      "text": "Excellent Wonderful",
      "date": null,
      "userInfo": "Local Guide · 23 reviews · 1 photo",
      "photos": []
    },
    {
      "user": "Jane Doe",
      "rating": "5/5",
      "text": "Top notch service 👌\nClean 😊\nAtmosphere👍\nRooftop bar AMAZING 😊 …",
      "date": null,
      "userInfo": "1 review",
      "photos": []
    },
    {
      "user": "Boney Hayes",
      "rating": "5/5",
      "text": "Food Was delicious and the waiter was very pleasant.",
      "date": null,
      "userInfo": "Local Guide · 307 reviews · 2 photos",
      "photos": []
    },
    {
      "user": "Maria G",
      "rating": "2/5",
      "text": "Bed bugs and dirty. Shame because there's much potential.",
      "date": null,
      "userInfo": "Local Guide · 11 reviews · 754 photos",
      "photos": []
    },
    {
      "user": "Winstonphernandez",
      "rating": "5/5",
      "text": "The best service and they is a very friendly  people ..",
      "date": null,
      "userInfo": "Local Guide · 83 reviews · 23 photos",
      "photos": []
    },
    {
      "user": "Jessica Gómez",
      "rating": "5/5",
      "text": "Excellent experience. They help me with everything I asked for",
      "date": null,
      "userInfo": "11 reviews · 7 photos",
      "photos": []
    },
    {
      "user": "Clinton Kershaw",
      "rating": "5/5",
      "text": "Great location. Great staff. Great view. All great.",
      "date": null,
      "userInfo": "Local Guide · 342 reviews · 27 photos",
      "photos": []
    },
    {
      "user": "David Stevens",
      "rating": "1/5",
      "text": "Wouldn't reccomend for business trips.",
      "date": null,
      "userInfo": "6 reviews",
      "photos": []
    },
    {
      "user": "Timothy Yip",
      "rating": "4/5",
      "text": "shared space with Blue Bottle ... bonus***",
      "date": null,
      "userInfo": "Local Guide · 192 reviews · 111 photos",
      "photos": []
    },
    {
      "user": "Mikaal Sulaiman",
      "rating": "5/5",
      "text": "Great staff, great rooms, great location!",
      "date": null,
      "userInfo": "5 reviews",
      "photos": []
    },
    {
      "user": "Robert Krbavac",
      "rating": "4/5",
      "text": "Clean, great location, lovely staff",
      "date": null,
      "userInfo": "1 review",
      "photos": []
    },
    {
      "user": "Kendra Zumhingst",
      "rating": "5/5",
      "text": "Gorgeous, elegant, we loved the vibe!",
      "date": null,
      "userInfo": "Local Guide · 640 reviews · 1,474 photos",
      "photos": []
    },
    {
      "user": "Mian Gee",
      "rating": "5/5",
      "text": "This place is a very good place .I love this place.",
      "date": null,
      "userInfo": "Local Guide · 44 reviews",
      "photos": []
    },
    {
      "user": "Cleber Machado",
      "rating": "5/5",
      "text": "A really nice hotel for a affordable price",
      "date": null,
      "userInfo": "Local Guide · 20 reviews · 29 photos",
      "photos": []
    },
    {
      "user": "Mohamed Salai",
      "rating": "5/5",
      "text": "Great service camel hotel",
      "date": null,
      "userInfo": "4 reviews",
      "photos": []
    },
    {
      "user": "Trip.com Member",
      "rating": "5/5",
      "text": "Really great place to stay",
      "date": null,
      "userInfo": null,
      "photos": []
    },
    {
      "user": "Mahmudul Hasan",
      "rating": "5/5",
      "text": "⛳️",
      "date": null,
      "userInfo": "Local Guide · 87 reviews · 136 photos",
      "photos": []
    },
    {
      "user": "Julien Maldonato",
      "rating": "5/5",
      "text": "Amazing hotel!",
      "date": null,
      "userInfo": "4 reviews · 2 photos",
      "photos": [
        "https://lh5.googleusercontent.com/p/AF1QipO9soRQDqDoQOoQeYmNmE-7PxH2Z1JgLZ7WRFo_=w600-h450-p-k-no"
      ]
    },
    {
      "user": "Valeria",
      "rating": "5/5",
      "text": "Great stay",
      "date": null,
      "userInfo": "40 reviews · 5 photos",
      "photos": []
    },
    {
      "user": "Philip Cham",
      "rating": "5/5",
      "text": "Beautifully designed with amazing service!",
      "date": null,
      "userInfo": "12 reviews",
      "photos": []
    },
    {
      "user": "Alfredo Castro",
      "rating": "5/5",
      "text": "Nice place and friendly staff.",
      "date": null,
      "userInfo": "37 reviews",
      "photos": []
    },
    {
      "user": "Pavel Popov",
      "rating": "5/5",
      "text": "Nice interior and helpful stuff",
      "date": null,
      "userInfo": "Local Guide · 60 reviews · 6 photos",
      "photos": []
    },
    {
      "user": "Demo Franco",
      "rating": "5/5",
      "text": "Great hotel",
      "date": null,
      "userInfo": "16 reviews · 7 photos",
      "photos": []
    },
    {
      "user": "Tomás González",
      "rating": "5/5",
      "text": "Perfect place to stay in NYC",
      "date": null,
      "userInfo": "Local Guide · 18 reviews · 90 photos",
      "photos": []
    },
    {
      "user": "Amelia Smith",
      "rating": "5/5",
      "text": "Lovely stay in New York",
      "date": null,
      "userInfo": "5 reviews",
      "photos": []
    },
    {
      "user": "Jemimah Watkins",
      "rating": "5/5",
      "text": "Awesome stuff and great services",
      "date": null,
      "userInfo": "Local Guide · 68 reviews · 38 photos",
      "photos": []
    },
    {
      "user": "Elena Sánchez",
      "rating": "5/5",
      "text": "great location and good service",
      "date": null,
      "userInfo": "Local Guide · 33 reviews · 6 photos",
      "photos": []
    },
    {
      "user": "Njm Alddeen",
      "rating": "5/5",
      "text": "Fantastic",
      "date": null,
      "userInfo": "Local Guide · 64 reviews · 114 photos",
      "photos": []
    },
    {
      "user": "jolgartner",
      "rating": "5/5",
      "text": "perfect for lower manhattan",
      "date": null,
      "userInfo": "53 reviews · 22 photos",
      "photos": [
        "https://lh5.googleusercontent.com/p/AF1QipOMNra0irpKa81uLZAWWdsAK-M5J2PBH6iM9kpB=w300-h450-p-k-no",
        "https://lh5.googleusercontent.com/p/AF1QipOdfPuV1abBmtY9_mrbjKgSyp7r3zB32W8PXvv_=w300-h225-p-k-no",
        "https://lh5.googleusercontent.com/p/AF1QipOGnxrkz2AzVIZHEWfX4bhInlZehzROTSPE0zBv=w300-h225-p-k-no"
      ]
    },
    {
      "user": "KaiEvol",
      "rating": "5/5",
      "text": "Cool",
      "date": null,
      "userInfo": "Local Guide · 83 reviews · 32 photos",
      "photos": []
    },
    {
      "user": "Pieter Jooste",
      "rating": "3/5",
      "text": "It was fine -",
      "date": null,
      "userInfo": "7 reviews · 2 photos",
      "photos": []
    },
    {
      "user": "Eli Cook",
      "rating": "5/5",
      "text": "Such a legit vibe!",
      "date": null,
      "userInfo": "Local Guide · 83 reviews · 33 photos",
      "photos": []
    },
    {
      "user": "Alexandra Cukrowicz",
      "rating": "3/5",
      "text": "Rooms too small",
      "date": null,
      "userInfo": "4 reviews",
      "photos": []
    },
    {
      "user": "Adam Kaplan",
      "rating": "5/5",
      "text": "Very fancy!!",
      "date": null,
      "userInfo": "Local Guide · 42 reviews · 3 photos",
      "photos": []
    },
    {
      "user": "Natalia Zamparini",
      "rating": "5/5",
      "text": "Gorgeous lobby.",
      "date": null,
      "userInfo": "Local Guide · 291 reviews · 365 photos",
      "photos": []
    },
    {
      "user": "Sivan Miller",
      "rating": "5/5",
      "text": "Lovley coffee",
      "date": null,
      "userInfo": "Local Guide · 21 reviews",
      "photos": []
    },
    {
      "user": "Joy Sacks",
      "rating": "5/5",
      "text": "THANK YOU SO MUCH!",
      "date": null,
      "userInfo": "5 reviews",
      "photos": []
    },
    {
      "user": "Daniel Schlichting",
      "rating": "2/5",
      "text": "The hotel meets expectations. The rooms are clean, there are fresh towels every day and the drinking water is regularly replenished.\n\nUnfortunately the rooms are very small and the breakfast doesn't deserve its name. There is only one item under $10 from a display and a coffee drink. Since the breakfast room was not always open, breakfast was sometimes available to-go in a bag.\n\nAlthough the travel documents expressly stated that everything was covered by the travel price, a facility fee of $30 plus tax per day was still charged.\n\nOverall, the hotel was unfortunately a disappointment.",
      "date": null,
      "userInfo": "Local Guide · 24 reviews · 11 photos",
      "photos": []
    },
    {
      "user": "Guitarjupp Ferraro",
      "rating": "4/5",
      "text": "Very small but clean rooms. Fresh towels are available every day and cleaning takes place every day.\nBreakfast is delicious.\nThe entire staff is extremely friendly and accommodating.\nThere is a great little bar in the “cellar”.\nThe subway is two minutes away.",
      "date": null,
      "userInfo": "4 reviews · 1 photo",
      "photos": []
    },
    {
      "user": "Katja",
      "rating": "2/5",
      "text": "The hotel is well located, many highlights are within walking distance, good connections to public transport and has a beautiful roof terrace.\nBut that was about it. The staff is \"forced friendly\", room service is actually non-existent.\nThe rooms are tiny (approx. 9 square meters), with great displays with all sorts of buttons on the wall, but there is no light and no light switch on the bed. The sink is in the room, there are no rakes or anything to hang a towel on. My bed was in a niche and could only be accessed from the front, and it was about 1 m high - not so nice when you're not 20 anymore. The hotel lobby is tiny and has no seats. The associated cafe is constantly besieged by people working on their laptops - it is very loud and always full.\nI wouldn't book it again...",
      "date": null,
      "userInfo": "38 reviews",
      "photos": []
    },
    {
      "user": "Natascha Pascale",
      "rating": "3/5",
      "text": "The room was spotless, comfortable bed. Minimal space... And I was alone. The service deserves a mention, very kind, the manager stopped the taxi for me on the corner of the street. Good location in Tribeca. Obviously the price is outside our standards, but here it is regular",
      "date": null,
      "userInfo": "Local Guide · 172 reviews · 323 photos",
      "photos": []
    },
    {
      "user": "Léa Leblanc",
      "rating": "4/5",
      "text": "I stayed for 1 week, if you are alone it's good because the size of the rooms is small (while mine was one of the large ones)\nVery clean and very friendly hotel, the area is pleasant.\nA big thank you in particular to Nelson who was very helpful throughout my stay with me!",
      "date": null,
      "userInfo": "1 review",
      "photos": []
    },
    {
      "user": "Natalia N",
      "rating": "4/5",
      "text": "Served by Argentines, on the opening day of “Charly García” street (11/6/23), they served us exquisite meat empanadas. The atmosphere is very warm. We keep a beautiful memory of that day at the hotel.",
      "date": null,
      "userInfo": "Local Guide · 55 reviews · 255 photos",
      "photos": [
        "https://lh5.googleusercontent.com/p/AF1QipPU97JWlOuNk7opb565hWXqRCF04XKFZUFfBSIv=w300-h225-p-k-no",
        "https://lh5.googleusercontent.com/p/AF1QipNijpl7RfupC2iytMgqS7Hjjsf53MUYYFBNWv67=w300-h225-p-k-no",
        "https://lh5.googleusercontent.com/p/AF1QipNu-V_s2bi8Zdn9NMDm1YkIqofMfP2VbuhcXMxE=w300-h225-p-k-no",
        "https://lh5.googleusercontent.com/p/AF1QipMsLXL5myqCbp5SM1Co1PLbpLGpyDB4VSnkvG_k=w300-h225-p-k-no"
      ]
    },
    {
      "user": "Maria",
      "rating": "1/5",
      "text": "The one star is explained by the fact that €159 of the $200 was withheld after our departure for no reason. We caused NO damage and were not even told the reason for the hold.\nThis is not okay and we will take action against this now.\nIn such a case, I expect to be told what costs have allegedly been incurred - an invoice. But nothing, without reason this amounts to embezzlement.\nThis hotel is NOT recommended!",
      "date": null,
      "userInfo": "49 reviews · 10 photos",
      "photos": []
    },
    {
      "user": "Marion DIDIERJEAN",
      "rating": "5/5",
      "text": "I had a great stay at the Walker Hotel! There is simply nothing to complain about: the cleanliness is impeccable, the service is more than welcoming and smiling, the lobby downstairs is pleasant to relax in with a glass of wine or a quality coffee. The rooms may be a little narrow but 2 large suitcases can easily fit. The gym is pleasant and functional. The hotel is ideally located with metro lines 5 minutes away and not too noisy",
      "date": null,
      "userInfo": "4 reviews",
      "photos": []
    },
    {
      "user": "Andi Snuggle",
      "rating": "5/5",
      "text": "Nice small rooms with a view (8th floor). Good decor and atmosphere, good restaurant in the hotel. Location is also great to get an impression of the real NY. I would definitely book again next time.",
      "date": null,
      "userInfo": "28 reviews",
      "photos": []
    },
    {
      "user": "silvia sacchi",
      "rating": "5/5",
      "text": "Nice hotel, new, small rooms (like many in New York) but extremely well equipped; excellent cleanliness; a three and a half star hotel that also provides bathrobe and slippers; splendid view (we were on the 10th floor); staff always smiling and helpful; perfect location in the heart of Tribeca to visit New York, next to the subway and within walking distance of some of the most important places in the city; nice cafe on the mezzanine floor. Excellent value for New York at Christmas. Recommended and we will return",
      "date": null,
      "userInfo": "6 reviews",
      "photos": []
    },
    {
      "user": "Chatbundi",
      "rating": "5/5",
      "text": "Hotel well located, clean (room cleaned every day), with a superb view! I admit that the rooms are small, but if you are alone it is quite enough!",
      "date": null,
      "userInfo": "25 reviews · 39 photos",
      "photos": [
        "https://lh5.googleusercontent.com/p/AF1QipMjnbapKTXSQMwButhR1Yt4IYukaiEYieywoRim=w300-h450-p-k-no",
        "https://lh5.googleusercontent.com/p/AF1QipOv6PUyW8O_c6cNBw0VbmGwfCZbDUOxCJOEHEMe=w300-h450-p-k-no"
      ]
    },
    {
      "user": "Robin Thies",
      "rating": "5/5",
      "text": "Great hotel, very central to the Canal subway station.\nClean and very courteous staff. You get free water at the reception.\nThere is also a café in the building, which is always very busy.",
      "date": null,
      "userInfo": "Local Guide · 201 reviews · 528 photos",
      "photos": []
    },
    {
      "user": "Ch K",
      "rating": "5/5",
      "text": "I don't know the rooms but I had a great time here 👍🏻\nClean and with music",
      "date": null,
      "userInfo": "Local Guide · 58 reviews · 155 photos",
      "photos": []
    },
    {
      "user": "samuele cantoro",
      "rating": "5/5",
      "text": "Walker Hotel Tribeca\n77 Walker Street, 10013 New York, United States\n\nA structure located between the Tribeca and Lower Manhattan neighborhoods, now constantly changing to keep up with the times. This structure presents itself at its best with quality technological comfort rooms and an increasingly modern environment with fine finishes. A general renovation is currently underway which gives me the opportunity to be the first to occupy one of the many prestigious rooms. I recommend evaluating this property if a trip to the Big Apple is planned in the future.",
      "date": null,
      "userInfo": "Local Guide · 31 reviews · 112 photos",
      "photos": []
    },
    {
      "user": "Isaac Urrutia40",
      "rating": "1/5",
      "text": "Very small rooms, very small rooms 3/10",
      "date": null,
      "userInfo": "Local Guide · 37 reviews · 8 photos",
      "photos": []
    },
    {
      "user": "J.O",
      "rating": "1/5",
      "text": "I don't usually write reviews, but this hotel leaves a lot to be desired, from the moment you reserve a room with payment at the establishment and free cancellation; They decided to charge me days before the trip and when I made the claim they gave me a minor refund, after 15 days they still have not refunded me the difference, shameless, unprofessional on their part.",
      "date": null,
      "userInfo": "2 reviews · 9 photos",
      "photos": []
    },
    {
      "user": "Katrin Woersdoerfer",
      "rating": "5/5",
      "text": "Very nice hotel, rooms small but sufficient. Location is perfect, tribeca is great",
      "date": null,
      "userInfo": "Local Guide · 16 reviews",
      "photos": []
    },
    {
      "user": "Mengna Niu",
      "rating": "4/5",
      "text": "Because of COVID-19, we stayed at this hotel that was open for doctors and nurses. Simple and clean. The internet speed is super fast. Thumbs up.",
      "date": null,
      "userInfo": "Local Guide · 68 reviews · 56 photos",
      "photos": []
    },
    {
      "user": "Alan Sasayama",
      "rating": "2/5",
      "text": "The concept of the hotel itself and the atmosphere of the lobby and cafe are very good, but the staff's response is disappointing.",
      "date": null,
      "userInfo": "Local Guide · 68 reviews · 555 photos",
      "photos": [
        "https://lh5.googleusercontent.com/p/AF1QipOTyRUGk5roUSF9DGJuv-4CfMGXwtYSfx5cGEI=w300-h225-p-k-no",
        "https://lh5.googleusercontent.com/p/AF1QipProb90uB3Ns1wwMZiShEWrQQhKzgWbbAQVSpo=w300-h225-p-k-no",
        "https://lh5.googleusercontent.com/p/AF1QipO-CnLqVPBFN8L-t54UZR5y5xRL9EY9lEnhUi0=w300-h225-p-k-no",
        "https://lh5.googleusercontent.com/p/AF1QipOzONlsJ1W8Qb3b9rUYumHDCgeklgZo6kjo6g4=w300-h225-p-k-no"
      ]
    },
    {
      "user": "Gabriele Ottaviani",
      "rating": "5/5",
      "text": "Very clean hotel\nSmall but well furnished and functional rooms\nVery kind staff\nExcellent location a stone's throw from the metro",
      "date": null,
      "userInfo": "Local Guide · 43 reviews · 181 photos",
      "photos": []
    },
    {
      "user": "Heike Linn",
      "rating": "4/5",
      "text": "The view, I was lucky enough to get a room on the 10th floor, was a dream, especially in the evening and at sunrise.",
      "date": null,
      "userInfo": "10 reviews · 2 photos",
      "photos": []
    },
    {
      "user": "Simone Corradini",
      "rating": "5/5",
      "text": "Fantastic stay in NY in a strategic location. top rooms and service",
      "date": null,
      "userInfo": "Local Guide · 10 reviews · 34 photos",
      "photos": []
    },
    {
      "user": "roey carmi",
      "rating": "5/5",
      "text": "Excellent location in the Soho area\nExcellent value for money.\n\nThe water flow in the bath is weak.",
      "date": null,
      "userInfo": "Local Guide · 128 reviews · 317 photos",
      "photos": []
    },
    {
      "user": "Martin Roser",
      "rating": "5/5",
      "text": "Everything was great...\nStaff, atmosphere, lobby and rooms.\nDefinitely coming back",
      "date": null,
      "userInfo": "1 review",
      "photos": []
    },
    {
      "user": "Ton van der Aar",
      "rating": "5/5",
      "text": "Nice new hotel but still a lot to improve",
      "date": null,
      "userInfo": "Local Guide · 615 reviews · 2,235 photos",
      "photos": []
    },
    {
      "user": "Efrat Atun",
      "rating": "4/5",
      "text": "Excellent location, excellent service, but very, very, very small rooms",
      "date": null,
      "userInfo": "Local Guide · 682 reviews · 11,045 photos",
      "photos": []
    },
    {
      "user": "Eduardo Sanchez Bayona",
      "rating": "5/5",
      "text": "Ideal, the Charly García corner.",
      "date": null,
      "userInfo": "Local Guide · 153 reviews · 336 photos",
      "photos": [
        "https://lh5.googleusercontent.com/p/AF1QipPHmiLxlq9m-8Y5GhOvK6_weEbbLbhubeZplzSX=w600-h450-p-k-no"
      ]
    },
    {
      "user": "Kevin Jara",
      "rating": "1/5",
      "text": "They covered Charly Garcia's mural",
      "date": null,
      "userInfo": "1 review",
      "photos": []
    },
    {
      "user": "jorge zeballos",
      "rating": "5/5",
      "text": "Troca and its good taste. Nothing to add.",
      "date": null,
      "userInfo": "Local Guide · 155 reviews · 80 photos",
      "photos": []
    },
    {
      "user": "Isac Nacipucha",
      "rating": "5/5",
      "text": "Very good and clean to live",
      "date": null,
      "userInfo": "Local Guide · 90 reviews · 148 photos",
      "photos": []
    },
    {
      "user": "Arturo Varela",
      "rating": "5/5",
      "text": "Excellent hotel. Good location",
      "date": null,
      "userInfo": "Local Guide · 272 reviews · 896 photos",
      "photos": []
    },
    {
      "user": "Jenifer Cejovic",
      "rating": "5/5",
      "text": "Great hotel, clean and well located",
      "date": null,
      "userInfo": "Local Guide · 22 reviews · 29 photos",
      "photos": []
    },
    {
      "user": "Hilerstik",
      "rating": "4/5",
      "text": "Warm welcome and clean room",
      "date": null,
      "userInfo": "Local Guide · 213 reviews · 286 photos",
      "photos": []
    },
    {
      "user": "Grazia K",
      "rating": "2/5",
      "text": "The hotel is pretty, but the rooms are really narrow...",
      "date": null,
      "userInfo": "Local Guide · 35 reviews · 59 photos",
      "photos": [
        "https://lh5.googleusercontent.com/p/AF1QipPp0cQGYmjKMR9QU1sJy6S03D1eswlaKPpfq32F=w600-h450-p-k-no"
      ]
    },
    {
      "user": "Anne Mechelen",
      "rating": "5/5",
      "text": "Very good hotel",
      "date": null,
      "userInfo": "Local Guide · 167 reviews · 9 photos",
      "photos": []
    },
    {
      "user": "Stefano Arnold",
      "rating": "4/5",
      "text": " \n\nThank you for taking the time to write this review.  Feedback, good and bad, is … More",
      "date": null,
      "userInfo": "Local Guide",
      "photos": []
    },
    {
      "user": "Stefano Arnold",
      "rating": "4/5",
      "text": " \n\nThank you for taking the time to write this review.  Feedback, good and bad, is a gift and we use this to continue to improve the guest experience.  \n\nPlease feel free to reach out to us directly so we can assist in your next reservation.  We hope to see you again soon.\n\nBest,\nGunita Suri\nDirector of Front Office\nWalker Hotel Tribeca",
      "date": null,
      "userInfo": "Local Guide",
      "photos": []
    },
    {
      "user": "Jackson Chen",
      "rating": "5/5",
      "text": " Thank you for this great review! We are thrilled to read that you enjoyed your stay and hope to see you again soon!",
      "date": null,
      "userInfo": "Local Guide · 14 reviews · 19 photos",
      "photos": []
    },
    {
      "user": "Veronica",
      "rating": "4/5",
      "text": "Greetings Veronica,\n\nThank you for taking the time to complete this review.  We are thrilled to see … More",
      "date": null,
      "userInfo": "22 reviews · 13 photos",
      "photos": []
    },
    {
      "user": "daniel wardwell",
      "rating": "5/5",
      "text": "\nThank you for taking the time to complete this review.  We are thrilled to see that you enjoyed your stay and hope to welcome you back soon! … More",
      "date": null,
      "userInfo": "Local Guide · 34 reviews · 37 photos",
      "photos": []
    },
    {
      "user": "Meltem Barlin",
      "rating": "5/5",
      "text": "Great hotel, great staff",
      "date": null,
      "userInfo": "2 reviews",
      "photos": []
    },
    {
      "user": "manuel gomez ansio",
      "rating": "4/5",
      "text": "We are thrilled to hear that our team went above and beyond, exceeding your expectations to ensure that you felt welcomed on arrival. We are inspired by the work that they do and are so thankful that you have recognized them for their … More",
      "date": null,
      "userInfo": null,
      "photos": []
    },
    {
      "user": "Boggio Nicolo",
      "rating": "4/5",
      "text": "Thank you for this great review! We are thrilled to read that you enjoyed your stay and hope to see you again soon!",
      "date": null,
      "userInfo": "5 reviews",
      "photos": []
    },
    {
      "user": "Stephen Klenert",
      "rating": "5/5",
      "text": "Hi Stephen-\n\nThank you for taking the time to complete this survey.  We are thrilled to see … More",
      "date": null,
      "userInfo": "Local Guide · 22 reviews · 58 photos",
      "photos": []
    },
    {
      "user": "Carlos Mesones",
      "rating": "5/5",
      "text": "Hi Carlos - Thank you for this great review! We are thrilled to read that you enjoyed your stay and hope to see you again soon!",
      "date": null,
      "userInfo": "3 reviews",
      "photos": []
    },
    {
      "user": "corgi lover",
      "rating": "4/5",
      "text": "Hi Corgi Lover - Thank you for this great review! We are thrilled to read that you enjoyed your stay and hope to see you again soon!",
      "date": null,
      "userInfo": null,
      "photos": []
    },
    {
      "user": "J O.",
      "rating": "5/5",
      "text": "Hi J O-\n\nThank you for taking the time to complete this survey.  We are thrilled to see … More",
      "date": null,
      "userInfo": "Local Guide · 37 reviews · 1,383 photos",
      "photos": []
    },
    {
      "user": "Veronica",
      "rating": "4/5",
      "text": "Greetings Veronica,\n\nThank you for taking the time to complete this review.  We are thrilled to see that you enjoyed your stay and hope to welcome you back soon!\n\nBest Regards,\nJoseph Milauskas\nFront Office Manager\nWalker Hotel Tribeca",
      "date": null,
      "userInfo": "22 reviews · 13 photos",
      "photos": []
    },
    {
      "user": "daniel wardwell",
      "rating": "5/5",
      "text": "\nThank you for taking the time to complete this review.  We are thrilled to see that you enjoyed your stay and hope to welcome you back soon!\n\nBest Regards,\nFront Office Manager\nWalker Hotel Tribeca",
      "date": null,
      "userInfo": "Local Guide · 34 reviews · 37 photos",
      "photos": []
    },
    {
      "user": "manuel gomez ansio",
      "rating": "4/5",
      "text": "We are thrilled to hear that our team went above and beyond, exceeding your expectations to ensure that you felt welcomed on arrival. We are inspired by the work that they do and are so thankful that you have recognized them for their amazing hospitality. Please let us know if there is anything we can do to help make you feel more at home!",
      "date": null,
      "userInfo": null,
      "photos": []
    },
    {
      "user": "Stephen Klenert",
      "rating": "5/5",
      "text": "Hi Stephen-\n\nThank you for taking the time to complete this survey.  We are thrilled to see that you enjoyed your stay and hope to welcome you back soon.\n\nBest,\nGunita Suri\nDirector of Front Office\nWalker Hotel Tribeca",
      "date": null,
      "userInfo": "Local Guide · 22 reviews · 58 photos",
      "photos": []
    },
    {
      "user": "J O.",
      "rating": "5/5",
      "text": "Hi J O-\n\nThank you for taking the time to complete this survey.  We are thrilled to see that you enjoyed your stay and hope to welcome you back soon.\n\nBest,\nGunita Suri\nDirector of Front Office\nWalker Hotel Tribeca",
      "date": null,
      "userInfo": "Local Guide · 37 reviews · 1,383 photos",
      "photos": []
    },
    {
      "user": "Aleksei Chistiakov",
      "rating": "5/5",
      "text": "Hi Aleksei- Thank you for this great review! We are thrilled to read that you enjoyed your stay and hope to see you again soon!",
      "date": null,
      "userInfo": "Local Guide · 168 reviews · 586 photos",
      "photos": []
    },
    {
      "user": "Alyssa Marotta",
      "rating": "5/5",
      "text": "Hi Alyssa - Thank you for this great review! We are thrilled to read that you enjoyed your stay and hope to see you again soon!",
      "date": null,
      "userInfo": "Local Guide · 30 reviews · 20 photos",
      "photos": []
    },
    {
      "user": "Helen Diskin",
      "rating": "5/5",
      "text": "Hi Helen - Thank you for this great review! We are thrilled to read that you enjoyed your stay and hope to see you again soon!",
      "date": null,
      "userInfo": null,
      "photos": []
    },
    {
      "user": "Shana Williams",
      "rating": "5/5",
      "text": "Hi Shana - Thank you for this great review! We are thrilled to read that you enjoyed your stay and hope to see you again soon!",
      "date": null,
      "userInfo": "Local Guide · 53 reviews · 69 photos",
      "photos": []
    },
    {
      "user": "Salvador Arvelo",
      "rating": "5/5",
      "text": "Hi Salvador - Thank you for the 5 stars! Hope to see you again soon!",
      "date": null,
      "userInfo": "Local Guide · 129 reviews · 170 photos",
      "photos": []
    },
    {
      "user": "Kyle Wong",
      "rating": "5/5",
      "text": "Hi Kyle- \n\nThank you for this great review! We are thrilled to read that you enjoyed your stay and hope to see you again soon!",
      "date": null,
      "userInfo": "1 review",
      "photos": []
    },
    {
      "user": "Jeremy M",
      "rating": "5/5",
      "text": "Hi Jeremy - Thanks for this review!",
      "date": null,
      "userInfo": "Local Guide · 1,067 reviews · 1,224 photos",
      "photos": []
    },
    {
      "user": "Khalid Hosein",
      "rating": "5/5",
      "text": "Hi Khalid Hosein,\n\nThank you for taking the time to complete this survey.  We are thrilled to see that you enjoyed your stay! We look forward to seeing you again soon!\n\nBest,\nMilt",
      "date": null,
      "userInfo": "Local Guide · 4 reviews · 781 photos",
      "photos": []
    },
    {
      "user": "Victoria Chemko",
      "rating": "5/5",
      "text": "Hi Victoria - \n\nThank you for taking the time to complete this survey.  We are thrilled to see that you enjoyed your stay and hope to welcome you back soon.\n\nBest regards,\n\nJalen T \nFront Desk Manager\nWalker Hotel Tribeca\n\n\n",
      "date": null,
      "userInfo": "Local Guide · 29 reviews · 12 photos",
      "photos": []
    },
    {
      "user": "Pedro Cunial",
      "rating": "4/5",
      "text": "Hi Pedro Cunial,\n\nThank you for this great review! We are thrilled to read that you enjoyed your … More",
      "date": null,
      "userInfo": "Local Guide · 19 reviews",
      "photos": []
    },
    {
      "user": "Parag Srivastava",
      "rating": "5/5",
      "text": "Hi Parag - \n\nThank you for taking the time to complete this survey.  We are thrilled to see that you enjoyed your stay and hope to welcome you back soon.\n\nBest,\nJalen Teasley\nFront Office Manager\nWalker Hotel Tribeca",
      "date": null,
      "userInfo": "Local Guide · 17 reviews · 35 photos",
      "photos": []
    },
    {
      "user": "0 1",
      "rating": "5/5",
      "text": "Thank you for this great review! We are thrilled to read that you enjoyed your stay and hope to see you again soon!",
      "date": null,
      "userInfo": "Local Guide · 40 reviews · 24 photos",
      "photos": []
    },
    {
      "user": "Ani",
      "rating": "4/5",
      "text": "Hi Ana - Thank you for your review! Hope to see you again soon!",
      "date": null,
      "userInfo": "Local Guide · 42 reviews · 426 photos",
      "photos": []
    },
    {
      "user": "Pedro Cunial",
      "rating": "4/5",
      "text": "Hi Pedro Cunial,\n\nThank you for this great review! We are thrilled to read that you enjoyed your stay and hope to see you again soon!\n\nThanks,\nMilt",
      "date": null,
      "userInfo": "Local Guide · 19 reviews",
      "photos": []
    },
    {
      "user": "Sue Ann Ioanis",
      "rating": "5/5",
      "text": "Hi Sue -\n\nThank you for taking the time to complete this survey.  We are thrilled to see that you enjoyed your stay and hope to welcome you back soon.\n\nBest,\nGunita Suri\nDirector of Front Office\nWalker Hotel Tribeca",
      "date": null,
      "userInfo": "2 reviews",
      "photos": []
    },
    {
      "user": "Daniel Mentado",
      "rating": "5/5",
      "text": "Hi Daniel - \n\nThank you for this great review! We are thrilled to read that you enjoyed your stay and hope to see you again soon!",
      "date": null,
      "userInfo": "Local Guide · 177 reviews · 457 photos",
      "photos": []
    },
    {
      "user": "Aziza 84",
      "rating": "5/5",
      "text": "Greetings Azim,\n\nThank you for taking the time to complete this review.  We are thrilled to see that you enjoyed your stay and hope to welcome you back soon!\n\nBest Regards,\nJoseph Milauskas\nFront Office Manager\nWalker Hotel Tribeca",
      "date": null,
      "userInfo": "Local Guide · 18 reviews · 1 photo",
      "photos": []
    },
    {
      "user": "Charles Shaw",
      "rating": "1/5",
      "text": "Dear Charles\n\nI apologize for any inconvenience or frustration you may have experienced during … More",
      "date": null,
      "userInfo": "Local Guide · 143 reviews",
      "photos": []
    },
    {
      "user": "Charles Shaw",
      "rating": "1/5",
      "text": "Dear Charles\n\nI apologize for any inconvenience or frustration you may have experienced during your stay at our hotel. We truly value your feedback and take your concerns very seriously. Our primary goal is to ensure the comfort and satisfaction of all our guests, and it is disappointing to hear that we fell short of your expectations.\n\nPlease know that we are actively working to address the issues you've raised, and we appreciate you bringing them to our attention. We strive to provide exceptional service and a pleasant atmosphere for all our guests, and we regret that we did not meet your standards on this occasion.\n\nWe would like to make it right and regain your trust. If you would be willing to provide us with more details about your specific concerns, we will take immediate action to resolve them and prevent any similar occurrences in the future. Your satisfaction is of utmost importance to us, and we are committed to ensuring that your next experience with us exceeds your expectations.\n\nOnce again, I apologize for any inconvenience caused. We value your patronage and hope to have the opportunity to welcome you back to our hotel in the future, where we can demonstrate our commitment to providing an exceptional guest experience.\n\nIf you have any further questions or would like to discuss your concerns in more detail, please do not hesitate to reach out to our guest relations team.\n\nBest,\n\nJalen Teasley \nFront Office Manager\nWalker Hotel Tribeca\n\n",
      "date": null,
      "userInfo": "Local Guide · 143 reviews",
      "photos": []
    },
    {
      "user": "L Buckley",
      "rating": "5/5",
      "text": "Thank you for this great review! We are thrilled to read that you enjoyed your stay and hope to see you again soon!",
      "date": null,
      "userInfo": "Local Guide · 33 reviews · 14 photos",
      "photos": []
    },
    {
      "user": "Christina zeng",
      "rating": "5/5",
      "text": "Hi Christina- Thank you for this great review! We are thrilled to read that you enjoyed your stay and hope to see you again soon!",
      "date": null,
      "userInfo": "1 review",
      "photos": []
    },
    {
      "user": "Rachel Maher",
      "rating": "5/5",
      "text": "Greetings Rachel,\n\nThank you for taking the time to complete this review.  We are thrilled to see that you enjoyed your stay and hope to welcome you back soon!\n\nBest Regards,\nJoseph Milauskas\nFront Office Manager\nWalker Hotel Tribeca",
      "date": null,
      "userInfo": "Local Guide · 12 reviews · 164 photos",
      "photos": []
    },
    {
      "user": "Richard Anderson",
      "rating": "5/5",
      "text": "Hi Richard - Thank you for your review!",
      "date": null,
      "userInfo": "Local Guide · 4 reviews",
      "photos": []
    },
    {
      "user": "Zola Richards",
      "rating": "5/5",
      "text": "Hi Zola - Thank you for this great review! We are thrilled to read that you enjoyed your stay and hope to see you again soon!",
      "date": null,
      "userInfo": "5 reviews",
      "photos": []
    },
    {
      "user": "Christina Balgeman",
      "rating": "5/5",
      "text": "Hi Christina - \n\nThank you for taking the time to complete this survey.  We are thrilled to see … More",
      "date": null,
      "userInfo": "Local Guide · 1 review",
      "photos": []
    },
    {
      "user": "Christina Balgeman",
      "rating": "5/5",
      "text": "Hi Christina - \n\nThank you for taking the time to complete this survey.  We are thrilled to see that you enjoyed your stay and hope to welcome you back soon.\n\nBest,\nJalen Teasley\nFront Office Manager\nWalker Hotel Tribeca",
      "date": null,
      "userInfo": "Local Guide · 1 review",
      "photos": []
    },
    {
      "user": "Nicholas Barnes",
      "rating": "5/5",
      "text": "Hi Nicholas Barnes,\n\nThank you for taking the time to complete this survey.  We are thrilled to see … More",
      "date": null,
      "userInfo": "Local Guide · 7 reviews · 82 photos",
      "photos": []
    },
    {
      "user": "Michael Meagher",
      "rating": "5/5",
      "text": "Dear Michael,\nThank you for your 5- star review. We look forward to welcoming you back soon!\nBest,\nMayar - Stay@walkerhoteltribeca.com",
      "date": null,
      "userInfo": "1 review",
      "photos": []
    },
    {
      "user": "Heiko Winter",
      "rating": "5/5",
      "text": "Hi Heiko Winter,\n\nThank you for taking the time to complete this survey.  We look forward to you staying with us on your next visit to NYC.\n\nBest,\nMilton",
      "date": null,
      "userInfo": "3 reviews · 6 photos",
      "photos": []
    },
    {
      "user": "Roger Docerty",
      "rating": "5/5",
      "text": "Hi Roger Docerty,\n\nThank you for this great review! We are thrilled to read that you enjoyed your … More",
      "date": null,
      "userInfo": "1 review",
      "photos": []
    },
    {
      "user": "Claus Riedl",
      "rating": "4/5",
      "text": "Greetings, Claus\n\nThank you for taking the time to complete this review.  We are thrilled to see … More",
      "date": null,
      "userInfo": "Local Guide · 5 reviews · 216 photos",
      "photos": []
    },
    {
      "user": "רנית ארצי",
      "rating": "5/5",
      "text": "Thank you for the 5 stars!",
      "date": null,
      "userInfo": "1 review",
      "photos": []
    },
    {
      "user": "Chris Avery",
      "rating": "4/5",
      "text": "Hi Chris!   Thanks for the 4 star review!  We are still in our soft opening, so be sure to return when our restaurant and new cocktail lounge debuts in early 2020!",
      "date": null,
      "userInfo": "Local Guide · 11 photos",
      "photos": []
    },
    {
      "user": "Nicholas Barnes",
      "rating": "5/5",
      "text": "Hi Nicholas Barnes,\n\nThank you for taking the time to complete this survey.  We are thrilled to see that you enjoyed your stay and hope to welcome you back soon.\n\nKind Regards,\nMilt",
      "date": null,
      "userInfo": "Local Guide · 7 reviews · 82 photos",
      "photos": []
    },
    {
      "user": "Roger Docerty",
      "rating": "5/5",
      "text": "Hi Roger Docerty,\n\nThank you for this great review! We are thrilled to read that you enjoyed your stay and hope to see you again soon!\n\nKind Regards,\nMilton",
      "date": null,
      "userInfo": "1 review",
      "photos": []
    },
    {
      "user": "Claus Riedl",
      "rating": "4/5",
      "text": "Greetings, Claus\n\nThank you for taking the time to complete this review.  We are thrilled to see that you enjoyed your stay and hope to welcome you back soon!\n\nBest Regards,\nEdwin Contreras\nFront Office Manager\nWalker Hotel Tribeca",
      "date": null,
      "userInfo": "Local Guide · 5 reviews · 216 photos",
      "photos": []
    },
    {
      "user": "Helen J",
      "rating": "5/5",
      "text": "Hi Helen, \n\nThank you for this great review! We are thrilled to read that you enjoyed your … More",
      "date": null,
      "userInfo": "20 reviews · 10 photos",
      "photos": []
    },
    {
      "user": "john traverso",
      "rating": "1/5",
      "text": "Hi John,\n\nThank you for your feedback. I am unable to address your review as the information provided here is limited. Please reach out to me so we can discuss further!\nI look forward to speaking with you!\nBest,\nMayar - Mayar@walkerhotels.com",
      "date": null,
      "userInfo": "1 review",
      "photos": []
    },
    {
      "user": "Winter Paulino",
      "rating": "4/5",
      "text": "Hi Winter- Thank you for this great review! We are thrilled to read that you enjoyed your stay and hope to see you again soon!",
      "date": null,
      "userInfo": null,
      "photos": []
    },
    {
      "user": "Ana C",
      "rating": "5/5",
      "text": "Hi Ana C - Thank you for the 5 stars! We hope to see you again soon!",
      "date": null,
      "userInfo": "79 reviews",
      "photos": []
    },
    {
      "user": "Helen J",
      "rating": "5/5",
      "text": "Hi Helen, \n\nThank you for this great review! We are thrilled to read that you enjoyed your stay and hope to see you again soon!\n\nSincerly,\nMilton - GM \nWalker Tribeca",
      "date": null,
      "userInfo": "20 reviews · 10 photos",
      "photos": []
    },
    {
      "user": "Catracha Ruth Jordan",
      "rating": "5/5",
      "text": "Hi Catracha - Thank you for these 5 stars!",
      "date": null,
      "userInfo": "Local Guide · 31 reviews",
      "photos": []
    },
    {
      "user": "Anthony Conley",
      "rating": "5/5",
      "text": "Thank you Anthony!! You Rock!",
      "date": null,
      "userInfo": "8 reviews · 4 photos",
      "photos": []
    },
    {
      "user": "Isobelle",
      "rating": "5/5",
      "text": "Hi Isobelle - Thank you for this great review! We are thrilled to read that you enjoyed your stay and hope to see you again soon!",
      "date": null,
      "userInfo": "Local Guide · 70 reviews · 9 photos",
      "photos": []
    },
    {
      "user": "Mauricio Zabalza",
      "rating": "5/5",
      "text": "Greetings, Mauricio\n\nThank you for taking the time to complete this review.  We are thrilled to see that you enjoyed your stay and hope to welcome you back soon!\n\nBest Regards,\nEdwin Contreras\nFront Office Manager\nWalker Hotel Tribeca",
      "date": null,
      "userInfo": "Local Guide · 265 reviews · 1,826 photos",
      "photos": []
    },
    {
      "user": "Jainam Sheth",
      "rating": "5/5",
      "text": "Hi Jalnam - Thank you for this great review! We are thrilled to read that you enjoyed your stay and hope to see you again soon!",
      "date": null,
      "userInfo": "Local Guide · 7 reviews",
      "photos": []
    },
    {
      "user": "Laurie LaVigne",
      "rating": "5/5",
      "text": "Hi Laurie- \n\nThank you for this great review! We are thrilled to read that you enjoyed your stay and hope to see you again soon!",
      "date": null,
      "userInfo": "Local Guide · 39 reviews · 35 photos",
      "photos": []
    },
    {
      "user": "Claudio Esposito",
      "rating": "4/5",
      "text": "Greetings, Claudio\n\nThank you for taking the time to complete this survey.  We are thrilled to see that you enjoyed your stay and hope to welcome you back soon.\n\nBest Regards,\nEdwin Contreras\nFront Office Manager\nWalker Hotel Tribeca",
      "date": null,
      "userInfo": "Local Guide · 8 reviews",
      "photos": []
    },
    {
      "user": "Justin Varughese",
      "rating": "5/5",
      "text": "Hi Justin - \n\nThank you for this great review! We are thrilled to read that you enjoyed your stay and hope to see you again soon!",
      "date": null,
      "userInfo": "5 reviews · 2 photos",
      "photos": []
    },
    {
      "user": "LatinaPhD.Abroad",
      "rating": "5/5",
      "text": "Hi LatinaPhD.Abroad, \n\nThank you for taking the time to complete this survey.  We are thrilled to see that you enjoyed your stay and hope to welcome you back soon.\n\nKind Regards,\nMilt",
      "date": null,
      "userInfo": "Local Guide · 70 reviews · 249 photos",
      "photos": [
        "https://lh5.googleusercontent.com/p/AF1QipMr9xIRQ78POZ4cmQpnQP7VXkzu1bGQC0x4BvWI=w300-h225-p-k-no",
        "https://lh5.googleusercontent.com/p/AF1QipPbfBXf9D61R3SG5sLYgkbwM9JWPCcrAx8vQ56K=w300-h225-p-k-no",
        "https://lh5.googleusercontent.com/p/AF1QipOWNrEO3Kft7hiyWnMYnw4FWwmLS0YFNAsmC4nw=w300-h225-p-k-no",
        "https://lh5.googleusercontent.com/p/AF1QipNxskzclwzMJD7fJNi-dhKu7InXze4rJYyLQKzU=w300-h225-p-k-no"
      ]
    },
    {
      "user": "Thomas McLennan",
      "rating": "5/5",
      "text": "Hi Thomas - Thank you for this great review! We are thrilled to read that you enjoyed your stay and hope to see you again soon!",
      "date": null,
      "userInfo": "Local Guide · 27 reviews · 1 photo",
      "photos": []
    },
    {
      "user": "Walter Tixi",
      "rating": "5/5",
      "text": "\nThank you for taking the time to write this review.  Feedback, good and bad, is a gift and we use this to continue to improve the guest experience.  \n\nPlease feel free to reach out to us directly so we can assist in your next reservation.  We hope to see you again soon.\n\nBest,\nGunita Suri\nDirector of Front Office\nWalker Hotel Tribeca",
      "date": null,
      "userInfo": null,
      "photos": []
    },
    {
      "user": "Adrian Sibaja",
      "rating": "5/5",
      "text": "Hi Adrian- Thank you for this great review! We are thrilled to read that you enjoyed your stay and hope to see you again soon!",
      "date": null,
      "userInfo": "Local Guide · 18 reviews · 145 photos",
      "photos": []
    },
    {
      "user": "Thongchai Chansamak",
      "rating": "1/5",
      "text": "Good Afternoon Mr. Thongchai,\n\nI'm really sorry to hear that you didn't have a great experience at the hotel, … More",
      "date": null,
      "userInfo": "4 reviews · 5 photos",
      "photos": []
    },
    {
      "user": "Camille Audy",
      "rating": "5/5",
      "text": "Hi Camille - Thank you for this great review! We are thrilled to read that you enjoyed your stay and hope to see you again soon!",
      "date": null,
      "userInfo": "Local Guide · 72 reviews",
      "photos": []
    },
    {
      "user": "Courtney Bartunek (Stacy)",
      "rating": "4/5",
      "text": "Hi Courtney - Thank you for this review! We hope to see you again soon!",
      "date": null,
      "userInfo": "Local Guide · 12 reviews · 21 photos",
      "photos": []
    },
    {
      "user": "Ilia Kebets",
      "rating": "5/5",
      "text": "Hello Ilia Kebets,\n\nThank you for this great review! We are thrilled to read that you enjoyed your … More",
      "date": null,
      "userInfo": "Local Guide · 242 reviews · 35 photos",
      "photos": []
    },
    {
      "user": "Brittany W",
      "rating": "5/5",
      "text": "Dear Brittany Niko\n\nThank you so much for taking the time to share your wonderful review! We are thrilled to hear that you had such a fantastic experience during your stay at our hotel. \n\nKind Regards,\nMilt\n",
      "date": null,
      "userInfo": "1 photo",
      "photos": []
    },
    {
      "user": "マロンマロン",
      "rating": "4/5",
      "text": "We are thrilled to hear that our team went above and beyond, exceeding your expectations to ensure that you felt welcomed on arrival. We are inspired by the work that they do and are so thankful that you have recognized them for their amazing hospitality. Please let us know if there is anything we can do to help make you feel more at home!",
      "date": null,
      "userInfo": "Local Guide · 171 reviews · 373 photos",
      "photos": []
    },
    {
      "user": "Jaclyn Ting",
      "rating": "4/5",
      "text": "Hi Jaclyn - Thank you for this review! Hope to see you again soon.",
      "date": null,
      "userInfo": "Local Guide · 192 reviews · 5 photos",
      "photos": []
    },
    {
      "user": "Stella Mi",
      "rating": "2/5",
      "text": "Hi Stella Mi,\n\nThank you for taking the time to provide us a review. We do hope you give us … More",
      "date": null,
      "userInfo": "5 reviews · 6 photos",
      "photos": []
    },
    {
      "user": "Thongchai Chansamak",
      "rating": "1/5",
      "text": "Good Afternoon Mr. Thongchai,\n\nI'm really sorry to hear that you didn't have a great experience at the hotel, please feel free to reach out to us via email - tribecamanagers@walkerhotels.com. \n\nWe are always looking for ways in which we can improve. We look forward to hearing from you.\n\nHave a great day.\nBest Regards,\nShauna Harley\nDirector of Front Office",
      "date": null,
      "userInfo": "4 reviews · 5 photos",
      "photos": []
    },
    {
      "user": "Ilia Kebets",
      "rating": "5/5",
      "text": "Hello Ilia Kebets,\n\nThank you for this great review! We are thrilled to read that you enjoyed your stay and hope to see you again soon!\n\nAll the best!\nMilton",
      "date": null,
      "userInfo": "Local Guide · 242 reviews · 35 photos",
      "photos": []
    },
    {
      "user": "Stella Mi",
      "rating": "2/5",
      "text": "Hi Stella Mi,\n\nThank you for taking the time to provide us a review. We do hope you give us another opportunity in the near future.\n\nThanks,\nMilt",
      "date": null,
      "userInfo": "5 reviews · 6 photos",
      "photos": []
    },
    {
      "user": "Vivienne Nguyen",
      "rating": "5/5",
      "text": "Hello Vivienne, \n\nWe are excited for the 5 star feedback! … More",
      "date": null,
      "userInfo": "22 reviews · 34 photos",
      "photos": []
    },
    {
      "user": "NamelesS . .",
      "rating": "5/5",
      "text": "Hello,\n\nThank you for staying with us at The Walker, Tribeca!\n \nWe are delighted for your 5star review.\n\nHopefully we have another chance to service you soon!\n\nWarmest Regards, \n\nThe Walker Family!",
      "date": null,
      "userInfo": "1 review · 3 photos",
      "photos": []
    },
    {
      "user": "Modern Choices",
      "rating": "5/5",
      "text": "We are thrilled to hear that out Hotel Went  above and beyond, exceeding your expectations to ensure that you felt welcomed on arrival. We are inspired by the work that they do and are so thankful that you have recognized our team for their amazing hospitality. Please let us know if there is anything we can do to help make you feel more at home!\n\nBest,\nScott Fredericks\nDirector of Front Office\nWalker Hotel Tribeca",
      "date": null,
      "userInfo": "Local Guide · 12 reviews · 30 photos",
      "photos": []
    },
    {
      "user": "Hardev S Syan",
      "rating": "4/5",
      "text": "Greetings Hardev S Syan,\n\nThank you for taking the time to complete this survey.  We are thrilled to see … More",
      "date": null,
      "userInfo": "Local Guide · 16 reviews",
      "photos": []
    },
    {
      "user": "Arthur EZZEDINE",
      "rating": "4/5",
      "text": "Thank you Arthur! Have a wonderful day!",
      "date": null,
      "userInfo": "Local Guide · 30 reviews",
      "photos": []
    },
    {
      "user": "David Cenaffra",
      "rating": "5/5",
      "text": "Thanks for the 5 stars, David!",
      "date": null,
      "userInfo": "3 reviews · 1 photo",
      "photos": []
    },
    {
      "user": "Vivienne Nguyen",
      "rating": "5/5",
      "text": "Hello Vivienne, \n\nWe are excited for the 5 star feedback!\n\nIt was our pleasure, We hope to host you again soon. \n\nThe Walker Family!",
      "date": null,
      "userInfo": "22 reviews · 34 photos",
      "photos": []
    },
    {
      "user": "Hardev S Syan",
      "rating": "4/5",
      "text": "Greetings Hardev S Syan,\n\nThank you for taking the time to complete this survey.  We are thrilled to see that you enjoyed your stay and hope to welcome you back soon.\n\nBest Regards,\nMilt",
      "date": null,
      "userInfo": "Local Guide · 16 reviews",
      "photos": []
    },
    {
      "user": "B L",
      "rating": "4/5",
      "text": "Hi BL - Thank you for the stars and we hope to see you again soon!",
      "date": null,
      "userInfo": "Local Guide · 31 reviews · 93 photos",
      "photos": []
    },
    {
      "user": "J J",
      "rating": "5/5",
      "text": "Hi JJ - Thank you for this great review! We are thrilled to read that you enjoyed your stay and hope to see you again soon!",
      "date": null,
      "userInfo": "15 reviews · 57 photos",
      "photos": [
        "https://lh5.googleusercontent.com/p/AF1QipPvYfU-a8dH5WBZjyJpOQcNlE7G8arTsMomEaN4=w300-h450-p-k-no",
        "https://lh5.googleusercontent.com/p/AF1QipNEh5bwLlA3o4d2n5k9Ig-B5OkI6uE9EmS5SMwD=w300-h450-p-k-no"
      ]
    },
    {
      "user": "Jose Ayerdis",
      "rating": "5/5",
      "text": "Hi Jose - Thank you for this great review! We are thrilled to read that you enjoyed your stay and hope to see you again soon!",
      "date": null,
      "userInfo": "Local Guide · 78 reviews · 218 photos",
      "photos": []
    },
    {
      "user": "George Dickinson",
      "rating": "5/5",
      "text": "Hi George - Thank you for this great review! We are thrilled to read that you enjoyed your stay and hope to see you again soon!",
      "date": null,
      "userInfo": "Local Guide · 78 reviews · 180 photos",
      "photos": []
    },
    {
      "user": "Hanlin Li",
      "rating": "2/5",
      "text": "\n\nThank you for taking the time to write this review.  Feedback, good and bad, is a gift and we use this to continue to improve the guest experience.  \n\n\n\nBest,\nGunita Suri\nDirector of Front Office\nWalker Hotel Tribeca",
      "date": null,
      "userInfo": "5 reviews",
      "photos": []
    },
    {
      "user": "Ann C",
      "rating": "1/5",
      "text": "\nThank you for taking the time to complete this survey.  Feedback, good and bad, is a gift and we use this to continue to improve the guest experience.  \n\nIn the event that you would like to give us another chance, please reach out directly so we can assist in your next reservation.  We hope to see you again soon.\n\nBest,\nScott Fredericks\nDirector of Front Office\nWalker Hotel Tribeca",
      "date": null,
      "userInfo": "1 review",
      "photos": []
    },
    {
      "user": "Juan Bolivar",
      "rating": "5/5",
      "text": "Hi Juan Bolivar\n\nMuch appreciation for this great review! We are thrilled to read that you enjoyed your stay and hope to see you again soon!",
      "date": null,
      "userInfo": "2 reviews",
      "photos": []
    },
    {
      "user": "Vivek Viswanathan",
      "rating": "2/5",
      "text": " Thank you for this great review! We are thrilled to read that you enjoyed your stay and hope to see you again soon!",
      "date": null,
      "userInfo": "5 reviews",
      "photos": []
    },
    {
      "user": "ruby",
      "rating": "4/5",
      "text": "Hi Ruby - Thank you for this great review! Hope to see you again soon.",
      "date": null,
      "userInfo": "3 reviews · 1 photo",
      "photos": []
    },
    {
      "user": "Asa Scott",
      "rating": "5/5",
      "text": "Hi Asa Scott,\n\nThank you for this great review! We are thrilled to read that you enjoyed your stay and hope to see you again soon!\n\nThanks,\nMilt",
      "date": null,
      "userInfo": "Local Guide · 25 reviews · 16 photos",
      "photos": []
    },
    {
      "user": "Tgm",
      "rating": "4/5",
      "text": "Thank you for this great review! We are thrilled to read that you enjoyed your stay and hope to see you again soon!",
      "date": null,
      "userInfo": "Local Guide · 51 reviews",
      "photos": []
    },
    {
      "user": "Marco Warm",
      "rating": "5/5",
      "text": "Hi Marco - Thank you for the 5 stars.  Hope to see you again soon!",
      "date": null,
      "userInfo": "Local Guide · 17 reviews · 417 photos",
      "photos": []
    },
    {
      "user": "唐尧锋",
      "rating": "3/5",
      "text": "Hi  唐尧锋,\n\n Thank you for this great review! We are thrilled to read that you enjoyed your stay and hope to see you again soon!\n\nKind Regards,\nMilton",
      "date": null,
      "userInfo": "Local Guide · 22 reviews",
      "photos": []
    },
    {
      "user": "D. D. (DonDon)",
      "rating": "5/5",
      "text": "Hi Donnie D!   Thanks for the visit!   We will be launching our new restaurant and new cocktail lounge in early 2020!  Be sure to give us a second look!",
      "date": null,
      "userInfo": "Local Guide · 52 reviews · 32 photos",
      "photos": []
    },
    {
      "user": "Anabel Perron",
      "rating": "5/5",
      "text": "Hi Anabel Perron,\n\nThank you for taking the time to complete this survey.  We are thrilled to see that you enjoyed your stay and hope to welcome you back soon.\n\nBest,\nMilton",
      "date": null,
      "userInfo": "Local Guide · 25 reviews · 55 photos",
      "photos": [
        "https://lh5.googleusercontent.com/p/AF1QipPKlnmDZh5UvOK2EIKP0yVwl9hTMlc628SBJymL=w300-h450-p-k-no",
        "https://lh5.googleusercontent.com/p/AF1QipPZEhZ2r0tbtaUzGE1zmv8qQZkXR-wRi_3PgPwf=w300-h225-p-k-no",
        "https://lh5.googleusercontent.com/p/AF1QipN6Zj2uxwlZasKfj7VpTyzyWV8mB6MRV63fETej=w300-h225-p-k-no"
      ]
    },
    {
      "user": "Elijah Valdez",
      "rating": "5/5",
      "text": "Hi Elijah - Thank you for these 5 stars!",
      "date": null,
      "userInfo": "Local Guide · 94 reviews · 2 photos",
      "photos": []
    },
    {
      "user": "Jin L",
      "rating": "4/5",
      "text": "Hi Jin Lin - Thank you for the 4 stars!  We hope to see you again soon.",
      "date": null,
      "userInfo": "Local Guide · 12 reviews · 165 photos",
      "photos": []
    },
    {
      "user": "Tyler Jankauskas",
      "rating": "1/5",
      "text": "Hi Tyler -\n\nThank you for taking the time to complete this survey.  Feedback, good and bad, is a gift and we use this to continue to improve the guest experience.\n\nIn the event that you would like to give us another chance, please reach out directly so we can assist in your next reservation.  We hope to see you again soon.\n\nBest,\nGunita Suri\nDirector of Front Office\nWalker Hotel Tribeca",
      "date": null,
      "userInfo": "13 reviews · 1 photo",
      "photos": []
    },
    {
      "user": "José Sigifredo González Verá",
      "rating": "5/5",
      "text": "Hi Sigifredo - Thank you for the 5 stars! Hope to see you again soon!",
      "date": null,
      "userInfo": "Local Guide · 196 reviews · 376 photos",
      "photos": []
    },
    {
      "user": "Luciano Mannelli",
      "rating": "5/5",
      "text": "Hi Luciano Mannelli,\n\nThank you for this great review! We are delighted that you had a fantastic stay … More",
      "date": null,
      "userInfo": "Local Guide · 26 reviews",
      "photos": []
    },
    {
      "user": "Michelle Turpin",
      "rating": "3/5",
      "text": "Good Afternoon Ms. Turpin,\n\nWe're so very sorry to hear that you had less than an amazing stay. We would … More",
      "date": null,
      "userInfo": "17 reviews · 4 photos",
      "photos": []
    },
    {
      "user": "Luis Marte",
      "rating": "5/5",
      "text": "Hi Luis - Thank you for your review.  We hope that you visit us again soon!",
      "date": null,
      "userInfo": "Local Guide · 8 reviews · 1 photo",
      "photos": []
    },
    {
      "user": "Luciano Mannelli",
      "rating": "5/5",
      "text": "Hi Luciano Mannelli,\n\nThank you for this great review! We are delighted that you had a fantastic stay with us. We look forward to your return stay.\n\nThanks,\nMilt",
      "date": null,
      "userInfo": "Local Guide · 26 reviews",
      "photos": []
    },
    {
      "user": "Michelle Turpin",
      "rating": "3/5",
      "text": "Good Afternoon Ms. Turpin,\n\nWe're so very sorry to hear that you had less than an amazing stay. We would seriously love to hear more, please email tribecamanagers@walkerhotels.com, without your feedback; we cannot improve. \n\nI hope to hear back from you and I'd love it even more if you gave us a second try. \n\nHave  the best day!\nBest,\nShauna Harley\nDirector of Front Office\n\n",
      "date": null,
      "userInfo": "17 reviews · 4 photos",
      "photos": []
    },
    {
      "user": "Simon Boyd",
      "rating": "5/5",
      "text": "Thanks Ninja Ninja for the review!",
      "date": null,
      "userInfo": "Local Guide · 7 reviews",
      "photos": []
    },
    {
      "user": "smastaki",
      "rating": "5/5",
      "text": "Hi Smastaki,\n\nThank you for taking the time to complete this survey.  We look forward to your return visit.\n\nKind Regards,\nMilton",
      "date": null,
      "userInfo": "Local Guide · 6 reviews",
      "photos": []
    },
    {
      "user": "clarence cooper",
      "rating": "5/5",
      "text": "Hi Clarence!\n\nThank you for your 5-star review. We hope to have the pleasure of seeing you soon!",
      "date": null,
      "userInfo": "Local Guide · 20 reviews · 5 photos",
      "photos": []
    },
    {
      "user": "Noel Velez",
      "rating": "5/5",
      "text": " Thank you for this great review! We are thrilled to read that you enjoyed your stay and hope to see you again soon!",
      "date": null,
      "userInfo": "5 reviews · 1 photo",
      "photos": []
    },
    {
      "user": "Klara Crean",
      "rating": "4/5",
      "text": "Dear Klara Crean,\n\nThank you for taking the time to provide us with this review. We are delighted … More",
      "date": null,
      "userInfo": "Local Guide · 12 reviews · 2 photos",
      "photos": []
    },
    {
      "user": "D B",
      "rating": "5/5",
      "text": "Fantastic!  Thank you for the 5 stars!",
      "date": null,
      "userInfo": "Local Guide · 12 reviews · 119 photos",
      "photos": []
    }
  ]
}